[
    {
        "create_date": 1760061913.0,
        "id": "1o2okr6",
        "subreddit": "movies",
        "link": "https://www.reddit.com/r/movies/comments/1o2okr6/official_discussion_roofman_spoilers/",
        "self_text": "#Poll\n\n**If you've seen the film, please rate it [at this poll](https://strawpoll.ai/poll/vote/senL6MSIDp9B)**\n\n**If you haven't seen the film but would like to see the result of the poll [click here](https://strawpoll.ai/poll/results/senL6MSIDp9B)**\n\n#Rankings\n\n[Click here](https://strawpoll.ai/list/ItnAgr4mX7QR) to see the rankings of 2025 films\n\n[Click here](https://youpoll.me/list/4/) to see the rankings for every poll done\n\n---\n\n**Summary**\nBased on the unbelievable true story of Jeffrey Manchester (Channing Tatum), a former Army Ranger and struggling father who robs McDonald’s locations by cutting into their roofs. After escaping prison, he secretly lives inside a Toys “R” Us for months, trying to stay hidden, survive, and start over—until love and his past catch up to him.\n\n**Director**\nDerek Cianfrance\n\n**Writers**\nDerek Cianfrance, Kirt Gunn\n\n**Cast**\n\n* Channing Tatum\n* Kirsten Dunst\n* Ben Mendelsohn\n* LaKeith Stanfield\n* Juno Temple\n* Peter Dinklage\n* Uzo Aduba\n* Melonie Diaz\n* Lily Collias\n* Jimmy O. Yang\n\n**Rotten Tomatoes**\nCritics Score: [83%](https://www.rottentomatoes.com/m/roofman)\n\n**Metacritic**\nScore: [63](https://www.metacritic.com/movie/roofman/)\n\n**VOD**\nIn theaters October 10, 2025\n\n**Trailer**\n[ROOFMAN Official Trailer](https://www.youtube.com/watch?v=6pVA4HwX_V0)\n\n---",
        "title": "Official Discussion - Roofman [SPOILERS]",
        "search_query": "roofman"
    },
    {
        "create_date": 1461686351.0,
        "id": "4gjh2d",
        "subreddit": "todayilearned",
        "link": "https://www.reddit.com/r/todayilearned/comments/4gjh2d/til_a_wanted_robber_known_as_roofman_created_a/",
        "self_text": "",
        "title": "TIL a wanted robber known as \"Roofman\" created a secret hideout inside a Toys \"R\" Us. He played with toys, watched DVDs, ate baby food, and installed a baby video monitor to keep an eye on the store.",
        "search_query": "roofman"
    },
    {
        "create_date": 1757361233.0,
        "id": "1nbxzmz",
        "subreddit": "Charlotte",
        "link": "https://www.reddit.com/r/Charlotte/comments/1nbxzmz/i_worked_at_the_actual_toys_r_us_during_the/",
        "self_text": "Second edit to add: At the time of writing I had not seen the movie, but I did go see it opening day. I really liked it, and I appreciate the writer/director's vision, even if some aspects of the true story were altered or omitted. Absolutely worth a watch, no question.\n\nEdit to add: I put a sketch of the store layout in the comments to show where Jeff's hideout was inside the store and where his tunnel to the Circuit City was.\n\n\n\nI have not seen the movie yet (only the trailers), nor was I involved in the production in any way. I tried so hard to be involved, but every avenue I pursued was met with either silence or a kind but definitive, \"there is nothing we need from you.\" I guess all that is to say that I have no inside information about the movie whatsoever, nor can I speak definitely on why any decisions about the story being told in the movie were made. I only know what I experienced while the events unfolded, and what my coworkers told me of their experiences.\n\nI began working at the Independence Blvd. Toys 'R' Us in 1999 when I was still in high school, until around the middle of 2005. I worked weekends, holidays, and summers to fit my school schedule, and as the store could afford to take me on, since they didn't have a large employment budget and only managers and supervisors were eligible for full-time status. I began as a cashier, and my responsibilities were eventually expanded to floor sales (which was really a catch-all for a very wide range of activities), until I was ultimately promoted to work in the electronics department ('R'Zone) and entrusted with a security access to the high dollar items there. Also, once it was discovered that Jeffrey was living behind the wall, I actually got to go into his lair before it got cleaned out.\n\nLooking at the trailers, the movie does seem to be getting a lot right. Based on interviews, I know they spoke extensively with Jeffrey Manchester and many people involved in the events. They even cast some of those people in small roles (quite glaringly is the distinct absence in the marketing materials of any TRU employees being involved in any way). As far as what they got wrong... Here are a few to get things started:\n\n- Perhaps the most glaring and surprising change to the story is that Jeff's girlfriend, Leigh, was absolutely not a TRU employee. We would have all known and been extremely creeped out (even more than we already were!) if this had been the case.\n\n- They seem to be omitting a major part of the story, which is that there was an abandoned Circuit City attached to the TRU which Jeffrey connected via a hole in the storeroom wall and created a second lair. I also crawled through the hole after the fact and saw this second space before it got cleared out.\n       - Related to the abandoned Circuit City, Jeffrey did not set up his baby monitor surveillance system out in plain sight. He drilled holes in the adjoining wall from the Circuit City and placed the cameras there, which hid them far more effectively.\n\n- There was no store manager at the time that acted in any way how Peter Dinklage's character acts. The managers and comanagers were all kind, if overworked and stressed, and would *never* have sneered at a request to participate in a toy drive (the answer may have been out of their hands, but they would not have been condescending about it). I suspect they are making the Dinklage character out to be the \"bad guy\" of the movie. Which is also weird because, you know, the employee were the victims.\n- Small thing, but our name tags were much smaller, had different designs, and were oval shaped. Also, our uniforms were red button-down shirts and black pants.\n\nThat's all I can think of for now. Ask away!",
        "title": "I worked at the actual Toys \"R\" Us during the events of the movie Roofman. Ask me anything",
        "search_query": "roofman"
    },
    {
        "create_date": 1759214248.0,
        "id": "1nu5zka",
        "subreddit": "movies",
        "link": "https://www.reddit.com/r/movies/comments/1nu5zka/roofman_review_thread/",
        "self_text": "*After escaping from prison, former soldier and professional thief Jeffrey Manchester finds a hideout inside a Toys \"R\" Us, surviving undetected for months while planning his next move. However, when Jeffrey falls for a divorced mom, his double life starts to unravel, setting off a compelling and suspenseful game of cat and mouse as his past closes in.*\n\nDirector: Derek Cianfrace ('The Place Beyond The Pines', 'Blue Valentine')\n\nCast: Channing Tatum, Kirsten Dunst, Peter Dinklage, LaKeith Stanfield, Juno Temple, Ben Mendehlson, Toni Revolori\n\n**Rotten Tomatoes:** [82% (34 reviews)](https://www.rottentomatoes.com/m/roofman)\n\n**Metacritic:** [67 / 100](https://www.metacritic.com/movie/roofman/)\n\nSome Reviews:\n\n[Empire - Sophie Butcher](https://www.empireonline.com/movies/reviews/roofman/) \\- 4 / 5\n\n&gt;Derek Cianfrance delivers a hugely empathetic, very entertaining depiction of an extraordinary life, featuring one of Channing Tatum’s best performances. Expect laughs, tears, and noughties nostalgia.\n\n[Variety - Peter Debruge](https://variety.com/2025/film/reviews/roofman-review-channing-tatum-1236510112/)\n\n&gt;In the end, it’s the through-the-roof chemistry between the two leads that makes the film worthy of repeat viewing. Tatum is no longer the cocky teenager he was in the “Step Up” movies all those years ago, as the star’s affected swagger has eased into a natural confidence, while Dunst brings just the right amount of wariness to a woman who’s devoted to her kids and devout in her faith. While she plays Leigh as closed off to love, leave it to Tatum to find that unconventional point of entry.\n\n[TheWrap - Steve Pond](https://www.thewrap.com/roofman-review-channing-tatum-and-kirsten-dunst-are-a-charmingly-doomed-couple-in-dark-rom-com/)\n\n&gt;The tonal juggling act isn’t always seamless, but in a way, the contradictions are what give Roofman its life. It’s a sad movie, really, but it’s also a lot of fun. And if that doesn’t make sense, maybe it’s the whole point.",
        "title": "'Roofman' - Review Thread",
        "search_query": "roofman"
    },
    {
        "create_date": 1763118814.0,
        "id": "1owtqh7",
        "subreddit": "MovieDetails",
        "link": "https://www.reddit.com/r/MovieDetails/comments/1owtqh7/in_roofman_2025_the_church_going_lady_sally_who/",
        "self_text": "",
        "title": "In Roofman (2025), the church going lady Sally who asks Jeffrey Manchester questions suspecting about his story is actually played by Katherine Scheimreif. Who is a real Sgt. who met Manchester the same way.",
        "search_query": "roofman"
    },
    {
        "create_date": 1762987913.0,
        "id": "1ovk9ve",
        "subreddit": "Letterboxd",
        "link": "https://www.reddit.com/r/Letterboxd/comments/1ovk9ve/thoughts_on_roofman/",
        "self_text": "I genuinely enjoyed this movie, more than I was expecting actually.",
        "title": "Thoughts on Roofman?",
        "search_query": "roofman"
    },
    {
        "create_date": 1716107645.0,
        "id": "1cvjo08",
        "subreddit": "TrueCrimeDiscussion",
        "link": "https://www.reddit.com/r/TrueCrimeDiscussion/comments/1cvjo08/question_about_jeffrey_manchester_aka_the_roofman/",
        "self_text": "I’m sure some of are  aware of Jeffrey Manchester otherwise known as “The Roofman.” He was a spree-robber and former United States Army Reserve officer who robbed up to 40-60 McDonald’s restaurants throughout the country from 1998- 2000, entering them by drilling through the roof and dropping in.\n\n He was eventually arrested and imprisoned. About four years into his sentence, he broke out and relocated to another state, changing his identity. He  ended up living in a Toys \"R\" Us store, staying in backrooms and other areas inside, surviving on kids' snacks and baby food, and exercising during the night when the store was closed by riding a bike throughout the store aisles. During the holiday rush of December 2004, Manchester moved his living quarters to an abandoned Circuit City next-door to avoid detection, creating a room under a stairwell where he painted the walls, put up posters, and passed the time watching movies during the day.\n\nBetween June and January of the following year, he devised an elaborate plan to takeover and rob the Toys \"R\" Us in his biggest robbery to-date, setting up an elaborate surveillance system throughout the store using baby monitors, and even subtly changing employee schedules to accommodate his plans. As time passed, he came under more and more suspicion as employees noticed many missing items as a result of Manchester's residence, making his plans tighter.\n\nEdit:\n\nBy that time, he became a member of the community to bide time until the robbery, even dating a local woman, and joining a Church. He spent a large a lot of his time with her and her kids, bringing them toys he had taken from the store he lived at, and covering his seeming unemployment and homelessness with secretive whispers about a highly-confidential job for the government, saying his quarters were in a restricted office building.\n\nBefore carrying out the big Toys \"R\" Us robbery, He burned down a dentist's office where he had gotten work on his teeth done during his time there, to eliminate his dental records and reportedly robbed a pawn shop to acquire a gun in preparation for the robbery. On the morning of December 26, robbed the Toys \"R\" Us, taking an unknown amount of cash before being forced to flee after two employees were able to slip out of the store to get law enforcement, leading to police discovery of His secret lodgings in Circuit City and discovering the only fingerprint in the room, which was ironically on a DVD of \"Catch Me If You Can\".\n\nOddly enough, he didn’t flee town after committing the Robby. After his girlfriend found out his true identity, who she believed to be a man named \"John Zorn\", the police convinced her to call Him to her home where he was recaptured upon arrival. His expected release date is December 4, 2036.\n\nAnyway, I’m kind of rambling here, To anyone familiar with this case, I’m very interested to know what he Toys “R” Us mancave/hideout looked like. Unfortunately there aren’t any photos anywhere on the internet, but apparently there are articles that talk about it. Can anyone here provide links to the articles that detail its appearance? Thanks.",
        "title": "Question about Jeffrey Manchester aka “The Roofman.",
        "search_query": "roofman"
    },
    {
        "create_date": 1762039117.0,
        "id": "1om2491",
        "subreddit": "Oscars",
        "link": "https://www.reddit.com/r/Oscars/comments/1om2491/why_is_roofman_being_ignored_for_oscar/",
        "self_text": "It’s 86% on Rotten Tomatoes and has a popular actor delivering his best performance to date. Kirsten Dunst is also exceptional in it.\n\nIs it not artsy enough for Oscar voters?",
        "title": "Why is “Roofman” being ignored for Oscar consideration?",
        "search_query": "roofman"
    },
    {
        "create_date": 1760781828.0,
        "id": "1o9rvwf",
        "subreddit": "TheBigPicture",
        "link": "https://www.reddit.com/r/TheBigPicture/comments/1o9rvwf/roofman_thoughts/",
        "self_text": "Finally got to see Roofman yesterday and really, really enjoyed it. It was a surprising mature turn in direction from Derek Cianfrance who also helmed Place Beyond The Pines. Channing Tatum has played this type of character before, but his turn as Jeffrey Manchester I think is his Apex. The way that he acts with kids, the charm that he has with just about everyone and the goodness that exists in his character all feel genuine. \n\nBut at the same time you know that what he's doing is wrong, but he just can't escape the bad decisions that he continues to make, which are presented to be understandabIe. It leaves you wondering when the other shor is going to drop.\n\nThought that Tatum and Dunst had really good chemistry, and there are a few scenes that were so heartbreaking. \n\nAlso, as someone who was a teenager in that era, having this take place in 2004 was awesome with the popular stores and restaurants at the time and also seeing those prices back then lol. But I think the movie is a lot of fun and offers a lot to people, I hope it's able to make it's money because I think it's a well crafted true story that is memorable. ",
        "title": "Roofman Thoughts ?",
        "search_query": "roofman"
    },
    {
        "create_date": 1757027490.0,
        "id": "1n8p89m",
        "subreddit": "popculturechat",
        "link": "https://www.reddit.com/r/popculturechat/comments/1n8p89m/channing_tatum_on_working_with_kirsten_dunst/",
        "self_text": "",
        "title": "Channing Tatum on working with Kirsten Dunst while shooting ‘Roofman’",
        "search_query": "roofman"
    },
    {
        "create_date": 1708740744.0,
        "id": "1ayivfe",
        "subreddit": "todayilearned",
        "link": "https://www.reddit.com/r/todayilearned/comments/1ayivfe/til_of_roofman_a_robber_and_fugitive_who_gave/",
        "self_text": "",
        "title": "TIL of 'Roofman', a robber and fugitive who gave stolen toys to kids, had a secret lair at a Toys R Us. At night at Toys R Us he rode bikes, raced remote-control cars on the roof, ate baby food, and changed employees' work schedules. He told his girlfriend and others he had a secret government job.",
        "search_query": "roofman"
    },
    {
        "create_date": 1760486887.0,
        "id": "1o6w67q",
        "subreddit": "whatthefrockk",
        "link": "https://www.reddit.com/r/whatthefrockk/comments/1o6w67q/kirsten_dunst_in_valentino_fall_2025_rtw_at_the/",
        "self_text": "",
        "title": "Kirsten Dunst in Valentino fall 2025 RTW at the premiere of \"Roofman\" at the 69th BFI London Film Festival (October 14, 2025)",
        "search_query": "roofman"
    },
    {
        "create_date": 1757203462.0,
        "id": "1naetjv",
        "subreddit": "whatthefrockk",
        "link": "https://www.reddit.com/r/whatthefrockk/comments/1naetjv/kirsten_dunst_in_valentino_resort_2026_at_the/",
        "self_text": "",
        "title": "Kirsten Dunst in Valentino Resort 2026 at the 'Roofman' premiere during the 50th Annual Toronto International Film Festival. Styled by Samantha McMillen. (September 6, 2025)",
        "search_query": "roofman"
    },
    {
        "create_date": 1760132809.0,
        "id": "1o3e26i",
        "subreddit": "movies",
        "link": "https://www.reddit.com/r/movies/comments/1o3e26i/channing_tatum_on_roofman_why_the_jump_street/",
        "self_text": "",
        "title": "Channing Tatum on ‘Roofman,’ Why the ‘Jump Street’ Sequel Keeps Falling Apart and His ‘Gambit’ Movie That Had Mutants Having Sex",
        "search_query": "roofman"
    },
    {
        "create_date": 1760395471.0,
        "id": "1o5yqg5",
        "subreddit": "movies",
        "link": "https://www.reddit.com/r/movies/comments/1o5yqg5/october_1012_box_office_recap_tron_ares_flops/",
        "self_text": "https://preview.redd.it/egqb42j5jyuf1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=2215a8d9293f221e2811a3e6058d338a7e22f45d\n\nThird time's not the charm.\n\nDisney tried again in making the ***Tron*** franchise happen, and the result was one of the year's biggest flops. Paramount's ***Roofman*** also debuted with solid numbers, although it also shows the difficulty of selling original comedies. And Jennifer Lopez had one of her worst debuts as lead star with ***Kiss of the Spider Woman***.\n\nThe Top 10 earned a combined $64.0 million this weekend. That's slightly down from last year, when ***Terrifier 3*** opened with an impressive debut, and ***Joker: Folie à Deux*** collapsed a steep 81.4%.\n\nDebuting at #1, Disney's ***Tron: Ares*** flopped with just $33.2 million in 4,000 theaters. That's below ***Tron: Legacy***'s debut ($44.0 million), which is crazy considering this had so much inflation on its side. There's no point comparing it to the 1982 in terms of opening weekend.\n\nGiven that this cost $180 million ($10 million more than ***Legacy***), it's absolutely disappointing that ***Ares*** opened below it. In fact, the performance is eerily similar to the box office failure of ***Blade Runner 2049***: a sci-fi sequel released in October with a $180 million budget, but it could only open to $32.7 million. \n\nThere was a time for a ***Tron*** film, and it seems like Disney just waited too long to capitalize on it, and also took multiple wrong decisions. First, 15 years is way too long to release a sequel. Yes, ***Legacy*** released 28 years later, but Disney effectively sold the film as an original piece that would intrigue newcomers and also attract old fans. For many, this was probably the first ***Tron***, so ***Ares*** lacked the novelty aspect.\n\nBut there's a bigger problem, and it's that ***Tron*** is just not a very successful franchise in terms of box office. The original ***Tron*** made over $50 million worldwide back in 1982, but Disney was reportedly disappointed with its performance, which is why they didn't pursue a sequel. It wasn't until 2005, when Sean Bailey advocated for the film after it garnered a cult following. The result was ***Tron: Legacy*** in 2010, but even though it made $409 million worldwide, the high costs once again disappointed Disney. So you can see that the franchise has performed the studio's expectations twice.\n\nWhile ***Legacy*** also grew on to earn a cult following, Disney didn't really chase the audience. In March 2015, they finally greenlit a ***Legacy*** sequel, with Garrett Hedlund and Olivia Wilde reprising their roles, and Joseph Kosinski returning as director. But just two months later, they scrapped the film after the failure of ***Tomorrowland***. And so everyone involved moved to different projects.\n\nUntil in 2017, Jared Leto began circling a new ***Tron*** film. It didn't fully gain traction until 2023, when Joachim Rønning signed as director, with Leto serving as producer. But the film's lack of connection to ***Legacy*** ended up hurting the film; while it could help a newcomer join the film without watching the prior films, it also lost fans of the previous film. Hell, even Jeff Bridges' presence was limited in the marketing and in the final product. \n\nThe film was also hurt by its Leto connection; he's not really well-regarded by audiences, and sexual misconduct accusations from a few months ago also signaled problem. Double-edged sword though; if Leto didn't advocate and produce, the film wouldn't exist. The marketing was also a mixed bag; they highlighted that the Grid was coming to the real world, when the appeal of ***Tron*** is staying in the Grid. And the film's mediocre reception (56% on RT) was the nail in the coffin. It lost ***Legacy*** fans, and it didn't really intrigue non-fans.\n\nAccording to Disney, 68% of the audience was male. Gen Z and Millennials were its biggest audience; 52% was 18-34. No interest in the people who watched the original back in 1982 though; only 25% of the audience was 45 and over. They gave it a middling \"B+\" on CinemaScore, the exact same score as the previous films. It has no holiday legs to hold well like ***Legacy***, and it's unlikely it adds new fans in the next few weeks when it loses IMAX and PLF. For now, a $85 million domestic total for ***Ares*** is likely. Very, very poor numbers. It means it will have less attendance than the original ***Tron*** ($110 million adjusted).\n\nIn second place, Paramount's ***Roofman*** debuted with $8.1 million in 3,362 theaters. This is director Derek Cianfrance's biggest debut, overtaking ***The Place Beyond the Pines*** ($4.9 million), although in fairness, he never had a single film playing in more than 1,600 theaters. The debut was above Channing Tatum's previous film ***Blink Twice*** ($7.3 million), but below ***Fly Me to the Moon*** ($9.4 million).\n\nThe budget was kept low at $19 million, so this is a solid debut. It simply shows how difficult it can be to sell comedies, especially when it also involves crime. Even with its crazy real-life story, which was plastered all over the marketing, the audience was very limited in giving it a chance. Even though Paramount tried to build buzz by sending it to Toronto, it was still a challenge even with great reviews on its side (85% on RT).\n\nAccording to Paramount, 53% of the audience was male, and its biggest audience was women over 25 at 38%, thanks to Tatum's presence. They gave it a \"B+\" on CinemaScore, which is solid for a film like this. These kinds of films are noted for holding well, and with a weak October ahead, perhaps it could have a decent run. For now, ***Roofman*** should hit close to $30 million domestically.\n\nEven though it lost IMAX and PLF screens, ***One Battle After Another*** had a better drop than last week. It eased just 38%, adding $6.8 million this weekend. That takes its domestic total to $54.6 million, and it should continue holding well for the rest of the month.\n\nAfter its steep drop last week, ***Gabby's Dollhouse: The Movie*** recovered by dropping 35%, for a $3.5 million weekend. The film has earned $26.5 million domestically, and it should finish with a little above $35 million domestically.\n\nIn fifth place, ***The Conjuring: Last Rites*** dropped just 25% this weekend, for a $3.1 million weekend. The film's domestic total stands at $172.6 million.\n\nSony released ***Soul on Fire*** in 1,720 theaters, earning an okay $2.8 million this weekend. Even with an \"A\" on CinemaScore, it'd be a surprise if it reached $10 million.\n\n***Demon Slayer: Kimetsu no Yaiba – The Movie: Infinity Castle*** dropped 36%, for a $2.2 million weekend. With $128.6 million, it has officially passed ***Crouching Tiger, Hidden Dragon*** ($128.5 million) to become the biggest non-English film domestically.\n\nA24's ***The Smashing Machine*** had a very poor debut last week, and its second weekend reflects that audiences are abandoning the ship as soon as possible. The film collapsed all the way to eighth place with a horrible 69%, which is a pathetic $1.7 million weekend. That translates to a very weak $541 per-theater average. A drop like this is not surprising, considering the film's divisive word of mouth. Through 10 days, the film has earned an abysmal $9.8 million. With such a poor per-theater average, it's gonna lose tons of theaters this week. The film is now guaranteed to miss $15 million domestically, and could even miss $12 million depending on its drop next week. It's gonna be Dwayne Johnson's worst ever wide release. It's crazy that despite its high $50 million budget, the film is not gonna be in A24's top 25 highest grossing films.\n\n***The Strangers: Chapter 2*** dropped 42%, adding $1.6 million this weekend. Its domestic total stands at $13.5 million, and it doesn't have much left in the tank.\n\nRounding out the top 10 was IFC's ***Good Boy***. It dropped a pretty good 40%, for a $1.4 million weekend. Through 10 days, the film has made $4.9 million so far.\n\n***The Long Walk*** continues holding well. It eased just 39%, grossing $1 million. That took its domestic total to $33.9 million.\n\nIn 12th place, Roadside Attractions' ***Kiss of the Spider Woman*** flopped with an abysmal $891,046 in 1,331 theaters. That's Jennifer Lopez's worst ever wide debut, and it translates to a meager $669 per-theater average. Unsurprisingly, the film just couldn't connect with audiences. With little award buzz, the film is going to disappear quickly from theaters. Needless to say, it won't come anywhere close to the 1985 original's domestic gross ($17 million).\n\nAmazon MGM released Luca Guadagnino's ***After the Hunt*** in 6 theaters. It earned $158,679, which is a solid $26,447 per-theater average. It's set to expand into around 1,200 theaters this weekend.\n\nA24 also released ***If I Had Legs I'd Kick You*** in 4 theaters. It earned $89,164, averaging $22,291 in each theater. It will continue adding theaters in the next few weeks.\n\n#**OVERSEAS**\n\n***Tron: Ares*** also got off to a very weak start outside America. It opened with just $26.7 million overseas, for a very poor $59.9 million worldwide debut. It had very soft to mediocre debuts in Mexico ($2.9M), the UK ($2.4M), France ($1.9M), Australia ($1.5M) and Germany ($1.4M). Given its massive $180 million budget, the film's path to profitability is going to be insanely hard. Nowhere close to ***Legacy***'s $409 million worldwide finish. We'd like to say that this is the nail in the coffin for the franchise, but let's face it, we'll probably see another one in 15-20 years.\n\n***One Battle After Another*** added $15 million this weekend, taking its worldwide total to $138.1 million. The best markets are the UK ($11.2M), France ($8.5M), Germany ($6.4M), Italy ($4.4M) and Australia ($4M). It reaches its final market, China, this week.\n\n***Gabby's Dollhouse: The Movie*** added $7 million, for a $46.3 million worldwide total. Its best markets are Australia ($2.9M), Mexico ($2M), Italy ($1.7M), France ($1.1M) and Poland ($1.1M).\n\n***The Conjuring: Last Rites*** has crossed $300 million overseas, and its worldwide total is now $473 million. Best markets are Mexico ($30.5M), the UK ($24.1M), France ($22.3M), Brazil ($17.5M) and Germany ($16.4M).\n\nWith $648 million worldwide, ***Demon Slayer: Kimetsu no Yaiba – The Movie: Infinity Castle*** is now officially the fifth biggest film of the year.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*A Big Bold Beautiful Journey* | Sep/19 | Sony | $3,252,578 | $6,671,082 | $20,171,082 | $45M\n\n- There's nothing beautiful about this. Sony's ***A Big Bold Beautiful Journey*** has closed after just 3 weeks with an abysmal $6 million domestically and $20 million worldwide. A big failure, even considering its mid $45 million budget. A huge, huge stain in the careers of Margot Robbie, Colin Farrell, and director Kogonada. Even with the talent, poor reviews and word of mouth sank the film. Ouch.\n\n#**THIS WEEKEND**\n\nUniversal is releasing Blumhouse's ***Black Phone 2***. Despite the original's ending, Ethan Hawke is back, going full Freddy Krueger mode. Given that it surprised everyone by grossing $161 million worldwide, a sequel felt inevitable. But there's still questions over whether the audience is on board with a sequel, and Blumhouse's brand has taken a massive dive in the past year with so many failures. Will this save them?\n\nLionsgate is releasing Aziz Ansari's directorial debut ***Good Fortune***, starring Ansari, Seth Rogen and Keanu Reeves. It seeks to bring comedy into theaters, with a fantasy angle (a guardian angel causes a body swap and shenanigans ensue). It had a solid response in Toronto (83% on RT), but it remains to be seen if audiences will show up.\n\nIn limited release, Sony Pictures Classics is releasing Richard Linklater's ***Blue Moon***, starring Ethan Hawke, Margaret Qualley, Bobby Cannavale, and Andrew Scott. With high acclaim (97% on RT, 78 on Metacritic), look for this to have one of the year's strongest per-theater averages.\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "title": "October 10-12 Box Office Recap – 'Tron: Ares' flops with just $33.2M domestically and $59.9M worldwide, against a $180M budget. 'Roofman' opens in second place, with a solid $8.1M. A24's 'The Smashing Machine' collapses a steep 69% on its second weekend.",
        "search_query": "roofman"
    },
    {
        "create_date": 1708792346.0,
        "id": "1ayypba",
        "subreddit": "Damnthatsinteresting",
        "link": "https://www.reddit.com/r/Damnthatsinteresting/comments/1ayypba/this_is_roofman_a_robber_and_fugitive_who_gave/",
        "self_text": "",
        "title": "This is 'Roofman', a robber and fugitive who gave stolen toys to kids. He had a secret lair at a Toys R Us. During the night, he rode bikes, raced remote-control cars on the roof, ate baby food, and changed employees' work schedules. He told his girlfriend and others he had a secret government job.",
        "search_query": "roofman"
    },
    {
        "create_date": 1750771011.0,
        "id": "1ljav0r",
        "subreddit": "movies",
        "link": "https://www.reddit.com/r/movies/comments/1ljav0r/first_images_of_channing_tatum_kirsten_dunst/",
        "self_text": "",
        "title": "First Images of Channing Tatum, Kirsten Dunst, Peter Dinklage, Juno Temple and LaKeith Stanfeld in 'Roofman' - True story of Jeffrey Manchester (Tatum), a charming armed robber who makes an elaborate escape from prison and takes refuge in a Toys \"R\" Us",
        "search_query": "roofman"
    },
    {
        "create_date": 1756915294.0,
        "id": "1n7isp6",
        "subreddit": "movies",
        "link": "https://www.reddit.com/r/movies/comments/1n7isp6/new_poster_for_roofman/",
        "self_text": "",
        "title": "New Poster for \"Roofman\"",
        "search_query": "roofman"
    },
    {
        "create_date": 1760129211.0,
        "id": "1o3cj6s",
        "subreddit": "boxoffice",
        "link": "https://www.reddit.com/r/boxoffice/comments/1o3cj6s/tron_ares_cruising_to_15m_friday_midtohigh_30ms/",
        "self_text": "",
        "title": "‘Tron: Ares’ Cruising To $15M Friday, Mid-To-High $30Ms Opening Weekend; ‘One Battle After Another’ And ‘Roofman’ Fighting For 2nd With $7-7.5M Apiece – Friday PM Box Office Update",
        "search_query": "roofman"
    },
    {
        "create_date": 1760772223.0,
        "id": "1o9pe9h",
        "subreddit": "chingam",
        "link": "https://www.reddit.com/r/chingam/comments/1o9pe9h/watch_the_smashing_machine_2025_full_movie_online/",
        "self_text": "You can **Watch [Any Movies Online Streaming](https://popular-movies-hd-tv.blogspot.com/)** HD Quality!\n\nFans can watch their favorite Movies streaming online. We have all Movies streaming website which provides multiple links so you can watch any Movies as it is being played.\n\n#Click Here: [Watch Popular Movies Streaming Online](https://popular-movies-hd-tv.blogspot.com/) At Home\n\nWe offer the absolute best streaming. Watch from a tablet, smart phone, Mac, or PC. The live stream allows you access to multiple channels like Disney+, Netflix, The Roku Channel, Prime Video, Pluto TV, Plex, Crackle, Paramount, Hulu, Fubotv, Skysports, Peacock, ESPN+, Showtime, CBS Sports, FOX Sports, TNT, NBC Sports and a number of other local television stations.",
        "title": "WaTcH: The Smashing Machine (2025) Full Movie Online Streaming HD Quality Tv|Not Free Live| Assassin—Superman—Good Boy—Anemone—Bone Lake—Killing Faith—TRON Ares—Roofman—Kiss of the Spider Woman—The Conjuring: Last Rites—The Toxic Avenger Unrated—The Lost Princess—Play Dirty",
        "search_query": "roofman"
    },
    {
        "create_date": 1760769040.0,
        "id": "1o9oj80",
        "subreddit": "meonna",
        "link": "https://www.reddit.com/r/meonna/comments/1o9oj80/movie_zone_the_smashing_machine_2025_full_movie/",
        "self_text": "You can **Watch [Any Movies Online Streaming](https://popular-movies-hd-tv.blogspot.com/)** HD Quality!\n\nFans can watch their favorite Movies streaming online. We have all Movies streaming website which provides multiple links so you can watch any Movies as it is being played.\n\n#Click Here: [Watch Popular Movies Streaming Online](https://popular-movies-hd-tv.blogspot.com/) At Home\n\nWe offer the absolute best streaming. Watch from a tablet, smart phone, Mac, or PC. The live stream allows you access to multiple channels like Disney+, Netflix, The Roku Channel, Prime Video, Pluto TV, Plex, Crackle, Paramount, Hulu, Fubotv, Skysports, Peacock, ESPN+, Showtime, CBS Sports, FOX Sports, TNT, NBC Sports and a number of other local television stations.",
        "title": "MOVIE ZONE: The Smashing Machine (2025) Full Movie Online Streaming HD Quality Tv|Not Free Live| Assassin—Superman—Good Boy—Anemone—Bone Lake—Killing Faith—TRON Ares—Roofman—Kiss of the Spider Woman—The Conjuring: Last Rites—The Toxic Avenger Unrated—The Lost Princess—Play Dirty",
        "search_query": "roofman"
    },
    {
        "create_date": 1760772225.0,
        "id": "1o9peah",
        "subreddit": "meonna",
        "link": "https://www.reddit.com/r/meonna/comments/1o9peah/marvel_zombies_2025_full_movie_online_streaming/",
        "self_text": "You can **Watch [Any Movies Online Streaming](https://popular-movies-hd-tv.blogspot.com/)** HD Quality!\n\nFans can watch their favorite Movies streaming online. We have all Movies streaming website which provides multiple links so you can watch any Movies as it is being played.\n\n#Click Here: [Watch Popular Movies Streaming Online](https://popular-movies-hd-tv.blogspot.com/) At Home\n\nWe offer the absolute best streaming. Watch from a tablet, smart phone, Mac, or PC. The live stream allows you access to multiple channels like Disney+, Netflix, The Roku Channel, Prime Video, Pluto TV, Plex, Crackle, Paramount, Hulu, Fubotv, Skysports, Peacock, ESPN+, Showtime, CBS Sports, FOX Sports, TNT, NBC Sports and a number of other local television stations.",
        "title": "Marvel Zombies (2025) Full Movie Online Streaming HD Quality Free Tv—Demon Slayer: Kimetsu no Yaiba-The Movie-Infinity Castle—Avatar: The Way of Water—Brick—One Battle After Another—Deathstalker—If I Had Legs I'd Kick You—Roofman—100 Meters—Fantastic Four—Thunderbolts—Eyes of Wakanda—Movies Streams",
        "search_query": "roofman"
    },
    {
        "create_date": 1760769035.0,
        "id": "1o9oj5w",
        "subreddit": "chingam",
        "link": "https://www.reddit.com/r/chingam/comments/1o9oj5w/marvel_zombies_2025_full_movie_online_streaming/",
        "self_text": "You can **Watch [Any Movies Online Streaming](https://popular-movies-hd-tv.blogspot.com/)** HD Quality!\n\nFans can watch their favorite Movies streaming online. We have all Movies streaming website which provides multiple links so you can watch any Movies as it is being played.\n\n#Click Here: [Watch Popular Movies Streaming Online](https://popular-movies-hd-tv.blogspot.com/) At Home\n\nWe offer the absolute best streaming. Watch from a tablet, smart phone, Mac, or PC. The live stream allows you access to multiple channels like Disney+, Netflix, The Roku Channel, Prime Video, Pluto TV, Plex, Crackle, Paramount, Hulu, Fubotv, Skysports, Peacock, ESPN+, Showtime, CBS Sports, FOX Sports, TNT, NBC Sports and a number of other local television stations.",
        "title": "Marvel Zombies (2025) Full Movie Online Streaming HD Quality Free Tv—Demon Slayer: Kimetsu no Yaiba-The Movie-Infinity Castle—Avatar: The Way of Water—Brick—One Battle After Another—Deathstalker—If I Had Legs I'd Kick You—Roofman—100 Meters—Fantastic Four—Thunderbolts—Eyes of Wakanda—Movies Streams",
        "search_query": "roofman"
    },
    {
        "create_date": 1760769039.0,
        "id": "1o9oj7p",
        "subreddit": "meonna",
        "link": "https://www.reddit.com/r/meonna/comments/1o9oj7p/marvel_zombies_2025_full_movie_online_streaming/",
        "self_text": "You can **Watch [Any Movies Online Streaming](https://popular-movies-hd-tv.blogspot.com/)** HD Quality!\n\nFans can watch their favorite Movies streaming online. We have all Movies streaming website which provides multiple links so you can watch any Movies as it is being played.\n\n#Click Here: [Watch Popular Movies Streaming Online](https://popular-movies-hd-tv.blogspot.com/) At Home\n\nWe offer the absolute best streaming. Watch from a tablet, smart phone, Mac, or PC. The live stream allows you access to multiple channels like Disney+, Netflix, The Roku Channel, Prime Video, Pluto TV, Plex, Crackle, Paramount, Hulu, Fubotv, Skysports, Peacock, ESPN+, Showtime, CBS Sports, FOX Sports, TNT, NBC Sports and a number of other local television stations.",
        "title": "Marvel Zombies (2025) Full Movie Online Streaming HD Quality Free Tv—Demon Slayer: Kimetsu no Yaiba-The Movie-Infinity Castle—Avatar: The Way of Water—Brick—One Battle After Another—Deathstalker—If I Had Legs I'd Kick You—Roofman—100 Meters—Fantastic Four—Thunderbolts—Eyes of Wakanda—Movies Streams",
        "search_query": "roofman"
    },
    {
        "create_date": 1760696481.0,
        "id": "1o8xkew",
        "subreddit": "TheBigPicture",
        "link": "https://www.reddit.com/r/TheBigPicture/comments/1o8xkew/the_should_i_see_it_in_a_movie_theater_test_tron/",
        "self_text": "",
        "title": "The “Should I See It in a Movie Theater?” Test: ‘Tron: Ares,’ ‘Roofman,’ and ‘After the Hunt.’ Plus, the Magic of ‘Mr. Scorsese.’",
        "search_query": "roofman"
    },
    {
        "create_date": 1750856447.0,
        "id": "1lk51kn",
        "subreddit": "movies",
        "link": "https://www.reddit.com/r/movies/comments/1lk51kn/roofman_official_trailer_2025_movie_channing/",
        "self_text": "",
        "title": "Roofman | Official Trailer (2025 Movie) - Channing Tatum, Kirsten Dunst",
        "search_query": "roofman"
    },
    {
        "create_date": 1759081704.0,
        "id": "1nsuoml",
        "subreddit": "boxoffice",
        "link": "https://www.reddit.com/r/boxoffice/comments/1nsuoml/empirebo_updates_smashing_machine_sales_not_good/",
        "self_text": "",
        "title": "EmpireBO: Updates - Smashing Machine sales not good, A24 needs good walk-ups to hit $15m+.  Roofman not moving the needle and needs WOM.  Taylor Swift could hit $35m+.  Tron Ares looking good in the $50m range.  Lots of films go on sale this week and a big one the following week.“",
        "search_query": "roofman"
    },
    {
        "create_date": 1759239749.0,
        "id": "1nudjyx",
        "subreddit": "whatthefrockk",
        "link": "https://www.reddit.com/r/whatthefrockk/comments/1nudjyx/kirsten_dunst_in_valentino_re26_sophie_bille/",
        "self_text": "",
        "title": "Kirsten Dunst in Valentino RE26, Sophie Bille Brahe jewelry at Los Angeles \"Roofman\" premiere",
        "search_query": "roofman"
    },
    {
        "create_date": 1760769040.0,
        "id": "1o9oj85",
        "subreddit": "meonna",
        "link": "https://www.reddit.com/r/meonna/comments/1o9oj85/enjoy_the_smashing_machine_2025_full_movie_online/",
        "self_text": "You can **Watch [Any Movies Online Streaming](https://popular-movies-hd-tv.blogspot.com/)** HD Quality!\n\nFans can watch their favorite Movies streaming online. We have all Movies streaming website which provides multiple links so you can watch any Movies as it is being played.\n\n#Click Here: [Watch Popular Movies Streaming Online](https://popular-movies-hd-tv.blogspot.com/) At Home\n\nWe offer the absolute best streaming. Watch from a tablet, smart phone, Mac, or PC. The live stream allows you access to multiple channels like Disney+, Netflix, The Roku Channel, Prime Video, Pluto TV, Plex, Crackle, Paramount, Hulu, Fubotv, Skysports, Peacock, ESPN+, Showtime, CBS Sports, FOX Sports, TNT, NBC Sports and a number of other local television stations.",
        "title": "ENJOY: The Smashing Machine (2025) Full Movie Online Streaming HD Quality Tv|Not Free Live| Assassin—Superman—Good Boy—Anemone—Bone Lake—Killing Faith—TRON Ares—Roofman—Kiss of the Spider Woman—The Conjuring: Last Rites—The Toxic Avenger Unrated—The Lost Princess—Play Dirty",
        "search_query": "roofman"
    },
    {
        "create_date": 1759311924.0,
        "id": "1nv3uhq",
        "subreddit": "CelebEvents",
        "link": "https://www.reddit.com/r/CelebEvents/comments/1nv3uhq/kara_del_toro_at_the_premiere_of_roofman_in_los/",
        "self_text": "",
        "title": "Kara Del Toro at the premiere of “Roofman” in Los Angeles (29/09/2025)",
        "search_query": "roofman"
    },
    {
        "create_date": 1764026487.0,
        "id": "1p5wmbv",
        "subreddit": "boxoffice",
        "link": "https://www.reddit.com/r/boxoffice/comments/1p5wmbv/paramounts_roofman_has_ended_its_domestic_run/",
        "self_text": "",
        "title": "Paramount's Roofman has ended its domestic run after 6 weeks with $22.7M.",
        "search_query": "roofman"
    },
    {
        "create_date": 1760195096.0,
        "id": "1o3xx0c",
        "subreddit": "boxoffice",
        "link": "https://www.reddit.com/r/boxoffice/comments/1o3xx0c/tron_ares_at_35m37m_roofman_8m_underwhelming_in/",
        "self_text": "",
        "title": "‘Tron: Ares’ At $35M-$37M, ‘Roofman’ $8M Underwhelming In Openings – Box Office",
        "search_query": "roofman"
    },
    {
        "create_date": 1759259340.0,
        "id": "1num5uw",
        "subreddit": "dunstkirsten",
        "link": "https://www.reddit.com/r/dunstkirsten/comments/1num5uw/kirsten_dunst_ready_for_the_los_angeles_premiere/",
        "self_text": "",
        "title": "Kirsten Dunst Ready for the Los Angeles Premiere of Paramount Pictures' \"Roofman\" at Paramount Theatre in Los Angeles - IG September 2025",
        "search_query": "roofman"
    },
    {
        "create_date": 1760112750.0,
        "id": "1o359lb",
        "subreddit": "blankies",
        "link": "https://www.reddit.com/r/blankies/comments/1o359lb/psa_go_see_roofman/",
        "self_text": "I went and saw it on a whim last night because I had a few open AMC A-list slots. Did not expect to leave the theater with my head bowed so the cleaning crew wouldn’t see how red my eyes were. Very different from how the marketing made it out to be, I was expecting a weightless comedy and was shocked by how tragic and tender the film was. Easily a top three Tatum performance imo, and Dunst is spectacular. Probably the most pleasant surprise of the year for me.",
        "title": "PSA: GO SEE ROOFMAN",
        "search_query": "roofman"
    },
    {
        "create_date": 1757205901.0,
        "id": "1nafo1o",
        "subreddit": "Fauxmoi",
        "link": "https://www.reddit.com/r/Fauxmoi/comments/1nafo1o/kirsten_dunst_in_valentino_resort_2026_at_the/",
        "self_text": "",
        "title": "Kirsten Dunst in Valentino Resort 2026 at the 'Roofman' premiere during the 50th Annual Toronto International Film Festival. Styled by Samantha McMillen. (September 6, 2025)",
        "search_query": "roofman"
    },
    {
        "create_date": 1760453693.0,
        "id": "1o6hq2b",
        "subreddit": "boxoffice",
        "link": "https://www.reddit.com/r/boxoffice/comments/1o6hq2b/1m_club_indigenous_monday_1_tron_ares_36m_2_one/",
        "self_text": "",
        "title": "$1M CLUB: INDIGENOUS MONDAY 1. TRON: ARES ($3.6M) 2. ONE BATTLE AFTER ANOTHER ($1.1M) 2. ROOFMAN ($1.1M) 4. GABBY’S DOLLHOUSE ($1M)",
        "search_query": "roofman"
    },
    {
        "create_date": 1759912234.0,
        "id": "1o14wx9",
        "subreddit": "OnCinemaAtTheCinema",
        "link": "https://www.reddit.com/r/OnCinemaAtTheCinema/comments/1o14wx9/s16_e02_roofman_kiss_of_the_spider_woman_episode/",
        "self_text": "",
        "title": "S16 E02 - ‘Roofman’ &amp; ‘Kiss of the Spider Woman’ Episode Discussion",
        "search_query": "roofman"
    },
    {
        "create_date": 1760473401.0,
        "id": "1o6qn7s",
        "subreddit": "dunstkirsten",
        "link": "https://www.reddit.com/r/dunstkirsten/comments/1o6qn7s/kiks_in_london_for_the_roofman_premiere_ig/",
        "self_text": "",
        "title": "'KIK’s in London for the Roofman Premiere' - IG October 2025",
        "search_query": "roofman"
    },
    {
        "create_date": 1760593878.0,
        "id": "1o7ya6c",
        "subreddit": "fashionporn",
        "link": "https://www.reddit.com/r/fashionporn/comments/1o7ya6c/kirsten_dunst_in_valentino_fall_2025_at_the/",
        "self_text": "",
        "title": "Kirsten Dunst in Valentino Fall 2025 at the ‘Roofman’ London Film Festival Premiere [1200 x 1800]",
        "search_query": "roofman"
    },
    {
        "create_date": 1760147872.0,
        "id": "1o3jhy9",
        "subreddit": "RegalUnlimited",
        "link": "https://www.reddit.com/r/RegalUnlimited/comments/1o3jhy9/worst_theatre_experience_tonight_during_roofman/",
        "self_text": "After a terrible week I finally decided to treat myself and see the new movie roofman. \n\nI usually don’t see movies on Fridays or Saturdays but figured what could go wrong. \n\nI’m sitting on an end seat and the entire first half of the movie I hear a guy tapping his foot like he needs to use the bathroom really badly. Which already interrupted the film. \n\nThen finally after 30 minutes he finally decides to get up and go to the restroom. \n\nHe must have missed a step due to running down the stairs but out of nowhere he comes tumbling down next to me knocking my drink over. Which I don’t think he even noticed. This whole ordeal really took me out of the cinematic experience \n\n\nLuckily he was okay. But my theatre experience was ruined and I won’t be going back. ",
        "title": "Worst theatre experience tonight during roofman",
        "search_query": "roofman"
    },
    {
        "create_date": 1760143018.0,
        "id": "1o3hvr6",
        "subreddit": "RegalUnlimited",
        "link": "https://www.reddit.com/r/RegalUnlimited/comments/1o3hvr6/sorry_to_those_watching_roofman_with_me/",
        "self_text": "My most embarrassing moment yet. Spur of the moment decided to go watch Roofman. Because it was such a last minute decision, I didn’t time my liquid consumption well and needed to pee about halfway through the movie. Fortunately there was no one else in my row and I could get to the stairs easily. Unfortunately, I missed a step and crashed/rolled my way down the stairs. I’m totally fine and the adrenaline got me up fast and to the bathroom but this is a public apology to anyone who witnessed that. \n\nAnyway that was a great movie! Maybe I fell because I was on the edge of my seat, highly recommend y’all watch",
        "title": "Sorry to those watching Roofman with me.",
        "search_query": "roofman"
    },
    {
        "create_date": 1760107379.0,
        "id": "1o32tbm",
        "subreddit": "AMCsAList",
        "link": "https://www.reddit.com/r/AMCsAList/comments/1o32tbm/roofman_was_such_a_delight_and_definitely/",
        "self_text": "I always knew Channing Tatum was good actor but man his charisma in this was role great. And based upon the real life story of the Roofman he portrayed them really well. However this should have been near the holiday season. It had all the right marketing for that crowd. ",
        "title": "Roofman was such a delight and definitely surprised me.",
        "search_query": "roofman"
    },
    {
        "create_date": 1757253992.0,
        "id": "1nau3ea",
        "subreddit": "dunstkirsten",
        "link": "https://www.reddit.com/r/dunstkirsten/comments/1nau3ea/kirsten_dunst_attends_the_roofman_world_premiere/",
        "self_text": "",
        "title": "Kirsten Dunst attends the \"Roofman\" World Premiere at the 2025 Toronto International Film Festival at Roy Thomson Hall in Toronto, Ontario - September 2025",
        "search_query": "roofman"
    },
    {
        "create_date": 1759835172.0,
        "id": "1o0bo6t",
        "subreddit": "boxoffice",
        "link": "https://www.reddit.com/r/boxoffice/comments/1o0bo6t/roofman_review_thread/",
        "self_text": "I will continue to update this post as reviews come in.\n\n[**Rotten Tomatoes:**](https://www.rottentomatoes.com/m/roofman) Certified Fresh\n\n**Critics Consensus:** A disarmingly sweet tonal gearshift for director Derek Cianfrance, *Roofman* is shaggy as a narrative but expertly tailored to Channing Tatum's strengths as an eminently likable leading man.\n\n|Critics|Score|**Number of Reviews**|Average Rating (Unofficial)|\n|:-|:-|:-|:-|\n|**All Critics**|85%|115|7.10/10|\n|**Top Critics**|70%|23|6.40/10|\n\n[**Metacritic:**](https://www.metacritic.com/movie/roofman/) 64 (29 Reviews)\n\n**Sample Reviews:**\n\nKatie Walsh, Tribune News Service - Roofman is predominantly a one-man showcase for the full range of Tatum's talents, but the entire ensemble is crucial for any good caper. Dunst's prowess pushes his own performance, while Peter Dinklage offers levity as the stern store manager Mitch. **3/4**\n\nRobert Abele, Los Angeles Times - Roofman, with its breezy decency, knows how to finesse just the right amount of compassion for larceny.\n\nMichael Ordoña, San Francisco Chronicle - “Roofman” hooks viewers with its compelling depiction of a person too smart for his own good. It’s funny and moving, however close to or far from the real events it may be. **3/4**\n\nNatalia Winkelman, New York Times - Here is a protagonist who clearly straddles the line between right and wrong; the trouble is that in “Roofman,” that line wobbles, leaving the movie somewhere between a fun-loving caper and a finger-wagging morality tale.\n\nRafer Guzman, Newsday - Lived-in performances and a sensitive screenplay make for a thoroughly engaging comedy-drama. **3/4**\n\nKyle Smith, Wall Street Journal - A master class in how not to direct a comedy. With its slow pacing, shaky handheld cameras, dishwater cinematography and unnervingly extreme closeups, it feels more like an intense indie drama than a whimsical tale of a robber with a peculiar M.O.\n\nLindsey Bahr, Associated Press -The film succeeds in doing what it aimed for: Presenting a humane portrait of a guy who will be serving most of his life behind bars, in crowd-pleasing packaging. **2.5/4**\n\nDavid Fear, Rolling Stone - It’s a movie that stumbles every so often, overplays its hand numerous time, and relies on an oddball true-story premise and 1000-watt star power to pave over some of the rougher spots. It would also give you its coat if you needed it without asking.\n\nRadheyan Simonpillai, Globe and Mail - The struggle for Cianfrance is getting the tone right with a story about a superficially chivalrous thief who nurtures a sense of kinship with the people he ultimately victimizes.\n\nOdie Henderson, Boston Globe - Tatum’s sparkling charm can only take him so far; the script, by Cianfrance and Kirt Gunn, spends way too much time on a romantic subplot filled with sitcom scenarios and uninteresting characters. **2/4**\n\nBillie Melissa, Newsweek - Cianfrance's Roofman finds the perfect balance between suspense, heart, and pure entertainment, making it one of the most enjoyable watches of 2025.\n\nKristen Lopez, The Film Maven - Roofman succeeds on Channing Tatum's charm which covers up for a pretty thin script. Cianfrance tells another story about personal choice that, unlike his past work, does feel lighter and more hopeful. **C**\n\nSophie Butcher, Empire Magazine - Derek Cianfrance delivers a hugely empathetic, very entertaining depiction of an extraordinary life, featuring one of Channing Tatum’s best performances. Expect laughs, tears, and noughties nostalgia. **4/5**\n\nThelma Adams, AARP Movies for Grownups - An incredibly tender love story develops at the heart of this American true-crime caper. **5/5**\n\nKristy Puchko, Mashable - Roofman is a frustrating watch, refusing to fit into the genre expectations. But that might be precisely the point.\n\nMark Hanson, Slant Magazine - The real Jeffrey Manchester may in fact have been polite, but Derek Cianfrance’s film doesn’t convince you that it needed to be as well. **2/4**\n\nTim Grierson, Screen International - The film tries so hard to paint Jeffrey as an endearingly flawed curiosity that he lacks the rough edges or mystery that would make such a person compelling.\n\nDavid Rooney, The Hollywood Reporter - This is the kind of disarming crowd-pleaser for which cringe-inducing clichés like “it will sneak up and steal your heart” were invented. What’s refreshing about Roofman is that it’s never too aggressive about it. It’s sentimental but sincere.\n\nMarya E. Gates, [RogerEbert.com](http://RogerEbert.com) \\- ‘Roofman’ is a slick but incurious film that is so preoccupied with showing the what of Manchester’s story that it doesn’t bother to examine the why. **2/4**\n\nBenjamin Lee, Guardian - It works mostly because of Tatum and Dunst, a rare on-screen pairing of single parents in their 40s, both trying to navigate a stressful situation, hard enough even without the criminality. There’s real chemistry there. **3/5**\n\nSteve Pond, TheWrap - The tonal juggling act isn’t always seamless, but in a way, the contradictions are what give “Roofman” its life. It’s a sad movie, really, but it’s also a lot of fun. And if that doesn’t make sense, maybe it’s the whole point.\n\nKatie Rife, IndieWire - Unfortunately, however, “Roofman” also capitulates to the feel-good demands of Hollywood storytelling, leaving the pricklier aspects of Manchester’s story on the table. And the film is forgettable as a result. **C+**\n\nPeter Debruge, Variety - In the end, it’s the through-the-roof chemistry between the two leads that makes the film worthy of repeat viewing.\n\n**SYNOPSIS:**\n\nBased on an unbelievable true story, Roofman follows Jeffrey Manchester (Channing Tatum), a former Army Ranger and struggling father who turns to robbing McDonald’s restaurants by cutting holes in their roofs, earning him the nickname: Roofman. After escaping prison, he secretly lives inside a Toys “R” Us for six months, surviving undetected while planning his next move. But when he falls for Leigh (Kirsten Dunst), a divorced mom drawn to his undeniable charm, his double life begins to unravel, setting off a compelling and suspenseful game of cat and mouse as his past closes in.\n\n**CAST:**\n\n* Channing Tatum as Jeffrey Manchester\n* Kirsten Dunst as Leigh Wainscott\n* Ben Mendelsohn as Ron Smith\n* LaKeith Stanfield as Steve\n* Juno Temple as Michelle\n* Melonie Diaz as Molly Price\n* Uzo Aduba as Eileen\n* Lily Collins as as Lindsay Wainscott\n* Jimmy O. Yang as Used-Car Salesman\n* Peter Dinklage as Mitch\n\n**DIRECTED BY:** Derek Cianfrance\n\n**SCREENPLAY BY:** Derek Cianfrance, Kirt Gunn\n\n**PRODUCED BY:** Jamie Patricof, Lynette Howell Taylor, Alex Orlovsky, Duncan Montgomery, Dylan Sellers\n\n**EXECUTIVE PRODUCERS:** Charles M. Barsamian, Derek Cianfrance, Rick Covert, Jonathan Glickman, Kirt Gunn, Cedar Miller, Jonathan Montepare, Chris Parker, Jeff Portnoy, Sam Romano, Jack Selby, Becky Sloviter, Channing Tatum, Randy Jones Toll, Steven J. Toll, D. Mark von Waaden, Matthew von Waaden, Tyler Zacharia, Thom Zadra\n\n**DIRECTOR OF PHOTOGRAPHY:** Andrij Parekh\n\n**PRODUCTION DESIGNER:** Inbal Weinberg\n\n**EDITED BY:** Jim Helton, Ron Patane\n\n**COSTUME DESIGNER:** Erin Benach\n\n**MUSIC BY:** Christopher Bear\n\n**CASTING BY:** Bonnie Timmermann\n\n**RUNTIME:** 126 Minutes\n\n**RELEASE DATE:** October 10, 2025",
        "title": "'Roofman' Review Thread",
        "search_query": "roofman"
    },
    {
        "create_date": 1760644185.0,
        "id": "1o8garc",
        "subreddit": "dunstkirsten",
        "link": "https://www.reddit.com/r/dunstkirsten/comments/1o8garc/kirsten_dunst_attends_roofman_awards_screening/",
        "self_text": "",
        "title": "Kirsten Dunst Attends “Roofman” Awards Screening – London 10/15/2025",
        "search_query": "roofman"
    },
    {
        "create_date": 1760504064.0,
        "id": "1o720ef",
        "subreddit": "JetSetRadio",
        "link": "https://www.reddit.com/r/JetSetRadio/comments/1o720ef/jet_set_radio_future_spotted_in_roofman_2025/",
        "self_text": "I honestly really enjoyed this movie; they did a good job keeping everything period-accurate for the early 2000s, and I feel like the director or someone has an insanely good taste in video games.",
        "title": "Jet Set Radio Future spotted in Roofman (2025)",
        "search_query": "roofman"
    },
    {
        "create_date": 1760280642.0,
        "id": "1o4r1es",
        "subreddit": "boxoffice",
        "link": "https://www.reddit.com/r/boxoffice/comments/1o4r1es/paramounts_roofman_begins_its_box_office_journey/",
        "self_text": "",
        "title": "Paramount’s ROOFMAN begins its box office journey nailing $8M this weekend. Luckily for the studio the pic cost just $19M.",
        "search_query": "roofman"
    },
    {
        "create_date": 1757204124.0,
        "id": "1naf1un",
        "subreddit": "oscarrace",
        "link": "https://www.reddit.com/r/oscarrace/comments/1naf1un/roofman_reviews_and_reactions_thread/",
        "self_text": "[Deadline - Pete Hammond - “‘Roofman’ Review: Channing Tatum &amp; Kirsten Dunst Triumph In Incredible Real-Life Story That Becomes One Of 2025’s Best Movies”](https://deadline.com/2025/09/roofman-review-channing-tatum-kirsten-dunst-toronto-1236507834/)",
        "title": "‘Roofman’ - Reviews and reactions thread",
        "search_query": "roofman"
    },
    {
        "create_date": 1759514936.0,
        "id": "1nx6lwj",
        "subreddit": "dunstkirsten",
        "link": "https://www.reddit.com/r/dunstkirsten/comments/1nx6lwj/kirsten_dunst_at_premiere_of_roofman_at_the/",
        "self_text": "",
        "title": "Kirsten Dunst at Premiere of 'Roofman' at the Paramount Theatre in Los Angeles 09/29/2025",
        "search_query": "roofman"
    },
    {
        "create_date": 1762710342.0,
        "id": "1ospms7",
        "subreddit": "NotFoolingAnybody",
        "link": "https://www.reddit.com/r/NotFoolingAnybody/comments/1ospms7/former_burger_king_in_waxhaw_nc_temporarily/",
        "self_text": "",
        "title": "Former Burger King in Waxhaw, NC temporarily rebranded to a McDonald's to film the movie Roofman.",
        "search_query": "roofman"
    },
    {
        "create_date": 1759944745.0,
        "id": "1o1h35e",
        "subreddit": "boxoffice",
        "link": "https://www.reddit.com/r/boxoffice/comments/1o1h35e/box_office_weekend_forecast_tron_ares_33m_roofman/",
        "self_text": "",
        "title": "Box Office Weekend Forecast: TRON: ARES ($33M+), ROOFMAN, SOUL ON FIRE, and KISS OF THE SPIDER WOMAN Debut for a Quiet Holiday Frame",
        "search_query": "roofman"
    },
    {
        "create_date": 1761519532.0,
        "id": "1ogyli7",
        "subreddit": "Letterboxd",
        "link": "https://www.reddit.com/r/Letterboxd/comments/1ogyli7/saw_two_crime_comedies_today_about_dads_become/",
        "self_text": "Two great leading male performances for two great films. Roofman in particular is fucking incredible. The marketing and poster is kinda misleading. It’s one of the best films of the year",
        "title": "Saw two crime comedies today about Dads become thieves to ‘provide’ for their families. What did you guys think about Mastermind &amp; Roofman?",
        "search_query": "roofman"
    },
    {
        "create_date": 1760195589.0,
        "id": "1o3y49x",
        "subreddit": "entertainment",
        "link": "https://www.reddit.com/r/entertainment/comments/1o3y49x/box_office_tron_ares_hits_the_grid_with_143/",
        "self_text": "",
        "title": "Box Office: ‘Tron: Ares’ Hits the Grid With $14.3 Million Opening Day, Channing Tatum’s ‘Roofman’ Raises $3.2 Million in Second",
        "search_query": "roofman"
    },
    {
        "create_date": 1760486309.0,
        "id": "1o6vyhl",
        "subreddit": "Charlotte",
        "link": "https://www.reddit.com/r/Charlotte/comments/1o6vyhl/go_see_roofman_a_movie_set_and_filmed_in_charlotte/",
        "self_text": "I went into this movie blind so it was pleasant surprise to see familiar sights on the big screen. I squealed a little when the characters strolled through Freedom Park. It was a nice movie to boost.",
        "title": "Go see Roofman, a movie set and filmed in Charlotte",
        "search_query": "roofman"
    },
    {
        "create_date": 1757432580.0,
        "id": "1ncme79",
        "subreddit": "whatthefrockk",
        "link": "https://www.reddit.com/r/whatthefrockk/comments/1ncme79/lakeith_stanfield_wearing_dior_spring_2026_to_the/",
        "self_text": "",
        "title": "LaKeith Stanfield wearing Dior Spring 2026 to the ‘Roofman’ TIFF Premiere, styled by Jason Bolden [September 6, 2025]",
        "search_query": "roofman"
    },
    {
        "create_date": 1756825796.0,
        "id": "1n6m3rq",
        "subreddit": "MarvelStudiosSpoilers",
        "link": "https://www.reddit.com/r/MarvelStudiosSpoilers/comments/1n6m3rq/channing_tatums_roofman_reinvention_why_he_wanted/",
        "self_text": "",
        "title": "Channing Tatum’s ‘Roofman’ Reinvention: Why He Wanted to Play a Real-Life Criminal for Derek Cianfrance’s Surprising Film and How He’s Reviving Gambit for ‘Avengers: Doomsday’",
        "search_query": "roofman"
    },
    {
        "create_date": 1757067658.0,
        "id": "1n91fy2",
        "subreddit": "dunstkirsten",
        "link": "https://www.reddit.com/r/dunstkirsten/comments/1n91fy2/channing_tatum_on_working_with_kirsten_dunst/",
        "self_text": "",
        "title": "Channing Tatum on working with Kirsten Dunst while shooting ‘Roofman’",
        "search_query": "roofman"
    },
    {
        "create_date": 1757392528.0,
        "id": "1nc9okg",
        "subreddit": "popculturechat",
        "link": "https://www.reddit.com/r/popculturechat/comments/1nc9okg/sebastian_stan_and_annabelle_wallis_at_the/",
        "self_text": "",
        "title": "Sebastian Stan and Annabelle Wallis at the special screening of 'Roofman' in New York.",
        "search_query": "roofman"
    },
    {
        "create_date": 1760539547.0,
        "id": "1o7czr2",
        "subreddit": "boxoffice",
        "link": "https://www.reddit.com/r/boxoffice/comments/1o7czr2/1m_club_discount_tuesday_1_tron_ares_32m_2/",
        "self_text": "",
        "title": "$1M CLUB: DISCOUNT TUESDAY 1. TRON: ARES ($3.2M) 2. ROOFMAN ($1.2M)",
        "search_query": "roofman"
    },
    {
        "create_date": 1757201599.0,
        "id": "1nae5uk",
        "subreddit": "popculturechat",
        "link": "https://www.reddit.com/r/popculturechat/comments/1nae5uk/kirsten_dunst_at_the_premiere_of_roofman_at_the/",
        "self_text": "",
        "title": "Kirsten Dunst at the premiere of ‘Roofman’ at the 50 Toronto International Film Festival (September 5, 2025)",
        "search_query": "roofman"
    },
    {
        "create_date": 1761665588.0,
        "id": "1oickpe",
        "subreddit": "oscarrace",
        "link": "https://www.reddit.com/r/oscarrace/comments/1oickpe/its_a_bummer_to_me_that_theres_no_awards_buzz_for/",
        "self_text": "I really enjoyed this film, the whole cast does an awesome job. I’ve always really liked Channing Tatum, and this is probably some of his best work. A character that’s very likable and sympathetic, with a lot of vulnerability and guilt. It really makes you want to root for him because the performance is just so damn charming. The scene of him calling his family and being unable to speak in particular was super sad",
        "title": "It’s a bummer to me that there’s no awards buzz for Roofman, because I thought Channing Tatum and Kirsten Dunst were amazing",
        "search_query": "roofman"
    },
    {
        "create_date": 1760372138.0,
        "id": "1o5o5yt",
        "subreddit": "blankies",
        "link": "https://www.reddit.com/r/blankies/comments/1o5o5yt/can_we_talk_about_the_truly_insane_billing_in/",
        "self_text": "Feel the need to post this here as I've been thinking about it non-stop since I saw the movie yesterday. The credits begin and it goes...\n\nChanning Tatum (obviously), Kirsten Dunst (of course)...\n\nNow, I'm assuming third-billed will either be LaKeith Stanfield who is obviously the most famous person in this movie besides the Dink (who I know has to be the \"And\" and is indeed the \"And\") and a pretty important role... or LaKeith has secured the \"With\" credit and it's going to be Juno Temple getting third because of her Ted Lasso credentials and sharing most of her scenes with LaKeith.\n\nThe third-billed actor is Ben Mendelsohn! He's in the movie for maybe five minutes as the pastor at the church Channing and Kirsten go to and has basically no scenes with serious dramatic *or* comedic heft to them. I laughed when he appeared initially in the movie because it's Ben Mendelsohn with long hair but that's the entirety of his role.\n\nBut you know what, okay, because LaKeith probably secured the \"with\" and Mendelsohn is a blockbuster villain actor and presumably decent buddies with Cianfrance after The Place Beyond the Pines - wait what? LaKeith got fourth billing after Mendelsohn who has *no* plot importance in the movie and no real role in the movie at all???\n\nLaKeith should've either got third billing or the \"with\" for Roofman and the fact that he didn't and lost it to a cameo-sized role for Ben Mendelsohn means he should fire his agent. I'm sorry if this is too dramatic but this was insane billing.",
        "title": "Can we talk about the truly insane billing in Roofman?",
        "search_query": "roofman"
    },
    {
        "create_date": 1759434022.0,
        "id": "1nwdptz",
        "subreddit": "KaraDelToro",
        "link": "https://www.reddit.com/r/KaraDelToro/comments/1nwdptz/kara_attends_the_roofman_los_angeles_premiere_at/",
        "self_text": "",
        "title": "Kara attends the \"Roofman\" Los Angeles Premiere at Paramount Pictures Studios in Los Angeles - September 2025",
        "search_query": "roofman"
    },
    {
        "create_date": 1760114340.0,
        "id": "1o35yp6",
        "subreddit": "Cinemark",
        "link": "https://www.reddit.com/r/Cinemark/comments/1o35yp6/should_i_go_watch_roofman_or_one_battle_after/",
        "self_text": "What do you think is worth the ticket price",
        "title": "Should I go watch Roofman or One Battle After Another this weekend?",
        "search_query": "roofman"
    },
    {
        "create_date": 1759637360.0,
        "id": "1nyef2a",
        "subreddit": "popculturechat",
        "link": "https://www.reddit.com/r/popculturechat/comments/1nyef2a/channing_tatum_reacting_to_fans_referencing_the/",
        "self_text": "",
        "title": "Channing Tatum reacting to fans referencing the “My name is Jeff” meme in the comments section for the Roofman trailer",
        "search_query": "roofman"
    },
    {
        "create_date": 1751299285.0,
        "id": "1lobcc7",
        "subreddit": "movies",
        "link": "https://www.reddit.com/r/movies/comments/1lobcc7/official_poster_for_roofman_true_story_of_jeffrey/",
        "self_text": "",
        "title": "Official Poster for 'Roofman' - True story of Jeffrey Manchester (Channing Tatum), a charming armed robber who makes an elaborate escape from prison and takes refuge in a Toys \"R\" Us",
        "search_query": "roofman"
    },
    {
        "create_date": 1760047870.0,
        "id": "1o2jiv1",
        "subreddit": "RegalUnlimited",
        "link": "https://www.reddit.com/r/RegalUnlimited/comments/1o2jiv1/spoiler_review_roofman/",
        "self_text": "I'm sure some of you saw this earlier in the week, what did you think? ",
        "title": "SPOILER Review: Roofman",
        "search_query": "roofman"
    },
    {
        "create_date": 1760886995.0,
        "id": "1oas785",
        "subreddit": "boxoffice",
        "link": "https://www.reddit.com/r/boxoffice/comments/1oas785/paramount_miramaxs_roofman_grossed_an_estimated/",
        "self_text": "",
        "title": "Paramount &amp; Miramax's Roofman grossed an estimated $3.70M this weekend (from 3,370 locations).  Estimated total domestic gross stands at $15.52M.",
        "search_query": "roofman"
    },
    {
        "create_date": 1762178421.0,
        "id": "1onci0p",
        "subreddit": "Superstonk",
        "link": "https://www.reddit.com/r/Superstonk/comments/1onci0p/gme_related_easter_eggs_found_in_the_new_film/",
        "self_text": "The movie follows a true story of an escaped convict that hides out inside a Toys 'R' Us. If you're aware of Toys 'R' Us' fate, you'd know the same death spiral plan that ended them was also in motion for Gamestop prior to Ryan taking over the board.\n\n*Moving on*\n\nDuring the film, in the back office there is a 'Hang in there' poster on the wall that gets shown several times throughout the film, probably nothing.\n\nPutting that aside, the main one that piqued my interest is later on in the film when the main character is obtaining a fake passport, the name given to him was **Kenneth Griffin.**\n\nCould it be a coincidence? Quite likely, but that mostly depends whether you believe in coincidences. Personally, a Kenny G name drop in a movie that takes place inside a Toys 'R' Us is enough to make me grab my tinfoil hat.\n\nIf anyone else sees the movie, look out for any I may have missed, I'm willing to bet there's more.",
        "title": "GME related easter eggs found in the new film Roofman (2025)",
        "search_query": "roofman"
    },
    {
        "create_date": 1761075078.0,
        "id": "1ocmj90",
        "subreddit": "KirstenDunst",
        "link": "https://www.reddit.com/r/KirstenDunst/comments/1ocmj90/kirsten_interviewed_for_roofman_at_siriusxm/",
        "self_text": "",
        "title": "Kirsten interviewed for ROOFMAN at SiriusXM Studios on October 06, 2025",
        "search_query": "roofman"
    },
    {
        "create_date": 1761705335.0,
        "id": "1oit4eh",
        "subreddit": "shittymoviedetails",
        "link": "https://www.reddit.com/r/shittymoviedetails/comments/1oit4eh/in_weapons_2025_justine_stalks_and_follows_a_3rd/",
        "self_text": "",
        "title": "In Weapons (2025) Justine stalks and follows a 3rd grade kid home and after repeated warnings from her superiors to stop her harassment she receives... No negative repercussions. This is because this movie is based in reality.",
        "search_query": "roofman"
    },
    {
        "create_date": 1760523144.0,
        "id": "1o7720x",
        "subreddit": "dunstkirsten",
        "link": "https://www.reddit.com/r/dunstkirsten/comments/1o7720x/kirsten_dunst_in_valentino_fall_2025_rtw_at_the/",
        "self_text": "",
        "title": "Kirsten Dunst in Valentino fall 2025 RTW at the premiere of \"Roofman\" at the 69th BFI London Film Festival (October 14, 2025)",
        "search_query": "roofman"
    },
    {
        "create_date": 1760117528.0,
        "id": "1o37ej9",
        "subreddit": "boxoffice",
        "link": "https://www.reddit.com/r/boxoffice/comments/1o37ej9/roofman_is_certified_fresh_currently_at_83_on_the/",
        "self_text": "",
        "title": "'Roofman' is Certified Fresh, currently at 83% on the Tomatometer, with 92 reviews.",
        "search_query": "roofman"
    },
    {
        "create_date": 1760321703.0,
        "id": "1o57j6v",
        "subreddit": "oscarrace",
        "link": "https://www.reddit.com/r/oscarrace/comments/1o57j6v/official_discussion_thread_roofman_spoilers/",
        "self_text": "Keep all discussion related solely to Roofman and its awards chances in this thread. Spoilers below.\n\n**Synopsis**\n\nA former Army Ranger and struggling father turns to robbing McDonald's restaurants by cutting holes in their roofs, earning him hte nickname 'Roofman'. After escaping prison, he secretly lives inside a Toys \"R\" Us for six months, surviving undetected while planning his next move. \n\n**Director:** Derek Cianfrance\n\n**Writer:** Derek Cianfrance, Kirt Gunn\n\n**Cast:**\n\n* Channing Tatum as Jeffrey Manchester\n* Kirsten Dunst as Leigh Wainscott\n* Ben Mendelsohn as Ron Smith\n* Peter Dinklage as Mitch\n* Uzo Aduba as Eileen\n* Juno Temple as Michelle\n* Emory Cohen as Otis, a Toys \"R\" Us employee\n* LaKeith Stanfield as Steve\n* Melonie Diaz as Talana\n* Molly Price as Officer Scheimreif\n* Lily Collias as Lindsay Wainscott\n* Tony Revolori as Duane\n* Jimmy O. Yang as a used-car salesman\n\n**Rotten Tomatoes:** [85%, 115 Reviews](https://www.rottentomatoes.com/m/roofman)\n\n**Metacritic:** [64, 29 Reviews](https://www.metacritic.com/movie/roofman/)\n\n**Consensus:** A disarmingly sweet tonal gearshift for director Derek Cianfrance, *Roofman* is shaggy as a narrative but expertly tailored to Channing Tatum's strengths as an eminently likable leading man.",
        "title": "Official Discussion Thread - Roofman [SPOILERS]",
        "search_query": "roofman"
    },
    {
        "create_date": 1760152115.0,
        "id": "1o3kvmb",
        "subreddit": "boxoffice",
        "link": "https://www.reddit.com/r/boxoffice/comments/1o3kvmb/roofman_gets_a_b_cinemascore/",
        "self_text": "",
        "title": "'Roofman' gets a B+ Cinemascore",
        "search_query": "roofman"
    },
    {
        "create_date": 1757516695.0,
        "id": "1ndgp0x",
        "subreddit": "boxoffice",
        "link": "https://www.reddit.com/r/boxoffice/comments/1ndgp0x/rboxoffice_long_range_forecast_tron_ares_roofman/",
        "self_text": "Before you comment, read these two rules:\n\n#**1. Please provide specific numbers for your predictions. Don't do like \"It'll make less than this or that\" or \"double this movie or half this movie\". We want a real prediction.**\n\n#**2. Given that a lot of parent comments do not even bother to give predictions, we are establishing a new rule. The parent comment must provide a prediction with specific numbers. The rest of the replies to the comment do not have to make a prediction, but the parent comment absolutely has to. Any parent comment without a prediction will be eliminated.**\n\nWelcome to the newest edition of r/BoxOffice Long Range Forecast.\n\nWe're making long range predictions for films, 4 weeks out from their premieres. You will predict the opening weekend, domestic total and worldwide gross of these films. These predictions will be open for 48 hours and the results will be polled to form a consensus and posted the next week.\n\nSo let's meet the three films for the week and analyze each pro and con.\n\n#**Tron: Ares**\n\nThe film is directed by Joachim Rønning (*Kon Tiki*, *Pirates of the Caribbean: Dead Men Tell No Tales*, *Maleficent: Mistress of Evil*, *Young Woman and the Sea*) from a screenplay by Jesse Wigutow, based on a story by David Digilio and Wigutow. It is the third installment in the *Tron* series, and stars Jared Leto (who also produces), Greta Lee, Evan Peters, Jodie Turner-Smith, Hasan Minhaj, Arturo Castro, Cameron Monaghan, Gillian Anderson, and Jeff Bridges. It follows a highly sophisticated program, Ares, who is sent from the digital world into the real world on a dangerous mission, marking humankind's first encounter with A.I. beings.\n\n#**Roofman**\n\nThe film is directed by Derek Cianfrance (*Blue Valentine*, *The Place Beyond the Pines* and *The Light Between Oceans*), from a screenplay by Cianfrance and Kirt Gunn. The film stars Channing Tatum, Kirsten Dunst, Ben Mendelsohn, LaKeith Stanfield, Juno Temple, Melonie Diaz, Uzo Aduba, Lily Collias, Jimmy O. Yang, and Peter Dinklage. The film is a biopic of the fugitive Jeffrey Manchester, a former United States Army Reserve officer, known colloquially as Roofman due to his propensity to steal from branches of McDonald's after entering their premises via the roof. Most notably, he evaded capture by police by hiding in the wall of a Toys \"R\" Us store.\n\n#**After the Hunt**\n\nThe film is directed by Luca Guadagnino (*A Bigger Splash*, *Call Me By Your Name*, *Suspiria*, *Challengers*, *Queer*, etc.) and written by Nora Garrett. Starring Julia Roberts, Ayo Edebiri, Andrew Garfield, Michael Stuhlbarg and Chloë Sevigny, it follows Alma, a college professor caught in between a sexual abuse accusation involving one of her students and a colleague.\n\nNow that you've met this week's new releases, let's look at some pros and cons.\n\n#**PROS**\n\n- The *Tron* franchise has grown a massive cult following in subsequent years. *Tron: Legacy* still made $400 million worldwide, indicating that audiences were very interested in the world of these films. And its popularity has grown through home media and streaming. The trailers emphasize that it's the same old *Tron*, just that it made its way to the real world. So far, all trailers have been visually stunning. It also stars a cast ensemble of known actors, or actors who are on their way up. While Daft Punk is not back for the score, Nine Inch Nails is a pretty well respected and highly regarded successor. But most importantly: its biggest advantage is that it's the sole high-budget blockbuster of October, now that *Mortal Kombat II* was moved to May 2026.\n\n- Channing Tatum is one of the most popular male stars. *Dog* got to $85 million solely on his own, and his team-up film with Sandra Bullock in *The Lost City* made its way to $190 million. Not to mention a lot of pre-pandemic hits. So *Roofman* is highly dependent on how much audience cares for his presence. The good news: audiences have responded very well to Tatum when he stars on comedies, and *Roofman* is pretty much that. Derek Cianfrance may not be a well known name for audiences, but his presence usually guarantees good quality. And judging by the TIFF's reviews, it's looking promising; it's sitting at a 88% on RT.\n\n- Luca Gudagnino is a well known name in cinephile circles, and his second-to-last film, *Challengers*, was his biggest film with around $96 million. For a drama, the star is important and while Andrew Garfield and Ayo Edebiri have their fans, the real huge star is Julia Roberts; *Ticket to Paradise* made $168 million worldwide (quite great for a rom-com nowadays), and *Leave the World Behind* became the fifth biggest English title on Netflix's history. This should definitely intrigue thriller fans.\n\n#**CONS**\n\n- So *Tron* has grown in popularity... but how much? Mainly asking, because at the end of the day, the previous two *Tron* films were considered box office disappointments. Even though *Legacy* has grown in audience, *Ares* goes of its way to not reference it much; neither director Joseph Kosinski or stars Garrett Hedlund, Olivia Wilde and Cillian Murphy (whose cameo was intended for a villain role in a sequel) are back. Even Jeff Bridges' presence is very limited in the trailers, in contrast to his big role in *Legacy*. 15 years is also quite long to release a follow-up. And yes, the actors are well known... but the one weak spot is its own very own star, Jared Leto. Once respected, his credibility has fallen off in recent years thanks to a lot of critical and financial duds. Not to mention, [sexual misconduct accusations.](https://www.theguardian.com/film/2025/jun/07/jared-leto-accused-sexual-impropriety)\n\n- While Channing Tatum is a very well known name, his luck in theaters hasn't exactly paid off recently. *Magic Mike's Last Dance* was the lowest in the franchise by a wide margin, *Fly Me to the Moon* was a huge box office disaster, and *Blink Twice* didn't even crack $50 million worldwide. Cianfrance is a respected filmmaker, but his highest grossing film (*Pines*) made only $47 million, which isn't a lot of money. It's also gonna have some comedy competition the following week when *Good Fortune* opens.\n\n- Guadagnino is very popular in cinephile circles, but when it comes to the box office, the results don't really reflect that. *Challengers* made $96 million, but it still lost money due to its budget. The rest of his films haven't fared well; his follow-up to *Challengers*, *Queer*, flopped with just $7 million. In fact, outside *Challengers* and *Call Me By Your Name*, his films usually end with less than $20 million worldwide. Roberts is definitely a huge name, and there should be interest in seeing her in another psychological thriller. But a film like this (where the theme is #MeToo) needs great reviews to stand a chance, and it seems like it was a rare Guadagnino misfire; it's currently sitting at a very weak 51% on RT. That not only could dilute interest, but it could be a sign that word of mouth won't be on its favor.\n\nAnd here's the past results.\n\nMovie | Release Date | Distributor | Domestic Debut | Domestic Total | Worldwide Total\n:-------:|:--------:|:--------:|:--------:|:--------:|:--------:|\n*Demon Slayer: Kimetsu no Yaiba – The Movie: Infinity Castle* | September 12 | Crunchyroll | $45,364,285 | $90,121,428 | $595,039,285\n*Downton Abbey: The Grand Finale* | September 12 | Focus Features | $15,863,636 | $40,950,000 | $89,655,000\n*The Long Walk* | September 12 | Lionsgate | $10,750,000 | $27,720,000 | $52,636,363\n*Spinal Tap II: The End Continues* | September 12 | Bleecker Street | $3,355,555 | $7,372,222 | $9,444,444\n*Him* | September 19 | Universal | $24,550,000 | $73,664,285 | $109,410,714\n*A Big Bold Beautiful Journey* | September 19 | Sony | $11,160,714 | $33,171,428 | $68,471,428\n*One Battle After Another* | September 26 | Warner Bros. | $30,078,947 | $99,500,000 | $218,015,789\n*Gabby's Dollhouse: The Movie* | September 26 | Universal | $19,227,272 | $57,154,545 | $152,354,545\n*The Strangers – Chapter 1* | September 26 | Lionsgate | $9,558,333 | $25,925,000 | $57,583,333\n*The Smashing Machine* | October 3 | A24 | $20,085,294 | $59,523,529 | $113,617,647\n*Anemone* | October 3 | Focus Features | $4,725,000 | $13,416,666 | $33,316,666\n*Shelby Oaks* | October 24 | Neon | $4,240,000 | $9,791,666 | $14,945,454\n\n**NOTE:** We predicted *Shelby Oaks* last week, because it was set for October 3. But then, just a few days ago, Neon decided to move it (again) to October 24. We're not predicting it again, so we'll just move it.\n\nNext week, we're predicting *Black Phone 2* and *Good Fortune*.\n\nSo what are your predictions for these films?",
        "title": "r/BoxOffice Long Range Forecast: 'Tron: Ares', 'Roofman', and 'After the Hunt'",
        "search_query": "roofman"
    },
    {
        "create_date": 1760190775.0,
        "id": "1o3w7co",
        "subreddit": "Letterboxd",
        "link": "https://www.reddit.com/r/Letterboxd/comments/1o3w7co/how_it_feels_to_see_roofman_on_tron_ares_release/",
        "self_text": "",
        "title": "How it feels to see Roofman on Tron: Ares release day",
        "search_query": "roofman"
    },
    {
        "create_date": 1760100486.0,
        "id": "1o2zyiv",
        "subreddit": "Oscars",
        "link": "https://www.reddit.com/r/Oscars/comments/1o2zyiv/oscars_2026_is_timothée_chalamet_the_new_best/",
        "self_text": "",
        "title": "Oscars 2026: Is Timothée Chalamet the New Best Actor Frontrunner? Plus, Kate Hudson, Safdie v. Safdie, ‘Roofman,’ &amp; More",
        "search_query": "roofman"
    },
    {
        "create_date": 1760204165.0,
        "id": "1o41nsr",
        "subreddit": "boxoffice",
        "link": "https://www.reddit.com/r/boxoffice/comments/1o41nsr/demographic_breakdown_of_tron_ares_and_roofman/",
        "self_text": "",
        "title": "Demographic breakdown of Tron: Ares and Roofman",
        "search_query": "roofman"
    },
    {
        "create_date": 1757232673.0,
        "id": "1nannfj",
        "subreddit": "KirstenDunst",
        "link": "https://www.reddit.com/r/KirstenDunst/comments/1nannfj/kirsten_attends_the_roofman_world_premiere_at_the/",
        "self_text": "",
        "title": "Kirsten attends the \"Roofman\" World Premiere at the 2025 Toronto International Film Festival at Roy Thomson Hall in Toronto, Ontario - September 2025",
        "search_query": "roofman"
    },
    {
        "create_date": 1759876400.0,
        "id": "1o0ti3r",
        "subreddit": "AMCScreenUnseen",
        "link": "https://www.reddit.com/r/AMCScreenUnseen/comments/1o0ti3r/roofman_discussion/",
        "self_text": "",
        "title": "Roofman (Discussion)",
        "search_query": "roofman"
    },
    {
        "create_date": 1761186575.0,
        "id": "1odrqcq",
        "subreddit": "RSPfilmclub",
        "link": "https://www.reddit.com/r/RSPfilmclub/comments/1odrqcq/roofman_wasmid/",
        "self_text": "Consider myself a \"fan\" of Cianfrance (Pines was my favorite film in hs, Blue Valentine is great, Light Between Oceans is a step above average period pieces and very affecting) so I was anticipating Roofman highly...but I left feeling like it was your run-of-the-mill average \"based on a true story\" mainstream forgettable  movie...\n\n...his other three were so memorable, even if you found them bad there is so much to get out of them but this was sort of soulless...\n\n...it's been years since his last movie why come back with this? is it a passion project? he just became obsessed and had to tell this story? or was it for the check?(which I find hard to believe because I doubt this type of movie will perform well at the box office)...\n\n...so what do y'all say, have you seen it? did it feel like a large step down in quality from what you expect from Cianfrance? and wtf went wrong? or am I wrong and it's great? idek just flabbergasted at this movie. it wasn't terrible just awfully mid.",
        "title": "Roofman was.....mid?",
        "search_query": "roofman"
    },
    {
        "create_date": 1758680237.0,
        "id": "1np0ej7",
        "subreddit": "Charlotte",
        "link": "https://www.reddit.com/r/Charlotte/comments/1np0ej7/roofman_premiere_to_open_charlotte_film_festival/",
        "self_text": "Awesome night at the newly renovated Carolina theater to watch the new Charlotte shot film based on a true story. Really fun night and lots of great films to be shown at the Independent Picture House the rest of the week!",
        "title": "Roofman premiere to open Charlotte Film Festival",
        "search_query": "roofman"
    },
    {
        "create_date": 1750856599.0,
        "id": "1lk53rk",
        "subreddit": "blankies",
        "link": "https://www.reddit.com/r/blankies/comments/1lk53rk/trailer_for_derek_cianfrances_roofman_starring/",
        "self_text": "",
        "title": "Trailer for Derek Cianfrance's Roofman, starring Channing Tatum and Kirsten Dunst",
        "search_query": "roofman"
    },
    {
        "create_date": 1763077435.0,
        "id": "1owgvxu",
        "subreddit": "Cinema_Egypt",
        "link": "https://www.reddit.com/r/Cinema_Egypt/comments/1owgvxu/roofman_2025_فيلم_كمان_جميل_السنادي/",
        "self_text": "7/10",
        "title": "Roofman 2025 فيلم كمان جميل السنادي",
        "search_query": "roofman"
    },
    {
        "create_date": 1761162427.0,
        "id": "1odigpz",
        "subreddit": "DramaLlamaHQ",
        "link": "https://www.reddit.com/r/DramaLlamaHQ/comments/1odigpz/kirsten_dunst_rejects_any_kind_of_reboot_for/",
        "self_text": "",
        "title": "Kirsten Dunst Rejects Any Kind of Reboot For ‘Bring It On’ Movie",
        "search_query": "roofman"
    },
    {
        "create_date": 1759755874.0,
        "id": "1nzii07",
        "subreddit": "boxoffice",
        "link": "https://www.reddit.com/r/boxoffice/comments/1nzii07/roofman_final_trailer_2025_movie_channing_tatum/",
        "self_text": "",
        "title": "Roofman | Final Trailer (2025 Movie) - Channing Tatum, Kirsten Dunst | only in theaters this Friday",
        "search_query": "roofman"
    },
    {
        "create_date": 1750856582.0,
        "id": "1lk53i7",
        "subreddit": "boxoffice",
        "link": "https://www.reddit.com/r/boxoffice/comments/1lk53i7/roofman_official_trailer_2025_movie_channing/",
        "self_text": "&gt;How far would you go to change who you are? #Roofman​ is coming only to theatres October 10. \n\n&gt;Based on an unbelievable true story, Roofman follows Jeffrey Manchester (Channing Tatum), a former Army Ranger and struggling father who turns to robbing McDonald’s restaurants by cutting holes in their roofs, earning him the nickname: Roofman. After escaping prison, he secretly lives inside a Toys “R” Us for six months, surviving undetected while planning his next move. But when he falls for Leigh (Kirsten Dunst), a divorced mom drawn to his undeniable charm, his double life begins to unravel, setting off a compelling and suspenseful game of cat and mouse as his past closes in.",
        "title": "Roofman | Official Trailer (2025 Movie) - Channing Tatum, Kirsten Dunst",
        "search_query": "roofman"
    },
    {
        "create_date": 1727730238.0,
        "id": "1ft6krs",
        "subreddit": "movies",
        "link": "https://www.reddit.com/r/movies/comments/1ft6krs/kirsten_dunst_joins_channing_tatum_in_true_crime/",
        "self_text": "",
        "title": "Kirsten Dunst Joins Channing Tatum In True Crime Movie ‘Roofman’ From Director Derek Cianfrance",
        "search_query": "roofman"
    },
    {
        "create_date": 1762837409.0,
        "id": "1ou0sio",
        "subreddit": "movieleaks",
        "link": "https://www.reddit.com/r/movieleaks/comments/1ou0sio/roofman_2025/",
        "self_text": "https://www.imdb.com/title/tt4627382",
        "title": "Roofman (2025)",
        "search_query": "roofman"
    },
    {
        "create_date": 1761692088.0,
        "id": "1oio75s",
        "subreddit": "MovieSuggestions",
        "link": "https://www.reddit.com/r/MovieSuggestions/comments/1oio75s/anything_that_feels_like_roofman_2025_meets_the/",
        "self_text": "I love the humor and heartfelt romance and family drama combined w/ the crime drama in Roofman, and the erotic horror, sexuality, pro-feminist themes, and brilliant originality in The Substance.\n\nAnything that combines all of the above? Weirdly One Battle After Another kinda hits all of those points for me but that’s a once-in-a-lifetime top-10 all-time masterpiece of a film, hard to find much like it.",
        "title": "Anything that feels like Roofman (2025) meets The Substance (2024)?",
        "search_query": "roofman"
    },
    {
        "create_date": 1759978928.0,
        "id": "1o1v5oj",
        "subreddit": "boxoffice",
        "link": "https://www.reddit.com/r/boxoffice/comments/1o1v5oj/box_office_pro_weekend_preview_disney_to_score_a/",
        "self_text": "",
        "title": "Box Office Pro Weekend Preview: Disney to Score a Win With TRON: ARES [Weekend Range: $40M – $48M], Roofman [Opening Weekend Range: $7M – $10M], One Battle After Another [$5M – $6M]",
        "search_query": "roofman"
    },
    {
        "create_date": 1762377747.0,
        "id": "1opfo82",
        "subreddit": "TedLasso",
        "link": "https://www.reddit.com/r/TedLasso/comments/1opfo82/juno_temple_roofman/",
        "self_text": "Has anyone seen the new movie Roofman yet? Was so excited to see Juno Temple in it, my husband and I got a kick out of her fake southern accent - that British accent was trying so hard to come out! 😝\n\nSPOILER: You see her nipple in the movie 🫣🤣",
        "title": "Juno Temple &amp; Roofman",
        "search_query": "roofman"
    },
    {
        "create_date": 1742670240.0,
        "id": "1jhfxsi",
        "subreddit": "Fauxmoi",
        "link": "https://www.reddit.com/r/Fauxmoi/comments/1jhfxsi/channing_tatum_says_hell_no_longer_be/",
        "self_text": "&gt;We back up! lol. 1st photo is today 205. 2nd photo 235 for a movie called Josephine. Then went to 3rd photo which is 172 for a movie Roofman. I’m so grateful for my genetics. Grateful for my chef/nutritionist/witch. Grateful for my trainer. I couldn’t make these big swings in my weight without you guys. But i won’t be doing anymore fat roles haha. It’s to hard on the body and to hard to take off now. But damn when i look at these pics it’s just wild what the human body and will can do.",
        "title": "Channing Tatum says he'll no longer be gaining/losing weight for roles",
        "search_query": "roofman"
    },
    {
        "create_date": 1762209015.0,
        "id": "1onq8bh",
        "subreddit": "Letterboxd",
        "link": "https://www.reddit.com/r/Letterboxd/comments/1onq8bh/i_need_to_know_what_i_should_go_see_should_i/",
        "self_text": "Or Atfter the hunt",
        "title": "I need to know what I should go see should I watch Shelby Oaks, Roofman, or Springsteen",
        "search_query": "roofman"
    },
    {
        "create_date": 1760157401.0,
        "id": "1o3mh3j",
        "subreddit": "AMCAListTrue",
        "link": "https://www.reddit.com/r/AMCAListTrue/comments/1o3mh3j/roofman_no_spoilers/",
        "self_text": "This was entertaining and good-- kind of what I expected. Peter Dinkage plays a great jerk-manager, mean boss. The plot moves, there's an element of suspense... because you kind of know how it's going to end. \n\nStay through all the credits, because they show archival footage and new snippets about the real roofman",
        "title": "Roofman (no spoilers)",
        "search_query": "roofman"
    },
    {
        "create_date": 1762099010.0,
        "id": "1omkxla",
        "subreddit": "boxoffice",
        "link": "https://www.reddit.com/r/boxoffice/comments/1omkxla/paramount_miramaxs_roofman_grossed_an_estimated/",
        "self_text": "",
        "title": "Paramount &amp; Miramax's Roofman grossed an estimated $1.00M this weekend (from 1,490 locations).  Estimated total domestic gross stands at $21.30M.",
        "search_query": "roofman"
    },
    {
        "create_date": 1759292312.0,
        "id": "1nuyn98",
        "subreddit": "popculturechat",
        "link": "https://www.reddit.com/r/popculturechat/comments/1nuyn98/kirsten_dunst_and_bryce_dallas_howard_maryjane/",
        "self_text": "",
        "title": "Kirsten Dunst and Bryce Dallas Howard (Mary-Jane Watson and Gwen Stacy in the Sam Raimi Spider-Man movies) at a 'Roofman' special screening (September 25, 2025)",
        "search_query": "roofman"
    },
    {
        "create_date": 1760172148.0,
        "id": "1o3qifn",
        "subreddit": "KirstenDunst",
        "link": "https://www.reddit.com/r/KirstenDunst/comments/1o3qifn/roofman_interview_oct_2025/",
        "self_text": "",
        "title": "Roofman Interview, Oct 2025",
        "search_query": "roofman"
    },
    {
        "create_date": 1761435808.0,
        "id": "1og64wo",
        "subreddit": "RegalUnlimited",
        "link": "https://www.reddit.com/r/RegalUnlimited/comments/1og64wo/hot_on_the_heels_of_my_first_triplefeature_good/",
        "self_text": "",
        "title": "Hot on the heels of my first triple-feature (Good Fortune, After the Hunt, Roofman), a new milestone....",
        "search_query": "roofman"
    },
    {
        "create_date": 1759788421.0,
        "id": "1nzx0jn",
        "subreddit": "AMCScreenUnseen",
        "link": "https://www.reddit.com/r/AMCScreenUnseen/comments/1nzx0jn/tonights_screen_unseen_is_either_kiss_of_the/",
        "self_text": "",
        "title": "Tonight’s Screen Unseen is either Kiss of the Spider Woman or Roofman (please please please be Roofman!) based on rating and runtime",
        "search_query": "roofman"
    },
    {
        "create_date": 1759244095.0,
        "id": "1nufdtn",
        "subreddit": "dunstkirsten",
        "link": "https://www.reddit.com/r/dunstkirsten/comments/1nufdtn/kirsten_dunst_in_valentino_re26_sophie_bille/",
        "self_text": "",
        "title": "Kirsten Dunst in Valentino RE26, Sophie Bille Brahe jewelry at Los Angeles \"Roofman\" premiere",
        "search_query": "roofman"
    },
    {
        "create_date": 1760052018.0,
        "id": "1o2l3ia",
        "subreddit": "AMCTheatres",
        "link": "https://www.reddit.com/r/AMCTheatres/comments/1o2l3ia/roofman_no_trailers/",
        "self_text": "Saw Roofman today and there were no trailers except for the typical AMC ads. It started about 10 minutes after the posted showtime. Good thing I was on time. Did this happen to anyone else? Is this something new, a mistake, or specific to this movie?",
        "title": "Roofman No Trailers?",
        "search_query": "roofman"
    },
    {
        "create_date": 1757470209.0,
        "id": "1nd22ae",
        "subreddit": "boxoffice",
        "link": "https://www.reddit.com/r/boxoffice/comments/1nd22ae/mpa_ratings_update_arco_rated_pg_bugonia_rated_r/",
        "self_text": "",
        "title": "MPA Ratings Update: Arco Rated PG, Bugonia Rated R, The Carpenter's Son Rated R, Five Nights At Freddy's 2 Rated PG-13, Keeper Rated R, Roofman Rated R, Wake Up Dead Man Rated PG-13 and Wicked: For Good Rated PG",
        "search_query": "roofman"
    },
    {
        "create_date": 1761126461.0,
        "id": "1od3w38",
        "subreddit": "cineplex",
        "link": "https://www.reddit.com/r/cineplex/comments/1od3w38/anyone_else_think_its_funnyodd_that_roofman_is/",
        "self_text": "",
        "title": "Anyone else think it’s funny/odd that Roofman is rated PG despite there being nudity in it",
        "search_query": "roofman"
    },
    {
        "create_date": 1760798692.0,
        "id": "1o9xoyf",
        "subreddit": "boxoffice",
        "link": "https://www.reddit.com/r/boxoffice/comments/1o9xoyf/paramount_miramaxs_roofman_grossed_an_estimated/",
        "self_text": "",
        "title": "Paramount &amp; Miramax's Roofman grossed an estimated $1.10M on Friday (from 3,370 locations).  Estimated total domestic gross stands at $12.92M.",
        "search_query": "roofman"
    },
    {
        "create_date": 1759801855.0,
        "id": "1o021ki",
        "subreddit": "AMCScreenUnseen",
        "link": "https://www.reddit.com/r/AMCScreenUnseen/comments/1o021ki/roofman/",
        "self_text": "",
        "title": "Roofman",
        "search_query": "roofman"
    },
    {
        "create_date": 1760389220.0,
        "id": "1o5w3je",
        "subreddit": "boxoffice",
        "link": "https://www.reddit.com/r/boxoffice/comments/1o5w3je/paramount_miramaxs_roofman_debuted_with_811m/",
        "self_text": "",
        "title": "Paramount &amp; Miramax's Roofman debuted with $8.11M domestically this weekend (from 3,362 locations). Daily Grosses FRI - $3.240M SAT - $2.828M SUN - $2.041M",
        "search_query": "roofman"
    },
    {
        "create_date": 1760152435.0,
        "id": "1o3kz5p",
        "subreddit": "boxoffice",
        "link": "https://www.reddit.com/r/boxoffice/comments/1o3kz5p/roofman_rotten_tomatoes_verified_audience_score/",
        "self_text": "I will continue to update this post as the score changes.\n\n**Rotten Tomatoes Popcornmeter:** Hot\n\n**Audience Says:** An unbelievable true story that had to be told on film, *Roofman* features surprisingly funny, heartfelt performances that make it impossible not to root for its winsome conman hero.[](https://www.rottentomatoes.com/m/roofman/reviews?type=user)\n\n|Audience|Score|**Number of Reviews**|**Average Rating**|\n|:-|:-|:-|:-|\n|**Verified Audience**|84%|250+|4.1/5|\n|**All Audience**|82%|500+|4.1/5|\n\n**Verified Audience Score History:**\n\n* 87% (4.2/5) at 100+\n* 84% (4.1/5) at 250+\n\n[**Rotten Tomatoes:**](https://www.rottentomatoes.com/m/roofman) Certified Fresh\n\n**Critics Consensus:** A disarmingly sweet tonal gearshift for director Derek Cianfrance, *Roofman* is shaggy as a narrative but expertly tailored to Channing Tatum's strengths as an eminently likable leading man.\n\n|Critics|Score|**Number of Reviews**|Average Rating (Unofficial)|\n|:-|:-|:-|:-|\n|**All Critics**|85%|115|7.10/10|\n|**Top Critics**|70%|23|6.40/10|\n\n[**Metacritic:**](https://www.metacritic.com/movie/roofman/) 64 (29 Reviews)\n\n**SYNOPSIS:**\n\nBased on an unbelievable true story, Roofman follows Jeffrey Manchester (Channing Tatum), a former Army Ranger and struggling father who turns to robbing McDonald’s restaurants by cutting holes in their roofs, earning him the nickname: Roofman. After escaping prison, he secretly lives inside a Toys “R” Us for six months, surviving undetected while planning his next move. But when he falls for Leigh (Kirsten Dunst), a divorced mom drawn to his undeniable charm, his double life begins to unravel, setting off a compelling and suspenseful game of cat and mouse as his past closes in.\n\n**CAST:**\n\n* Channing Tatum as Jeffrey Manchester\n* Kirsten Dunst as Leigh Wainscott\n* Ben Mendelsohn as Ron Smith\n* LaKeith Stanfield as Steve\n* Juno Temple as Michelle\n* Melonie Diaz as Molly Price\n* Uzo Aduba as Eileen\n* Lily Collins as as Lindsay Wainscott\n* Jimmy O. Yang as Used-Car Salesman\n* Peter Dinklage as Mitch\n\n**DIRECTED BY:** Derek Cianfrance\n\n**SCREENPLAY BY:** Derek Cianfrance, Kirt Gunn\n\n**PRODUCED BY:** Jamie Patricof, Lynette Howell Taylor, Alex Orlovsky, Duncan Montgomery, Dylan Sellers\n\n**EXECUTIVE PRODUCERS:** Charles M. Barsamian, Derek Cianfrance, Rick Covert, Jonathan Glickman, Kirt Gunn, Cedar Miller, Jonathan Montepare, Chris Parker, Jeff Portnoy, Sam Romano, Jack Selby, Becky Sloviter, Channing Tatum, Randy Jones Toll, Steven J. Toll, D. Mark von Waaden, Matthew von Waaden, Tyler Zacharia, Thom Zadra\n\n**DIRECTOR OF PHOTOGRAPHY:** Andrij Parekh\n\n**PRODUCTION DESIGNER:** Inbal Weinberg\n\n**EDITED BY:** Jim Helton, Ron Patane\n\n**COSTUME DESIGNER:** Erin Benach\n\n**MUSIC BY:** Christopher Bear\n\n**CASTING BY:** Bonnie Timmermann\n\n**RUNTIME:** 126 Minutes\n\n**RELEASE DATE:** October 10, 2025",
        "title": "'Roofman' Rotten Tomatoes Verified Audience Score Thread",
        "search_query": "roofman"
    },
    {
        "create_date": 1761411263.0,
        "id": "1ofwi3s",
        "subreddit": "Letterboxd",
        "link": "https://www.reddit.com/r/Letterboxd/comments/1ofwi3s/i_wouldnt_have_believed_you_if_you_said_roofman/",
        "self_text": "Apparently the Bruce Springsteen movie is really good \n\nI’ll probably go see Good Fortune on Monday ",
        "title": "I wouldn’t have believed you if you said Roofman was going to the best movie of October",
        "search_query": "roofman"
    },
    {
        "create_date": 1760194672.0,
        "id": "1o3xqk5",
        "subreddit": "boxoffice",
        "link": "https://www.reddit.com/r/boxoffice/comments/1o3xqk5/paramount_miramaxs_roofman_grossed_an_estimated/",
        "self_text": "",
        "title": "Paramount &amp; Miramax's Roofman grossed an estimated $3.25M domestically on Friday (from 3,362 locations), including previews.\n\n#Roofman  #BoxOffice",
        "search_query": "roofman"
    },
    {
        "create_date": 1708748931.0,
        "id": "1aylknm",
        "subreddit": "chaoticgood",
        "link": "https://www.reddit.com/r/chaoticgood/comments/1aylknm/fucking_roofman_a_robber_and_fugitive_who_gave/",
        "self_text": "",
        "title": "Fucking ‘Roofman', a robber and fugitive who gave stolen toys to kids, had a secret lair at a Toys R Us. At night at Toys R Us he rode bikes, raced remote-control cars on the roof, ate baby food, and changed employees' work schedules. He told his girlfriend and others he had a secret government job.",
        "search_query": "roofman"
    },
    {
        "create_date": 1760914256.0,
        "id": "1ob3nap",
        "subreddit": "GrizzlyBear",
        "link": "https://www.reddit.com/r/GrizzlyBear/comments/1ob3nap/cant_find_soundtrackscore_for_roofman_composed_by/",
        "self_text": "I want to listen to it! Help!!",
        "title": "Can’t find Soundtrack/Score for ‘Roofman’ composed by Chris Bear anywhere",
        "search_query": "roofman"
    },
    {
        "create_date": 1750859294.0,
        "id": "1lk65pp",
        "subreddit": "oscarrace",
        "link": "https://www.reddit.com/r/oscarrace/comments/1lk65pp/roofman_official_trailer/",
        "self_text": "",
        "title": "Roofman | Official Trailer",
        "search_query": "roofman"
    },
    {
        "create_date": 1759433604.0,
        "id": "1nwdj69",
        "subreddit": "boxoffice",
        "link": "https://www.reddit.com/r/boxoffice/comments/1nwdj69/next_weekends_estimated_location_count_for/",
        "self_text": "",
        "title": "Next weekend's estimated location count for Paramount's Roofman is 3,100 locations.",
        "search_query": "roofman"
    },
    {
        "create_date": 1760031799.0,
        "id": "1o2clp1",
        "subreddit": "boxoffice",
        "link": "https://www.reddit.com/r/boxoffice/comments/1o2clp1/this_weekends_location_count_for_paramount/",
        "self_text": "",
        "title": "This weekend's location count for Paramount &amp; Miramax's Roofman is 3,362 locations.",
        "search_query": "roofman"
    },
    {
        "create_date": 1760242296.0,
        "id": "1o4fke6",
        "subreddit": "movies",
        "link": "https://www.reddit.com/r/movies/comments/1o4fke6/2025s_film_thats_been_most_overlooked/",
        "self_text": "I'm talking more specifically about which movie that had some bigger names and was actually good but had very little buzz and wasn't very popular at all?\n\nFor my personal pick I have to go with The Assessment. Alicia Vikander and Elizabeth Olsen star and the movie barely made a peep and lasted in theaters for about a week.",
        "title": "2025's film that's been most overlooked?",
        "search_query": "roofman"
    },
    {
        "create_date": 1761073446.0,
        "id": "1oclt1a",
        "subreddit": "boxoffice",
        "link": "https://www.reddit.com/r/boxoffice/comments/1oclt1a/paramount_miramaxs_roofman_grossed_381k_on_monday/",
        "self_text": "",
        "title": "Paramount &amp; Miramax's Roofman grossed $381K on Monday (from 3,370 locations).  Total domestic gross stands at $15.93M.",
        "search_query": "roofman"
    },
    {
        "create_date": 1763302471.0,
        "id": "1oymrsm",
        "subreddit": "4kbluray",
        "link": "https://www.reddit.com/r/4kbluray/comments/1oymrsm/no_roofman_4k_in_uk/",
        "self_text": "There doesn’t seem to be a preorder up for a 4K release of Roofman in the UK. There’s only Blu-ray and DVD preorders up. The US however has the 4K preorder up…but not a Blu-ray preorder, with the Blu-ray instead being bundled with the 4K. I’ve never seen a 4K preorder not be available alongside the Blu-ray and DVD, or vice versa. Will it be up at a later date or are they just not bothering with a 4K release in other countries for this movie? \n\nA tweet from @hdreport on Twitter: “Paramount's #physicalmedia releases of Roofman and The Running Man won't include single-format Blu-rays in US (available only in the 4k combos).”\n\nParamount really seems to be in a downward spiral in terms of physical media releases this year. It sucks to see.",
        "title": "No Roofman 4K in UK?",
        "search_query": "roofman"
    },
    {
        "create_date": 1757093417.0,
        "id": "1n9bj46",
        "subreddit": "boxoffice",
        "link": "https://www.reddit.com/r/boxoffice/comments/1n9bj46/long_range_forecast_october_marches_on_with_the/",
        "self_text": "",
        "title": "Long Range Forecast: October Marches On With THE SMASHING MACHINE, ROOFMAN, TRON: ARES, SOUL ON FIRE",
        "search_query": "roofman"
    },
    {
        "create_date": 1758546933.0,
        "id": "1nnm6mu",
        "subreddit": "RegalUnlimited",
        "link": "https://www.reddit.com/r/RegalUnlimited/comments/1nnm6mu/roofman_1000_credits_922_only/",
        "self_text": "",
        "title": "Roofman - 1,000 Credits - 9/22 Only",
        "search_query": "roofman"
    },
    {
        "create_date": 1757585086.0,
        "id": "1ne4t8h",
        "subreddit": "ToysRus",
        "link": "https://www.reddit.com/r/ToysRus/comments/1ne4t8h/i_worked_at_the_actual_toys_r_us_during_the/",
        "self_text": "",
        "title": "I worked at the actual Toys \"R\" Us during the events of the movie Roofman. Ask me anything",
        "search_query": "roofman"
    },
    {
        "create_date": 1759786984.0,
        "id": "1nzwes1",
        "subreddit": "AlamoDrafthouse",
        "link": "https://www.reddit.com/r/AlamoDrafthouse/comments/1nzwes1/did_the_roofman_qa_with_channing_tatum_take_place/",
        "self_text": "I’d like to attend this but there is no info on where it’s being held or when. This makes me think it happened already, even though the film doesn’t come out till the 10th ?",
        "title": "Did the Roofman Q&amp;A with Channing Tatum take place already?",
        "search_query": "roofman"
    },
    {
        "create_date": 1760422524.0,
        "id": "1o67uje",
        "subreddit": "oscarrace",
        "link": "https://www.reddit.com/r/oscarrace/comments/1o67uje/kirsten_dunst_nailed_it_says_reallife_roofman/",
        "self_text": "",
        "title": "Kirsten Dunst ‘nailed it,’ says real-life ‘Roofman’ subject Leigh Moore: ‘She was phenomenal — and she never even met me’",
        "search_query": "roofman"
    },
    {
        "create_date": 1757217070.0,
        "id": "1naja3q",
        "subreddit": "fashionporn",
        "link": "https://www.reddit.com/r/fashionporn/comments/1naja3q/kirsten_dunst_at_the_tiff_world_premiere_of/",
        "self_text": "",
        "title": "Kirsten Dunst at the #TIFF world premiere of #Roofman. [1440x1798]",
        "search_query": "roofman"
    },
    {
        "create_date": 1760125909.0,
        "id": "1o3b38m",
        "subreddit": "Letterboxd",
        "link": "https://www.reddit.com/r/Letterboxd/comments/1o3b38m/just_saw_roofman/",
        "self_text": "Highly recommend it. It's sincere, thorough and surprisingly accurate. A well-acted journey of discovery that we can all relate to. ",
        "title": "Just saw Roofman...",
        "search_query": "roofman"
    },
    {
        "create_date": 1763910795.0,
        "id": "1p4p30o",
        "subreddit": "whatthefrockk",
        "link": "https://www.reddit.com/r/whatthefrockk/comments/1p4p30o/a_weekly_round_up_look_book_looks_you_might_not/",
        "self_text": "1. **Da’Vine Joy Randolph** at the ‘Eternity’ London Premiere wearing **custom Atelier Ndigo**, styled by The Reismans\n2. **Demi Moore** at the ‘Landman’ Berlin TV Series Premiere wearing **Thom Browne Resort 2026,** styled by Brad Goreski\n3. **Lainey Wilson** hosting the 2025 Country Music Awards wearing **Reem Acra**, styled by Alexandra Mandelkorn\n4. **Skepta** at the 2025 GQ Men of the Year Awards wearing **Mains ‘General Suit’ from A/W 2026 Collection**\n5. **Auliʻi Cravalho** at the ‘Wicked: Fore Good’ Premiere wearing **Mitiliane Couture**, styled by Jessica Paster\n6. **Renate Reinsve** at the 2025 Elle Women in Hollywood event wearing **Louis Vuitton Spring 2026**, styled by Karla Welch\n7. **Denée Benton** at ‘The Gilded Age’ New York TV Series Screening wearing **Moschino**, styled by Amanda Murray\n8. **Amanda Seyfried** at the BFI Southbank ‘In Conversation’ event in London wearing **Thom Browne**, styled by Elizabeth Stewart\n9. **Kirsten Dunst** for the ‘Roofman’ Digital Release Special Event wearing **Shushu / Tong Spring Summer 2025,** styled by Samantha McMillen\n10. **Michelle Obama** for VOGUE’s ‘Life in Looks’ series wearing **Prada Spring 2026,** styled by Meredith Koop\n11. **Jeff Goldblum** at the SAG-AFTRA Career Retrospective wearing **Prada Spring 2015**, styled by Andrew T. Vottero\n12. **Jodie Foster** at the ‘Vie Privee’ Paris Premiere wearing **McQueen Fall 2025**, styled by Samantha McMillen\n13. **Tessa Thompson** at the 2025 American Cinematheque Awards wearing **Proenza Schouler Spring 2026**, styled by Karla Welch\n14. **Dwayne Johnson** at the 2025 Elle Women in Hollywood event wearing **custom Ralph Lauren** \n15. **Quinta Brunson** at the ‘Zootopia 2’ Premiere wearing **Shushu / Tong Fall Winter 2025**, styled by Jessica Paster\n16. **Michael B Jordan** at the 2025 American Cinematheque Awards wearing **Louis Vuitton**, styled by Jason Bolden\n17. **Jennifer Aniston** at the Variety x Apple TV ‘The Morning Show’ Finale and Reception wearing **Givenchy Spring 2026**\n18. **Ke Huy Quan** ất the ‘Zooptopia 2’ Premiere wearing **Fear of God**",
        "title": "A Weekly Round Up Look Book: Looks you might not have seen this week! [November 23, 2025]",
        "search_query": "roofman"
    },
    {
        "create_date": 1763772921.0,
        "id": "1p3fsqx",
        "subreddit": "CasualConversation",
        "link": "https://www.reddit.com/r/CasualConversation/comments/1p3fsqx/roofman_and_2004/",
        "self_text": "I recently saw a new movie Roofman, the main character secretly lives in a Toys “R” Us store for months, it’s based on a true story and it takes place in 2004. I’m sorry to beat a dead horse here but it made me miss that time. Also seeing the toys from back then.. These days there’s still lots of toys for toddlers and small kids but when they reach a couple years older those kids are already on phones/tablets/computers. Something I think about is how that would be my ideal time of technology, there was tv, internet, cell phones etc but it wasn’t everywhere and everything online 24/7. Anyway, no I’m not an old bitter person, I’m 30 but that movie just reminded me of some things.",
        "title": "Roofman and 2004",
        "search_query": "roofman"
    },
    {
        "create_date": 1760712399.0,
        "id": "1o93am5",
        "subreddit": "shittymoviedetails",
        "link": "https://www.reddit.com/r/shittymoviedetails/comments/1o93am5/in_a_failed_attempt_to_recreate_the_hype_of_2023s/",
        "self_text": "",
        "title": "In a failed attempt to recreate the hype of 2023’s Barbenheimer, studios released Roofman and Tron Ares on October 10th, known as Roofies",
        "search_query": "roofman"
    },
    {
        "create_date": 1760964309.0,
        "id": "1obi1xn",
        "subreddit": "myfavoritemurder",
        "link": "https://www.reddit.com/r/myfavoritemurder/comments/1obi1xn/roofman_did_mfm_ever_cover_it/",
        "self_text": "Hi! I just saw the movie Roofman with Channing Tatum and Kirsten Dunst about the burglar ( Jeffrey Manchester) who robs several McDonald’s and other fast food chains by dropping in through the roof. Did MFM ever cover this story? I remember Karen covering a few stories that involved McDonald’s. Thanks! ",
        "title": "Roofman- did MFM ever cover it?",
        "search_query": "roofman"
    },
    {
        "create_date": 1761436443.0,
        "id": "1og6csc",
        "subreddit": "nederlands",
        "link": "https://www.reddit.com/r/nederlands/comments/1og6csc/het_toppunt_van_schijt_hebben_aan_andere_mensen/",
        "self_text": "Vanavond ben ik naar de film Roofman gegaan bij de Pathé. Vanaf de gang richting de zaal hoorde ik al een geluid wat ik niet thuis kon brengen, een of ander bonkend geluid. Vreemd dacht ik, maar het zal wel niks zijn. Dus ik loop de zaal binnen met in m’n ene hand nacho’s en salsadip, en in m’n andere hand een flesje drinken, dan word ik bijna omver gelopen door een stuk of twaalf kinderen die tikkertje aan het spelen zijn. Dat was dus het bonkende geluid wat ik hoorde vanaf de gang, want ze stampten met zijn allen op de vloer tijdens het rennen, dat deden ze door de hele zaal en tussen alle stoelen door. \n\nZe schreeuwden en gilden naar elkaar en de ouders zeiden er niets van. Er stond ook een medewerker vanaf de zijkant mee te kijken, maar ook hij liet het toe. \n\nOké dacht ik, dit is een behoorlijk hoog tokkiegehalte. Maar het voorprogramma was nog niet gestart dus het zal hopelijk wel meevallen, als ze tijdens de film maar stil zijn.\n\nHet voorprogramma is inmiddels gestart, en de medewerker loopt naar achteren waar hij de zaal in de gaten houdt. De moeder zei ondertussen dat ze stil moesten zijn. Eindelijk onderneemt ze actie, maar toen kwam de reactie van haar zoon: “hou je mond mam”. Behoorlijk aso om dit tegen je moeder te zeggen, maar ze gaf er niets om merkte ik. \n\nDe film begon en het eerste half uur van de film was het goed te doen, de kinderen waren aan het eten en drinken en keken naar de film. \n\nMaar toen begon de ellende, want de nieuwe TikTok-generatie heeft een vrij korte spanningsboog. Ongeveer elke 30 minuten moesten ze naar het toilet in groepjes van 4 tot 6. Dit deden ze uiteraard niet zo stil mogelijk, maar ze stampten rennend zo hard mogelijk over de vloer. Ook liepen ze constant door het beeld en ze praatten door de film heen. De medewerker komt na een tijdje weer binnen en loopt via de zijkant naar het midden van de zaal om zichtbaar aanwezig te zijn, en dit helpt wel iets, al is zijn flitsende lampje van zijn portofoon erg irritant. \n\nWat een verschrikkelijke en armoedige ervaring was dit. De ouders zijn onbekwaam om hun eigen zoon op te voeden, laat staan dat ze een kinderfeestje kunnen begeleiden in een fucking bioscoop. Een condoom had veel leed kunnen besparen. Als ik dit vroeger als kind zou flikken zou ik een klap tegen m’n kop krijgen. Het lijkt wel alsof de mensheid met de generatie verpauperd.\n\nIk wil de betreffende ouders bedanken voor het verpesten van mijn avond en die van alle andere bezoekers. Ik hoop dat jullie allebei eeuwige jeuk aan jullie anus krijgen. ",
        "title": "Het toppunt van schijt hebben aan andere mensen: kinderfeestje geven in de bioscoop",
        "search_query": "roofman"
    },
    {
        "create_date": 1760565629.0,
        "id": "1o7olbl",
        "subreddit": "CelebEvents",
        "link": "https://www.reddit.com/r/CelebEvents/comments/1o7olbl/kirsten_dunst_roofmanheadline_gala_at_the_69th/",
        "self_text": "",
        "title": "Kirsten Dunst | 'Roofman''Headline Gala at the 69th BFI London Film Festival 14th October 2025",
        "search_query": "roofman"
    },
    {
        "create_date": 1762958777.0,
        "id": "1ov71y0",
        "subreddit": "moviecritic",
        "link": "https://www.reddit.com/r/moviecritic/comments/1ov71y0/roofman/",
        "self_text": "*Roofman* is a throwback picture in many ways.  It’s the sort of film that Hollywood studios rarely make these days, a low-budget, comedy-drama based on true events involving real people.  It's an original character-driven story about adults, made for adults.  Twenty years ago, these movies were released regularly and were popular with moviegoers.  Flash-forward to today, and this might be the only movie of its kind released all year by the five majors.\n\nThe movie is essentially a vehicle for Channing Tatum, and it affirms that he can deliver a complete performance when given the opportunity.  Having him play a reluctant armed robber finding love on the lam is a perfect fit for Tatum, because it allows him to be intelligent, sensitive, sexy and goofy, sometimes within the same scene.  Although the movie wisely plays to his carefree persona, he’s also incredibly moving in the movie’s dramatic scenes as well.  This might be his best performance to date, even taking into account *Foxcatcher* and *Magic Mike*.\n\nPairing Tatum with Dunst was a brilliant casting decision, because the two have incredible chemistry throughout.  The fun they have playing off each other’s quirky acting sensibilities is infectious.  Both are actors who enjoy coloring outside the lines whenever they can, and the texture they give their characters makes them charming and relatable.  They’re so convincing as a couple here I’d like to see them paired-up in another movie.\n\nA movie like this could have gone with no-name actors for the supporting cast for budgetary purposes.  Thankfully, this one has an amazing collection of actors who make the movie better.  LaKeith Stanfield is electric as Tatum’s foul-mouthed, straight talking brother-in-arms.  Peter Dinklage is a delightful sourpuss as the terrible boss of the toy store.  Uzo Aduba, Ben Mendelsohn and Juno Temple also shine in smaller roles as well.  Lily Collias and Kennedy Moyer are also endearing as the older and younger daughters.\n\nWriter-director Derek Cianfrance has explored good men who are destined to make bad decisions before ([*Sound of Metal*](https://detroitcineaste.net/2021/03/13/sound-of-metal-2020/), *The Place Beyond the Pines*, *Blue Valentine*).  This one plays like a lighter take of the first act of *Pines*, with a comedic bent that balances the desperation.  Cianfrance has an ear for dialogue that’s honest and sometimes painful, but that never devolves into melodrama.  He also ensures that every performance is memorable, no matter how small.  While this movie isn’t as serious as Cianfrance’s previous films, it’s equally sympathetic towards its flawed characters.  Maybe it represents his evolution as a storyteller, the recognition that although life can be difficult and sad, it still has moments of joy worth cherishing.\n\n*Roofman* is a heartfelt movie that entertains the old fashioned way, with interesting characters and winning performances.  Channing Tatum and Kristen Dunst are engaging in the leading roles, and Tatum’s performance represents a career best.  It’s movie magic rendered at human scale.  **Recommended**.\n\n[https://detroitcineaste.net/2025/11/12/roofman-movie-review-and-analysis-channing-tatum-kirsten-dunst/](https://detroitcineaste.net/2025/11/12/roofman-movie-review-and-analysis-channing-tatum-kirsten-dunst/)",
        "title": "Roofman",
        "search_query": "roofman"
    },
    {
        "create_date": 1751336160.0,
        "id": "1loq45z",
        "subreddit": "blankies",
        "link": "https://www.reddit.com/r/blankies/comments/1loq45z/is_it_just_me_or_does_roofman_remind_you_of/",
        "self_text": "There something very similar about these movies, both people get end up staying one place, and they end up meeting a women they like who doesn't know the main characters trouble.",
        "title": "Is it just me or does Roofman remind you of another film",
        "search_query": "roofman"
    },
    {
        "create_date": 1757250138.0,
        "id": "1nasmh9",
        "subreddit": "CelebEvents",
        "link": "https://www.reddit.com/r/CelebEvents/comments/1nasmh9/kirsten_dunst_roofman_world_premiere_at_the_2025/",
        "self_text": "",
        "title": "Kirsten Dunst | 'Roofman' World Premiere at the 2025 Toronto International Film Festival 6th September 2025",
        "search_query": "roofman"
    },
    {
        "create_date": 1760039008.0,
        "id": "1o2fqkn",
        "subreddit": "AMCScreenUnseen",
        "link": "https://www.reddit.com/r/AMCScreenUnseen/comments/1o2fqkn/will_you_be_watching_the_movie_channing_tatum/",
        "self_text": "\n",
        "title": "Will you be watching the movie? Channing Tatum &amp; Kirsten Dunst Interview - Roofman (2025)",
        "search_query": "roofman"
    },
    {
        "create_date": 1763519338.0,
        "id": "1p0vkl2",
        "subreddit": "shittymoviedetails",
        "link": "https://www.reddit.com/r/shittymoviedetails/comments/1p0vkl2/in_roofman_2025_channing_tatum_plays_a_character/",
        "self_text": "",
        "title": "In Roofman (2025) Channing Tatum plays a character named Jeffrey. This is not in reference to that one time he said \"my name is Jeff\"",
        "search_query": "roofman"
    },
    {
        "create_date": 1762990735.0,
        "id": "1ovlf8r",
        "subreddit": "movies",
        "link": "https://www.reddit.com/r/movies/comments/1ovlf8r/roofman_end_credits/",
        "self_text": "Could it be that two of the officers interviewed in the end credits also appeared in the movie — like the blonde policewoman and the bald officer? Or am I just imagining it? It says that Molly Price acts as Sergeant Katherine Scheimreif so do we see Katherine Scheimreif in the end credits or Molly Price?",
        "title": "Roofman end credits",
        "search_query": "roofman"
    },
    {
        "create_date": 1763320719.0,
        "id": "1oyufwc",
        "subreddit": "GodAwfulMovies",
        "link": "https://www.reddit.com/r/GodAwfulMovies/comments/1oyufwc/roofman/",
        "self_text": "Wait, I'm halfway through and he started going to church.\n\nIt counts.",
        "title": "Roofman",
        "search_query": "roofman"
    },
    {
        "create_date": 1761253647.0,
        "id": "1oef8x5",
        "subreddit": "boxoffice",
        "link": "https://www.reddit.com/r/boxoffice/comments/1oef8x5/paramount_miramaxs_roofman_grossed_417k_on/",
        "self_text": "",
        "title": "Paramount &amp; Miramax's Roofman grossed $417K on Wednesday (from 3,370 locations).  Total domestic gross stands at $17.02M.",
        "search_query": "roofman"
    },
    {
        "create_date": 1763047949.0,
        "id": "1ow44n4",
        "subreddit": "moviereviews",
        "link": "https://www.reddit.com/r/moviereviews/comments/1ow44n4/roofman_review/",
        "self_text": "*Roofman* is a throwback picture in many ways.  It’s the sort of film that Hollywood studios rarely make these days, a low-budget, comedy-drama based on true events involving real people.  It's an original character-driven story about adults, made for adults.  Twenty years ago, these movies were released regularly and were popular with moviegoers.  Flash-forward to today, and this might be the only movie of its kind released all year by the five majors.\n\nThe movie is essentially a vehicle for Channing Tatum, and it affirms that he can deliver a complete performance when given the opportunity.  Having him play a reluctant armed robber finding love on the lam is a perfect fit for Tatum, because it allows him to be intelligent, sensitive, sexy and goofy, sometimes within the same scene.  Although the movie wisely plays to his carefree persona, he’s also incredibly moving in the movie’s dramatic scenes as well.  This might be his best performance to date, even taking into account *Foxcatcher* and *Magic Mike*.\n\nPairing Tatum with Dunst was a brilliant casting decision, because the two have incredible chemistry throughout.  The fun they have playing off each other’s quirky acting sensibilities is infectious.  Both are actors who enjoy coloring outside the lines whenever they can, and the texture they give their characters makes them charming and relatable.  They’re so convincing as a couple here I’d like to see them paired-up in another movie.\n\nA movie like this could have gone with no-name actors for the supporting cast for budgetary purposes.  Thankfully, this one has an amazing collection of actors who make the movie better.  LaKeith Stanfield is electric as Tatum’s foul-mouthed, straight talking brother-in-arms.  Peter Dinklage is a delightful sourpuss as the terrible boss of the toy store.  Uzo Aduba, Ben Mendelsohn and Juno Temple also shine in smaller roles as well.  Lily Collias and Kennedy Moyer are also endearing as the older and younger daughters.\n\nWriter-director Derek Cianfrance has explored good men who are destined to make bad decisions before ([*Sound of Metal*](https://detroitcineaste.net/2021/03/13/sound-of-metal-2020/), *The Place Beyond the Pines*, *Blue Valentine*).  This one plays like a lighter take of the first act of *Pines*, with a comedic bent that balances the desperation.  Cianfrance has an ear for dialogue that’s honest and sometimes painful, but that never devolves into melodrama.  He also ensures that every performance is memorable, no matter how small.  While this movie isn’t as serious as Cianfrance’s previous films, it’s equally sympathetic towards its flawed characters.  Maybe it represents his evolution as a storyteller, the recognition that although life can be difficult and sad, it still has moments of joy worth cherishing.\n\n*Roofman* is a heartfelt movie that entertains the old fashioned way, with interesting characters and winning performances.  Channing Tatum and Kristen Dunst are engaging in the leading roles, and Tatum’s performance represents a career best.  It’s movie magic rendered at human scale.  **Recommended**.\n\n[https://detroitcineaste.net/2025/11/12/roofman-movie-review-and-analysis-channing-tatum-kirsten-dunst/](https://detroitcineaste.net/2025/11/12/roofman-movie-review-and-analysis-channing-tatum-kirsten-dunst/)",
        "title": "Roofman review",
        "search_query": "roofman"
    },
    {
        "create_date": 1760651846.0,
        "id": "1o8jk1j",
        "subreddit": "boxoffice",
        "link": "https://www.reddit.com/r/boxoffice/comments/1o8jk1j/paramount_miramaxs_roofman_grossed_739k_on/",
        "self_text": "",
        "title": "Paramount &amp; Miramax's Roofman grossed $739K on Wednesday (from 3,362 locations).  Total domestic gross stands at $11.24M.",
        "search_query": "roofman"
    },
    {
        "create_date": 1763482393.0,
        "id": "1p0g24j",
        "subreddit": "entertainment",
        "link": "https://www.reddit.com/r/entertainment/comments/1p0g24j/channing_tatums_roofman_sparks_reallife_reunions/",
        "self_text": "",
        "title": "Channing Tatum’s ‘Roofman’ sparks real-life reunions for McDonald’s bandit",
        "search_query": "roofman"
    },
    {
        "create_date": 1761478549.0,
        "id": "1ogiemf",
        "subreddit": "Millennials",
        "link": "https://www.reddit.com/r/Millennials/comments/1ogiemf/are_they_just_not_making_comedy_movies/",
        "self_text": "Wedding Crashes, Zoolander, Anchor  Man, Hot Tub Time Machine, Bridesmaids, Dodgeball-movies we quoted and loved, have seemed to be the last in the genre. Is it because people are more offended? Is it because AI sucks at writing comedy? I know movies genres go through phases (teen romance for example), is this phase just done?",
        "title": "Are they just not making comedy movies?",
        "search_query": "roofman"
    },
    {
        "create_date": 1762535637.0,
        "id": "1or077z",
        "subreddit": "oscarrace",
        "link": "https://www.reddit.com/r/oscarrace/comments/1or077z/channing_tatum_and_kirsten_dunst_star_in_derek/",
        "self_text": "",
        "title": "Channing Tatum and Kirsten Dunst Star in Derek Cianfrance's True Crime Comedy 'Roofman' | Academy Conversations",
        "search_query": "roofman"
    },
    {
        "create_date": 1763321231.0,
        "id": "1oyuni2",
        "subreddit": "blankies",
        "link": "https://www.reddit.com/r/blankies/comments/1oyuni2/roofman/",
        "self_text": "I am the biggest Cianfrance fan on earth probably, his first 3 films and his (absolutely brilliant masterful) TV show are all stuff I love. \n\nRoofman disappointed me greatly, it's a fun story and I think it was executed in a pretty uninteresting way. \n\nUnnecessary narration, overly long (seriously why isn't this a 90 minute film), and I really truly don't understand who so much of this is him building a relationship with this woman's children, I understand the idea that he misses his children and he's making up for that with that but why did we need like 10 separate scenes showing that?\n\nIt's just not a very compelling piece of storytelling especially compared to his previous films that are structured and paced so well, I'm shocked people are saying this is him \"maturing\" because it's not overly miserable like his previous work. \n\nThe cinematography is gorgeous and textured but the directing is often kinda uninspired, lacking the mindblowing blocking present in I Know This Much Is True. \n\nIt's a solid 6/10 but damn if I'm not disappointed that one of my favourite artists made something I don't feel compelled to ever watch again. ",
        "title": "Roofman",
        "search_query": "roofman"
    },
    {
        "create_date": 1760115373.0,
        "id": "1o36fnm",
        "subreddit": "boxoffice",
        "link": "https://www.reddit.com/r/boxoffice/comments/1o36fnm/roofman_picked_up_1m_in_thursday_previews_the/",
        "self_text": "",
        "title": "Roofman picked up $1M in Thursday previews. The Channing Tatum film officially opens today in 3,362 North American theaters.",
        "search_query": "roofman"
    },
    {
        "create_date": 1761147410.0,
        "id": "1odbnae",
        "subreddit": "MichaelTheMovie",
        "link": "https://www.reddit.com/r/MichaelTheMovie/comments/1odbnae/roofman_toys_r_us_set/",
        "self_text": "Saw this on ig, wasn’t it supposed to be a set for the biopic ? the toys r us we see there looks the same as in the leaks ",
        "title": "Roofman toys r us set",
        "search_query": "roofman"
    },
    {
        "create_date": 1761491846.0,
        "id": "1ogn7ew",
        "subreddit": "boxoffice",
        "link": "https://www.reddit.com/r/boxoffice/comments/1ogn7ew/paramount_miramaxs_roofman_grossed_an_estimated/",
        "self_text": "",
        "title": "Paramount &amp; Miramax's Roofman grossed an estimated $2.00M this weekend (from 2,347 locations).  Estimated total domestic gross stands at $19.36M.",
        "search_query": "roofman"
    },
    {
        "create_date": 1761334480.0,
        "id": "1of76pj",
        "subreddit": "boxoffice",
        "link": "https://www.reddit.com/r/boxoffice/comments/1of76pj/paramount_miramaxs_roofman_grossed_338k_on/",
        "self_text": "",
        "title": "Paramount &amp; Miramax's Roofman grossed $338K on Thursday (from 3,370 locations).  Total domestic gross stands at $17.36M.",
        "search_query": "roofman"
    }
]