[
    {
        "id": "1nerbo8",
        "title": "Official Discussion - The Long Walk [SPOILERS]",
        "selftext": "#Poll\n\n**If you've seen the film, please rate it [at this poll](https://strawpoll.ai/poll/vote/E3VHjnr22i6W)**\n\n**If you haven't seen the film but would like to see the result of the poll [click here](https://strawpoll.ai/poll/results/E3VHjnr22i6W)**\n\n#Rankings\n\n[Click here](https://strawpoll.ai/list/ItnAgr4mX7QR) to see the rankings of 2025 films\n\n[Click here](https://youpoll.me/list/4/) to see the rankings for every poll done\n\n\n---\n\n**Summary**\nIn a near-future America ravaged by economic collapse, fifty teenage boys are forced to participate in the Long Walk — a brutal, government-sanctioned endurance contest where the rules are simple: keep walking, or die. Based on the novel by Stephen King (as Richard Bachman).\n\n**Director**\nFrancis Lawrence\n\n**Writer**\nJT Mollner and Stephen King\n\n**Cast**\n\n* Cooper Hoffman\n* David Jonsson\n* Judy Greer\n* Mark Hamill\n* Garrett Wareing\n* Tut Nuyot\n\n**Rotten Tomatoes**\nCritics Score: [Not yet available](https://www.rottentomatoes.com/m/the_long_walk_2025)\n\n**Metacritic**\nScore: Not yet available\n\n**VOD**\nTheaters (October 17, 2025)\n\n**Trailer**\n[The Long Walk | Official Trailer](https://www.youtube.com/watch?v=I6n4uJ8Vzlg)\n\n---",
        "subreddit": "movies",
        "url": "https://www.reddit.com/r/movies/comments/1nerbo8/official_discussion_the_long_walk_spoilers/",
        "created_utc": 1757643316.0
    },
    {
        "id": "1noad1z",
        "title": "The movie the Long walk was completely ridiculous.",
        "selftext": "As someone who has run marathons and hiked for months straight (on pacific crest trail) I couldn't take this movie seriously. \n\nStephen King must have never walked more than 5 miles in his life. The same goes for anybody taking this movie seriously. \n\nYou have 18 year old guys who haven't done any serious athletic training (that we know about), and they casually walk a distance that would put the most elite endurance athletes in the world to shame. In jeans. And leather work boots  and tennis shoes. And button-up shirts.  \n\nAfter 25 miles, most of their feet would have serious blisters. At 50, they would be bloody messes, and at 100+ miles, those appendages would be would no longer be recognizable as feet. Let alone 200 miles. 300 miles. Lol. \n\nNot to mention exhsustion and fatigue. At 150+ miles, the walkers are still spontaneously breaking out and skipping, games of catch, and having whitty conversations. After being awake for days of non-stop walking.  Their feet would be long gone, and so would their calves, thighs...it was ridiculous \n\n\nThe main character white dude walked what, 80+ miles in socks. It's too much. I couldn't suspend my disbelief enough to keep from breaking out laughing everything the mileage after 100 miles flashed on the screen. Did anybody else feel this way?\n\n Other than the cheesy themes and ending, I would rather enjoy the acting, but it wasn't enough to save the movie. By day 2, the walkers should have been disheveled, limping, messes....\n\n\nEdit: typed on phone, spelling. \n\nEdit 2: Fiction still has to make sense, redditors. If Gandald was fighting orcs and being overwhelmed and then X-wing ti fighters from Star Wars dropped in and started basting Orcs, it would make no sense. Because it's not realistic for the LOTR World.  ",
        "subreddit": "unpopularopinion",
        "url": "https://www.reddit.com/r/unpopularopinion/comments/1noad1z/the_movie_the_long_walk_was_completely_ridiculous/",
        "created_utc": 1758610045.0
    },
    {
        "id": "1old6mj",
        "title": "The Long Walk is a legit fucked up movie that I highly recommend",
        "selftext": "I just finished this movie and it legit left an impact on me. I HIGHLY recommend it if you’ve been on the fence about it. \n\nBut yeah, be warned it’s a rough watch",
        "subreddit": "horror",
        "url": "https://www.reddit.com/r/horror/comments/1old6mj/the_long_walk_is_a_legit_fucked_up_movie_that_i/",
        "created_utc": 1761964934.0
    },
    {
        "id": "1myuw3q",
        "title": "Hey /r/movies, I’m Stephen King! Ask me anything about The Long Walk book or movie.",
        "selftext": "Hey r/movies, I’m Stephen King. You might know me from Stand By Me, It, or Shawshank Redemption, but my latest project is actually the first book I ever wrote. The Long Walk hits theaters on September 12. Ask me anything about the book or movie. \n\n**Trailer:**\n\n[https://www.youtube.com/watch?v=vAtUHeMQ1F8](https://www.youtube.com/watch?v=vAtUHeMQ1F8)\n\n&gt;In a dystopian United States ruled by a totalitarian regime, a group of young men enter an annual walking contest in which they must maintain a speed of at least three miles per hour or risk execution. The contest ends when only one walker remains alive.\n\nIt stars Cooper Hoffman, David Jonsson, Ben Wang, Charlie Plummer, Roman Griffin Davis, Garrett Wareing, Joshua Odjick, Tut Nyuot, Mark Hamill, Judy Greer, and Josh Hamilton. \n\nI'll be back on Wednesday 8/27 at 12:00 PM ET to answer your questions.\n\n",
        "subreddit": "movies",
        "url": "https://i.redd.it/f0jbdlbzsvkf1.jpeg",
        "created_utc": 1756040253.0
    },
    {
        "id": "1o8ta8o",
        "title": "In The Long Walk (2025)  a movie about a walking competition, 50 boys walking till the last one standing, there are guys who chose to wear converse which as the the movie showed is literally worse than going barefoot.",
        "selftext": "",
        "subreddit": "shittymoviedetails",
        "url": "https://i.redd.it/t3iestrv1mvf1.jpeg",
        "created_utc": 1760680095.0
    },
    {
        "id": "1neqy3m",
        "title": "Just watched The Long Walk, wow.",
        "selftext": "I watched the trailer a few days ago and thought it looks cool, im not familiar with Kings work and expected a Squid Game like experience. I've seen IT, but thought that it was kinda mid, but the reception seemed overwhelmingly positive so i went to the theater today and wow.\n\nIt was not a fun watch in the slightest, not even entertaining. It was a painful, bleak watch. I was emotionally exhausted throughout the whole movie and kept watching. One of the best movie experiences i've ever had. The characters seemed somewhat cheesy, but i got used to it quite quickly and the dialogue was great and i loved the way the worldbuilding was handled. fantastic movie. I'm definitely reading the book when i find the time for it\n\nI'm usually not a horror fan, but this was definitely a fantastic movie that really didn't hold back in the slightest.",
        "subreddit": "horror",
        "url": "https://www.reddit.com/r/horror/comments/1neqy3m/just_watched_the_long_walk_wow/",
        "created_utc": 1757642178.0
    },
    {
        "id": "1nfg8yg",
        "title": "I would like people’s opinions on the ending of *The Long Walk* film’s ending—it shocked me.",
        "selftext": "",
        "subreddit": "stephenking",
        "url": "https://i.redd.it/b9maaxyg3tof1.jpeg",
        "created_utc": 1757714442.0
    },
    {
        "id": "obo9zb",
        "title": "A beautiful and understated moment near the end of The Long Walk",
        "selftext": "",
        "subreddit": "stephenking",
        "url": "https://i.redd.it/r7negwehem871.jpg",
        "created_utc": 1625153592.0
    },
    {
        "id": "n1a59g",
        "title": "Nobody can explain the rules of the Long Walk correctly",
        "selftext": "This post was inspired by an over-simplified synopsis of The Long Walk that I found on this page which mentions the upcoming movie for The Long Walk.\n\n[https://www.looper.com/354641/every-upcoming-stephen-king-movie-and-tv-series/](https://www.looper.com/354641/every-upcoming-stephen-king-movie-and-tv-series/)\n\nThe synopsis reads:\n\n&gt;Fans have waited years for a film version of The Long Walk, Stephen King's dystopian novel about a competition where young men start out on a walk — and can't stop or slow down. Breaking the rules gets you shot, so they must walk or die until only one Walker remains.\n\nIt's hardly a dystopian novel.  The definition of dystopian is \"relating to or denoting an imagined state or society where there is great suffering or injustice.\"  If the boys were forced into the competition against their will, it would be a dystopian society but they volunteer for a lottery in which 200 boys are picked, 100 walkers and 100 backups.  The boys picked in the lottery get two opportunities to back out. They all understand the rules and consequences and nobody is being forced.\n\nGarraty's father did get squaded for speaking out against the Major but that's just a dictatorship.  The society might be a dystopian but King doesn't world build enough for us to know so we can't assume it is.\n\nStopping or slowing down is not against the rules and you don't get shot for doing it.  You get shot when your 2-minute timer reaches 0.\n\n[http://patcoston.com/StephenKing/TheLongWalk-Rules.aspx](http://patcoston.com/StephenKing/TheLongWalk-Rules.aspx)\n\nThe novel is filled with examples of people stopping and slowing down.  All that happens is that their 2-minute timer counts down when their speed in the correct direction falls under 4 mph.  They get courtesy warnings when their timer reaches 90, 60, 30 and a ticket at 0.  Think about how difficult it would be to poop while trying to walk faster than 4 mph.\n\nThere are rules that can be broken that will get you shot like leaving the road or attacking a soldier.\n\nHere are more over-simplified synopsis.\n\n[http://patcoston.com/StephenKing/TheLongWalk-SynopsesAnalysis.aspx](http://patcoston.com/StephenKing/TheLongWalk-SynopsesAnalysis.aspx)\n\nEvery review of The Long Walk on YouTube is also over-simplified.\n\n[http://patcoston.com/StephenKing/TheLongWalk-VideoReviews.aspx](http://patcoston.com/StephenKing/TheLongWalk-VideoReviews.aspx)",
        "subreddit": "TheLongWalk",
        "url": "https://www.reddit.com/r/TheLongWalk/comments/n1a59g/nobody_can_explain_the_rules_of_the_long_walk/",
        "created_utc": 1619719146.0
    },
    {
        "id": "1n3ez38",
        "title": "Special 'The Long Walk' Screening Will Eliminate Viewers Who Can’t Keep Up on a Treadmill (3 MPH)",
        "selftext": "",
        "subreddit": "movies",
        "url": "https://consequence.net/2025/08/the-long-walk-treadmill-screening/",
        "created_utc": 1756491427.0
    },
    {
        "id": "1nopwas",
        "title": "In the Long Walk (2025) all the competitors live in a totalitarian future where athletic wear is banned",
        "selftext": "",
        "subreddit": "shittymoviedetails",
        "url": "https://i.redd.it/km8xnzhcnyqf1.png",
        "created_utc": 1758653489.0
    },
    {
        "id": "1njfl0t",
        "title": "In “The Long Walk”, Baker says he poops every day instead of the normal once-a-week poop… What?",
        "selftext": "",
        "subreddit": "shittymoviedetails",
        "url": "https://i.redd.it/y0exm69fpqpf1.jpeg",
        "created_utc": 1758121350.0
    },
    {
        "id": "1kg4308",
        "title": "First Images from Francis Lawrence's 'The Long Walk' - The story follows a group of young men in a dystopian future who embark on a life-or-death marathon with no set finish line",
        "selftext": "",
        "subreddit": "movies",
        "url": "https://i.redd.it/m5v01ze9v5ze1.jpeg",
        "created_utc": 1746537025.0
    },
    {
        "id": "1mzw8iy",
        "title": "New Poster for 'The Long Walk' - In a dystopian United States ruled by a totalitarian regime, a group of young men enter an annual walking contest in which they must maintain a speed of at least three miles per hour or risk execution. The contest ends when only one walker remains alive.",
        "selftext": "",
        "subreddit": "movies",
        "url": "https://i.redd.it/1mn7reb067lf1.jpeg",
        "created_utc": 1756141473.0
    },
    {
        "id": "1nd9ukv",
        "title": "Anon on The Long Walk (2025)",
        "selftext": "",
        "subreddit": "greentext",
        "url": "https://i.redd.it/njd6cto97bof1.jpeg",
        "created_utc": 1757497796.0
    },
    {
        "id": "1oc0wde",
        "title": "In The Long Walk (2025), 50 young men continuously walk. If they stop, they are killed until only 1 of them remains and wins a big prize. This is just The Hunger Games with extra steps.",
        "selftext": "",
        "subreddit": "shittymoviedetails",
        "url": "https://i.redd.it/bwck6wnhjdwf1.jpeg",
        "created_utc": 1761012903.0
    },
    {
        "id": "1oy4gy0",
        "title": "‘The Long Walk’ Submits Entire Ensemble in Supporting Acting Categories for Oscars and Other Awards",
        "selftext": "",
        "subreddit": "movies",
        "url": "https://variety.com/2025/film/awards/the-long-walk-oscars-submissions-cooper-hoffman-supporting-1236581847/",
        "created_utc": 1763244725.0
    },
    {
        "id": "1n8chgv",
        "title": "(Video) THE LONG WALK... on a treadmill 🤪🤪 🤪",
        "selftext": "",
        "subreddit": "stephenking",
        "url": "https://v.redd.it/cgg5wmylw5nf1",
        "created_utc": 1756997853.0
    },
    {
        "id": "1kgzhpr",
        "title": "The Long Walk | Official Trailer",
        "selftext": "",
        "subreddit": "movies",
        "url": "https://www.youtube.com/watch?v=vAtUHeMQ1F8",
        "created_utc": 1746630024.0
    },
    {
        "id": "1n6n286",
        "title": "'The Long Walk' - Review Thread",
        "selftext": "*Teens participate in a grueling high-stakes contest where they must continuously walk or be shot by a member of their military escort.*\n\nDirector: Francis Lawrence (The Hunger Games: Catching Fire, Mockingjay - Pts. 1 &amp; 2 , and The Ballad of Songbirds &amp; Snakes)\n\nCast: Cooper Hoffman, Ben Wang, Mark Hamill, David Jonsson, Garrett Wareing, Tut Nyuot, Charlie Plummer\n\n**Rotten Tomatoes:** [94%](https://www.rottentomatoes.com/m/the_long_walk_2025)\n\n**Metacritic:** [80/100](https://www.metacritic.com/movie/the-long-walk-2025/)\n\nSome Reviews:\n\n[Total Film - Lauren Milici](https://www.gamesradar.com/entertainment/horror-movies/the-long-walk-review/)\n\n&gt;The Long Walk is not for the faint of heart, but it is one of the best Stephen King adaptations ever made, and one of the best dystopian sci-fi movies to hit the big screen in a really long time.\n\n[Next Best Picture](https://www.rottentomatoes.com/critics/source/3046) \\- [Giovanni Lago](https://www.rottentomatoes.com/critics/giovanni-lago) \\- 7 / 10\n\n&gt;It can exhilarating as Frances Lawrence and JT Mollner bring a bit of edge to this beloved Stephen King adaptation. Cooper Hoffman and David Jonsson are both excellent, delivering riveting performances that emotionally reel in the audience. It can also feel repetitious at times, trying to replicate the highs of some of the more exciting set pieces, building towards an expected ending.\n\n[Slashfilm - BJ Colangelo](https://www.slashfilm.com/1953442/the-long-walk-review/) \\- 9 / 10\n\n&gt;\"The Long Walk\" is an emotionally obliterating all-time great Stephen King adaptation, and undoubtedly one of the best films of 2025. The camaraderie shown by the group is not unlike the foxhole friendships developed between soldiers during wartime, but given the hopelessness of their situation, it starts to feel like we're watching the American version of \"All Quiet on the Western Front.\" Wang provides a majority of the much-needed levity with his sharp tongue and fearless delivery, while Baker's warm, gentle optimism represents the best of humanity.",
        "subreddit": "movies",
        "url": "https://www.reddit.com/r/movies/comments/1n6n286/the_long_walk_review_thread/",
        "created_utc": 1756827964.0
    },
    {
        "id": "1o1hnf5",
        "title": "The Long Walk",
        "selftext": "",
        "subreddit": "comics",
        "url": "https://www.reddit.com/gallery/1o1hnf5",
        "created_utc": 1759945975.0
    },
    {
        "id": "1n8uvai",
        "title": "The Long Walk is Horrifying",
        "selftext": "Exactly what the title says. Didn’t expect a horror movie going in and didn’t really get one but it’s one of the scariest war-adjacent films I’ve seen in recent memory. Need more people to see it and talk about it.",
        "subreddit": "horror",
        "url": "https://www.reddit.com/r/horror/comments/1n8uvai/the_long_walk_is_horrifying/",
        "created_utc": 1757043567.0
    },
    {
        "id": "1n3ta57",
        "title": "Special The Long Walk Screening Will Eliminate Viewers Who Can’t Keep Up on a Treadmill",
        "selftext": "",
        "subreddit": "nottheonion",
        "url": "https://consequence.net/2025/08/the-long-walk-treadmill-screening/",
        "created_utc": 1756530744.0
    },
    {
        "id": "1kk94a3",
        "title": "In The Long Walk (2025) the minimum walking speed needed is 3mph. In the book it was 4mph. This is is a reasonable change as I can't maintain a 4mph walking speed for more than a few hours without a gun to my head.",
        "selftext": "",
        "subreddit": "shittymoviedetails",
        "url": "https://i.redd.it/69sg8z12f70f1.png",
        "created_utc": 1746991651.0
    },
    {
        "id": "1n45d92",
        "title": "Special 'The Long Walk' Screening Will Eliminate Viewers Who Can’t Keep Up on a Treadmill (3 MPH)",
        "selftext": "",
        "subreddit": "horror",
        "url": "https://consequence.net/2025/08/the-long-walk-treadmill-screening",
        "created_utc": 1756569922.0
    },
    {
        "id": "1kgzi19",
        "title": "THE LONG WALK – Official Trailer",
        "selftext": "",
        "subreddit": "horror",
        "url": "https://youtu.be/vAtUHeMQ1F8",
        "created_utc": 1746630042.0
    },
    {
        "id": "1myv2jm",
        "title": "Hey /r/movies, I’m Stephen King! Ask me anything about The Long Walk book or movie.",
        "selftext": "",
        "subreddit": "stephenking",
        "url": "https://i.redd.it/f0jbdlbzsvkf1.jpeg",
        "created_utc": 1756040728.0
    },
    {
        "id": "1mpfyd4",
        "title": "Just finished The Long Walk...",
        "selftext": "I mean, obviously. \n\nWhat are yalls thoughts on it? I think this was my least favorite, personally, but opinions are like assholes 🤷🏼‍♀️",
        "subreddit": "stephenking",
        "url": "https://i.redd.it/cqh0y5ulluif1.gif",
        "created_utc": 1755117558.0
    },
    {
        "id": "1kh02bb",
        "title": "Lionsgate drops first trailer for Stephen King's 'The Long Walk'",
        "selftext": "",
        "subreddit": "stephenking",
        "url": "https://www.youtube.com/watch?v=vAtUHeMQ1F8",
        "created_utc": 1746631376.0
    },
    {
        "id": "1ocpusc",
        "title": "In \"The Long Walk\" (2025), a group of people are forced to exercise. This is considered a horror movie because they're Americans.",
        "selftext": "",
        "subreddit": "shittymoviedetails",
        "url": "https://i.redd.it/mw16corrajwf1.jpeg",
        "created_utc": 1761082611.0
    },
    {
        "id": "1nczn0b",
        "title": "Mark Hamill says The Long Walk is a \"faithful\" adaptation of the Stephen King book, and that it was a \"thrill\" to have the author approve of his casting: \"That was motivation and validation for me\"",
        "selftext": "",
        "subreddit": "entertainment",
        "url": "https://www.gamesradar.com/entertainment/horror-movies/mark-hamill-says-the-long-walk-is-a-faithful-adaptation-of-the-stephen-king-book-and-that-it-was-a-thrill-to-have-the-author-approve-of-his-casting-that-was-motivation-and-validation-for-me/",
        "created_utc": 1757463367.0
    },
    {
        "id": "1m9dzhl",
        "title": "The Long Walk | Official Trailer 2 - Mark Hamill, Cooper Hoffman, David Jonsson",
        "selftext": "",
        "subreddit": "movies",
        "url": "https://www.youtube.com/watch?v=Toj3Zxun7aQ",
        "created_utc": 1753485327.0
    },
    {
        "id": "1kk4t9o",
        "title": "The Long Walk (2025) The author of the novel, Richard Bachman, is being completely ignored in the advertising for the upcoming film version. Instead, some guy named Stephen King is trying to claim all the credit. What an asshole.",
        "selftext": "",
        "subreddit": "stephenking",
        "url": "https://i.redd.it/szed7f45h60f1.jpeg",
        "created_utc": 1746980457.0
    },
    {
        "id": "1oinhae",
        "title": "As fans of the King... What do you think of \"The Long Walk\"?",
        "selftext": "",
        "subreddit": "stephenking",
        "url": "https://www.reddit.com/gallery/1oinhae",
        "created_utc": 1761690320.0
    },
    {
        "id": "1nfke0c",
        "title": "Reading \"The Long Walk\" for the first time and I love it. There's one detail that's making me laugh though, as someone who's been a runner for 15 years",
        "selftext": "And that's the speed King chooses for these boys: the minimum walking speed is 4 MPH, and not only that, a group of boys early on break ahead of the pack at \"a casual 6 MPH\" for about five hours.\n\n6 miles an hour is not even a walk or jog, but just flat out running. So those boys chatting about their lives while going \"a casual 6 MPH\" would mean, already in Chapter 2, they ran the entire 26 mile New York City marathon in 5 hours with an extra 4 miles on top of it to boot. \n\nOur main character doesn't \"feel the first beads of sweat\" till the end of Chapter 2, over 20 miles in with uphills included, all at 4 MPH. So either these boys come from Olympia itself, or King's choice of walking speeds was slightly skewed while writing💀.\n\nBook is still fantastic though! But from the trailer, they dropped the speed from 4 MPH to 3MPH, which makes sense, because there's just no way in sam hell that walk would last longer than 24 hours going 4 MPH.",
        "subreddit": "stephenking",
        "url": "https://www.reddit.com/r/stephenking/comments/1nfke0c/reading_the_long_walk_for_the_first_time_and_i/",
        "created_utc": 1757725727.0
    },
    {
        "id": "1ofbmsr",
        "title": "What kinda shoes would you bring for the long walk ? 😭",
        "selftext": "Also who tf shows up to a walking competition in converse ? ",
        "subreddit": "stephenking",
        "url": "https://i.redd.it/k6s2nttt05xf1.jpeg",
        "created_utc": 1761345642.0
    },
    {
        "id": "1nmdf3o",
        "title": "Going to see The Long Walk. Figured this was the appropriate gear",
        "selftext": "Made sure to wear sturdy shoes that wouldn't give me blisters too. ",
        "subreddit": "stephenking",
        "url": "https://i.redd.it/ada61uthreqf1.jpeg",
        "created_utc": 1758412614.0
    },
    {
        "id": "1no28ex",
        "title": "My wife and I just saw The Long Walk because she thought it \"looked like the hunger games\"",
        "selftext": "The first death she said \"It's so graphic!\". She enjoyed the story but described it as the \"most fucked up thing she's ever seen\".  This woman won't even get near a haunted house she's so innocent it's adorable.",
        "subreddit": "stephenking",
        "url": "https://www.reddit.com/r/stephenking/comments/1no28ex/my_wife_and_i_just_saw_the_long_walk_because_she/",
        "created_utc": 1758584497.0
    },
    {
        "id": "1kgeibd",
        "title": "Official Poster for Francis Lawrence's 'The Long Walk'",
        "selftext": "",
        "subreddit": "movies",
        "url": "https://i.redd.it/7v8jaoxyy7ze1.jpeg",
        "created_utc": 1746562534.0
    },
    {
        "id": "1nlh27i",
        "title": "Found a first edition of The Long Walk for $1!",
        "selftext": "I was kicking myself earlier this week for giving away my vintage copy of The Bachman Books years ago, and lo and behold look what I found today! ",
        "subreddit": "stephenking",
        "url": "https://www.reddit.com/gallery/1nlh27i",
        "created_utc": 1758319970.0
    },
    {
        "id": "1njn6er",
        "title": "This poor old couple that saw “The Long Walk” on a whim",
        "selftext": "It was just me, my gf, and an older couple. I think they saw it not knowing the premise other than there’s walking. like they went to the theatre and saw what was on kinda thing.\n\nSafe to say, when &gt;!Curly!&lt; got his ticket, they walked out of the movie \n\nThey even left their drink, guess seeing a kids head shot to bits wasn’t their idea of a fun time. Meanwhile I’m scarfing pretzel bites into my mouth\n\n",
        "subreddit": "stephenking",
        "url": "https://www.reddit.com/r/stephenking/comments/1njn6er/this_poor_old_couple_that_saw_the_long_walk_on_a/",
        "created_utc": 1758138217.0
    },
    {
        "id": "1njme2p",
        "title": "The Long Walk",
        "selftext": "Why do you think that The Long Walk has underperformed at the theater since it's release on the 12th? With horror having such a banger summer in the theaters, I fully expected it to do well. Reviews have been favorable and it's such a beloved, iconic Bachman/King short story and barely anyone has gone to see it.",
        "subreddit": "horror",
        "url": "https://www.reddit.com/r/horror/comments/1njme2p/the_long_walk/",
        "created_utc": 1758136391.0
    },
    {
        "id": "1ml31yh",
        "title": "AMA/Q&amp;A Announcement - Stephen King - Wednesday 8/27 at 3:00 PM ET - Author of The Shining, IT, The Shawshank Redemption, The Long Walk, The Stand, The Green Mile, Stand By Me, The Mist, Pet Sematary, Misery, Cujo, Salem's Lot, and lots more.",
        "selftext": "",
        "subreddit": "movies",
        "url": "https://i.redd.it/tfo1ago99uhf1.png",
        "created_utc": 1754677729.0
    },
    {
        "id": "f4bi2n",
        "title": "Ya boi Stephen King at it again. Not wasting any time on page 4 of \"The Long Walk\"",
        "selftext": "",
        "subreddit": "menwritingwomen",
        "url": "https://imgur.com/VMeyqS4",
        "created_utc": 1581783364.0
    },
    {
        "id": "1nopoqc",
        "title": "Dory, a blind cat, is now also a movie star. The friendly feline landed a role in The Long Walk, a Stephen King adaptation filmed in Manitoba, after the movie's director wanted to cast a cat with no eyes —and Dory performed her role purrfectly.",
        "selftext": "",
        "subreddit": "popculturechat",
        "url": "https://v.redd.it/n3lf9wtcmyqf1",
        "created_utc": 1758653022.0
    },
    {
        "id": "1n869mr",
        "title": "‘THE LONG WALK’ debuts with 93% on Rotten Tomatoes, Described as a brutal and heartbreaking survival tale that is easily one of the best movies of the year",
        "selftext": "",
        "subreddit": "stephenking",
        "url": "https://reelsbox.com/news/stephen-king-the-long-walk-earns-near-perfect-score/",
        "created_utc": 1756981004.0
    },
    {
        "id": "1kk4q6f",
        "title": "The Long Walk (2025) The author of the novel, Richard Bachman, is being completely ignored in the advertising for the upcoming film version. Instead, some guy named Stephen King is trying to claim all the credit. What an asshole.",
        "selftext": "",
        "subreddit": "shittymoviedetails",
        "url": "https://i.redd.it/szed7f45h60f1.jpeg",
        "created_utc": 1746980226.0
    },
    {
        "id": "1oi8bm0",
        "title": "In The Long Walk (2025), participants will explode if their speed drops below 3 mph.",
        "selftext": "",
        "subreddit": "shittymoviedetails",
        "url": "https://i.redd.it/kie1y5nnluxf1.jpeg",
        "created_utc": 1761655373.0
    },
    {
        "id": "1maehcu",
        "title": "Stephen King’s 'The Long Walk' is so intense Comic-Con had to black out segments",
        "selftext": "",
        "subreddit": "stephenking",
        "url": "https://www.themirror.com/entertainment/movies/stephen-king-film-comic-con-1293085",
        "created_utc": 1753594738.0
    },
    {
        "id": "1mjm62m",
        "title": "‘The Long Walk’ Rated “R” for Strong Bloody Violence and Grisly Images",
        "selftext": "",
        "subreddit": "movies",
        "url": "https://bloody-disgusting.com/movie/3891893/the-long-walk-rated-r-for-strong-bloody-violence-and-grisly-images/",
        "created_utc": 1754528061.0
    },
    {
        "id": "1kh2epn",
        "title": "Opinions on the long walk movie trailer",
        "selftext": "Whats your opinion on the trailer that just dropped for the long walk?Personally i found it amazing and im really hopeful for a good adaptation.",
        "subreddit": "stephenking",
        "url": "https://i.redd.it/gu3rwzbo4eze1.jpeg",
        "created_utc": 1746637042.0
    },
    {
        "id": "1ga4b4m",
        "title": "The Long Walk Movie ",
        "selftext": "Mark Hammil on the set of The Long Walk in Canada. ",
        "subreddit": "stephenking",
        "url": "https://i.redd.it/pwpy1y13fgwd1.jpeg",
        "created_utc": 1729666682.0
    },
    {
        "id": "1ozs90r",
        "title": "Currently watching, The Long Walk",
        "selftext": "",
        "subreddit": "moviecritic",
        "url": "https://i.redd.it/fdbnhla4tv1g1.jpeg",
        "created_utc": 1763413305.0
    },
    {
        "id": "1lizr05",
        "title": "Arai isn't up for the long walks anymore so she gets the princess treatment.",
        "selftext": "",
        "subreddit": "rarepuppers",
        "url": "https://i.redd.it/7bem7fpmes8f1.jpeg",
        "created_utc": 1750732519.0
    },
    {
        "id": "1ni53g7",
        "title": "‘The Long Walk’ Is the Rare Stephen King Story That Finally Abandons This Common Trope in His Work | It has no supernatural elements",
        "selftext": "",
        "subreddit": "savedyouaclick",
        "url": "https://web.archive.org/web/20250911234153/https://collider.com/the-long-walk-stephen-king-supernatural-trope/",
        "created_utc": 1757988349.0
    },
    {
        "id": "1nopnbs",
        "title": "Dory, a blind cat, landed a role in The Long Walk, a Stephen King adaptation filmed in Manitoba, after the movie's director wanted to cast a cat with no eyes.",
        "selftext": "",
        "subreddit": "TikTokCringe",
        "url": "https://v.redd.it/1louuwg3myqf1",
        "created_utc": 1758652935.0
    },
    {
        "id": "1kg5xqf",
        "title": "First Look at Stephen King’s The Long Walk: The Dystopian Coming-of-Age Story He Considered Too “Merciless” to Film",
        "selftext": "",
        "subreddit": "horror",
        "url": "https://www.vanityfair.com/hollywood/story/first-look-at-stephen-king-the-long-walk",
        "created_utc": 1746541839.0
    },
    {
        "id": "1nho9rw",
        "title": "Some book purist are too hard on the long walk adaptation",
        "selftext": "First off on its own merits as a film, this is a fantastic watch, 2nd as an adaptation I think it succeeds on multiple lvls. I get that readers will always nitpick at a film for what it excludes, but largely the charges I think were best for the medium of a film. The sexual horniness, cutting it from 100 to 50, lack of betting and crowd,and  even the ending. This movie does exactly what a good adaptation should do, it’s stays overall true to the source while standing in its own and open people who’ve never read the source material , to maybe checking out the full book",
        "subreddit": "stephenking",
        "url": "https://i.redd.it/rpgm815jfcpf1.jpeg",
        "created_utc": 1757948528.0
    },
    {
        "id": "1okepti",
        "title": "The long walk destroyed me 😭",
        "selftext": "",
        "subreddit": "tumblr",
        "url": "https://i.redd.it/za8q92atzbyf1.jpeg",
        "created_utc": 1761865874.0
    },
    {
        "id": "1ncvxt7",
        "title": "'The Long Walk' is Certified Fresh, currently at 96% on the Tomatometer, with 80 reviews.",
        "selftext": "",
        "subreddit": "boxoffice",
        "url": "https://i.redd.it/a08uwtsnk7of1.jpeg",
        "created_utc": 1757453870.0
    },
    {
        "id": "1ns011m",
        "title": "After watching the long walk, we all owe ben wang the BIGGEST FATTEST APOLOGY",
        "selftext": "If you werent here, when ben wang was casted as wyatt, there were a lot of people posting here kind of implying the casting team casted him because he's asian, and one of wyatt's defining traits is his oddsmaking, i will reserve my own opinions on this discourse, but i just saw the long walk, a pretty recent movie he starred in yesterday, and honestly that entirely dispelled the rumor for me. \n\nIn TLW he plays a character pretty similar to wyatt personality, syling and accent-wise, and without spoiling, if his performance towards the latter half of the movie is ANYTHING to go off of, he is undoubtedly the best actor they could have chosen for wyatt. Like, i cannot exxagerate how well he fits into the role, jusy pick any clip of him in the movie and youll see what i mean like damn\n\nTL:DR, after watching his preformance in the long walk, i know EXACTLY why ben wang was casted as wyatt callow and i truly dont think it has anything to do with his race",
        "subreddit": "Hungergames",
        "url": "https://i.redd.it/30iik1delqrf1.jpeg",
        "created_utc": 1758991694.0
    },
    {
        "id": "1kgeto7",
        "title": "Official poster for Francis Lawrence's 'The Long Walk'",
        "selftext": "",
        "subreddit": "stephenking",
        "url": "https://i.redd.it/kdl1wo1d18ze1.jpeg",
        "created_utc": 1746563294.0
    },
    {
        "id": "1okwlu8",
        "title": "My boyfriend decided to dress as Gary barkovitch from the long walk for Halloween",
        "selftext": "Posting this for them since there not on reddit.",
        "subreddit": "stephenking",
        "url": "https://www.reddit.com/gallery/1okwlu8",
        "created_utc": 1761922100.0
    },
    {
        "id": "1nffuux",
        "title": "The Long Walk Absolutely Wrecked Me",
        "selftext": "Just got home after seeing it and all I’ve been able to do is stare at the wall. It’s hands down not only one of the greatest King adaptions, but honestly one of the greatest movies of all-time—from the cast to the narrative to the bleakness and world they’ve built for the movie to the emotional wallops, this movie destroyed me. \n\nAnd good God, that ending. I know it’s going to be divisive, but I think it’s on par with The Mist as being one of the most brutal but effective endings of all time. Is it a feel-good ending? Hell no. Is it effective and realistic? I’d argue hell yes. &gt;!Watching a character’s worldview shatter so suddenly like that….it’s hard to put into words how powerful it was.!&lt;\n\nAnd that brings me to my last point- I wonder how hard this movie would’ve hit if we weren’t in our current situation in America. This movie could EASILY happen within the next decade with the way things are going. Ray and Peter are every one of us. The anger mixed with the hope mixed with the world seeping in and slowly destroying you- all I can do is stare at the ceiling and feel numb. ",
        "subreddit": "stephenking",
        "url": "https://www.reddit.com/r/stephenking/comments/1nffuux/the_long_walk_absolutely_wrecked_me/",
        "created_utc": 1757713485.0
    },
    {
        "id": "1n1o6vs",
        "title": "New poster for ‘THE LONG WALK’ The film follows a contest where 50 young men have to walk without stopping &amp; are killed if they pause for too long.",
        "selftext": "",
        "subreddit": "movies",
        "url": "https://i.redd.it/48z0ucphpllf1.jpeg",
        "created_utc": 1756317452.0
    },
    {
        "id": "1nedsr2",
        "title": "THE LONG WALK - 9/12 Reddit Screenings",
        "selftext": "Join us on THE LONG WALK. As a gift for this subreddit’s support of the film, we’re offering a free screening tomorrow in Los Angeles and New York – even better we’d love for everybody who attends to post their reactions after the screening in this post. \n\n \n\n**SIGN UP HERE:** [https://bit.ly/tlwredditscreenings](https://bit.ly/TLWRedditScreenings)\n\n \n\nSo, who’s ready to fucking WIN? See you there.\n\n \n\nTHE LONG WALK in theaters TONIGHT.",
        "subreddit": "movies",
        "url": "https://i.redd.it/rdeqbhyvckof1.png",
        "created_utc": 1757609087.0
    },
    {
        "id": "1ofoujc",
        "title": "I watched The Long Walk (2025) last night and I liked it",
        "selftext": "The Long Walk (2025) was pretty decent. I watched it for the first time last night and it felt like a classic Stephen King movie. The characters were actually interesting and there was a ton of good dialog. I put this movie in the \"game horror\" genre, like Escape Room, The Belko Experiment, Cube, etc. The characters looked timeless as well. I didn't feel like the director was like \"ok, you all are gen z, act like gen z !\", they acted like normal young men, almost instiguishable from millenial or gen x men.\n\nI've heard this movie did bad at the box office, unfortunately movies like these don't do well in theaters, but can form cult classic fans (Donnie Darko comes to mind). I give this movie an 8/10. If you all like Stephen King movies then this is right up your alley, I like dystopian game horror man, can't get enough of those movies.\n\nEDIT: There is also one thing I didn't get. In the beginning of the movie, one of the dudes said that every man volunteers for the Long Walk, but since it's a lottery, the likelihood of getting picked is low. Seriously though, I didn't understand why any of these 50 kids would join the Long Walk knowing that they would have a 1/50 chance of living. I don't understand how when these kids won the lottery, why did they just not show up to save themselves ? 1/50 is really low odds man. Why did they join the Long Walk knowing that you are most likely to die ?",
        "subreddit": "horror",
        "url": "https://www.reddit.com/r/horror/comments/1ofoujc/i_watched_the_long_walk_2025_last_night_and_i/",
        "created_utc": 1761390465.0
    },
    {
        "id": "1nkbju0",
        "title": "In the Long Walk (2025), theres a 2% (1/50) of surviving. Those are better odds than landing a job in this economy.",
        "selftext": "",
        "subreddit": "shittymoviedetails",
        "url": "https://i.redd.it/j6j423fyzxpf1.png",
        "created_utc": 1758209667.0
    },
    {
        "id": "1jjkqbd",
        "title": "How Bachman really got outed (from The Long Walk)",
        "selftext": "The blue chambray shirt strikes again!",
        "subreddit": "stephenking",
        "url": "https://i.redd.it/5t7kxnifjuqe1.jpeg",
        "created_utc": 1742913081.0
    },
    {
        "id": "1nf3c7j",
        "title": "Stephen King Deletes Charlie Kirk Tweets, Issues Apology Ahead of The Long Walk Release",
        "selftext": "",
        "subreddit": "CosmicBookNews",
        "url": "https://cosmicbook.news/stephen-king-apologizes-charlie-kirk-tweets",
        "created_utc": 1757683903.0
    },
    {
        "id": "1ngxqjd",
        "title": "With “The Long Walk” out and “The Running Man” being released later this year, how many of you were voracious Stephen King readers?",
        "selftext": "I went in a phase where I read everything Stephen King wrote. **Salem’s Lot** was my favorite book of his. ",
        "subreddit": "GenX",
        "url": "https://www.reddit.com/r/GenX/comments/1ngxqjd/with_the_long_walk_out_and_the_running_man_being/",
        "created_utc": 1757871889.0
    },
    {
        "id": "1oo9qte",
        "title": "When did Male Characters being Ripped(regardless of genre) become a norm in movies.",
        "selftext": "So I just recently watched The Long Walk. And among many other things one thing I really appreciated about the movie was how average everyone looked.\nOutside of McVries and Stebbins most characters were super jacked or ripped with 6% Body fat. They were just average looking guys.\n\nAnd this raised a question in my mind. When exactly did it become a norm for leading men to be super jacked or ripped in films.\n\nI remember watching older films where the Leading Men were just average looking guys. Even in movies that had action in them.\n\nSean Connery's Bond had a fairly average build. Gene Hackman's Detective character in The French Connection looked like an average Middle Aged Guy.\nHarrison Ford's Deckard had an average man build too.\n\nBut today. If you see a horror movie the main Male character is going to be ripped.\n\nYou see a Sci Fi film the main Male character is going to be ripped.\n\nYou make a Detective movie, the main 40 year old Family man detective is going to be ripped as fuck.\n\nIf it's a teen he's going to be ripped. \n\nIf it's a doctor he's going to be ripped. \n\nIf it's a lawyer he's going to be ripped.\n\nSo when did this become a norm and why?\n\nI initially thought it might have started with Arnold Schwarzenegger and Sylvester stallone who brought the jacked look to the American Hero.\n\nBut even in the era of of Schwarzenegger and Stallone you had average guy Action heroes like Bruce Willis in Die Hard, Michael Beihn in Terminator and Ford in Witness and The Fugitive.\nLet alone in non action leading roles.\n\nSo I really am confounded as to when this trend properly started where any lead character regardless of the genre or role has to be ripped. ",
        "subreddit": "movies",
        "url": "https://www.reddit.com/r/movies/comments/1oo9qte/when_did_male_characters_being_rippedregardless/",
        "created_utc": 1762269222.0
    },
    {
        "id": "1ng2hw9",
        "title": "Outburst during a showing of The Long Walk",
        "selftext": "Saw the movie last night (I think it’s a 7.5/10, but that’s not what this is about). The diarrhea scene came up, I don’t think anyone thought they’d show that in such graphic detail, so it was completely silent. Then on the second, uh, evacuation, this old black guy near me says, loud as hell:\n\n*God DAMN!*\n\nNeedless to say, I couldn’t stop laughing while watching diarrhea guy get his ticket.",
        "subreddit": "stephenking",
        "url": "https://www.reddit.com/r/stephenking/comments/1ng2hw9/outburst_during_a_showing_of_the_long_walk/",
        "created_utc": 1757782406.0
    },
    {
        "id": "1opfc6w",
        "title": "Just seen The Long Walk (2025). I loved it.",
        "selftext": "That ending fucked me up. I was not expecting to be moved like that, especially at the friendship and camaraderie, which can border at cringe when not utilised effectively as a storytelling device. It's midnight and I'm fucking crying. That was intense!!!\n\n\nFor a moment, I really enjoyed the fact that I can watch a horror film that doesn't involve using too much of my braincells. If I had one criticism, I think it's Stebbins character. He made it to 3rd place, mostly as a background character when he's clearly not, only for him to give up and end up like that. It's so underwhelming.\n\n\n\nMy favourite horror/thriller films of 2025 so far, in no particular order:\n\n• Companion\n\n\n• Weapons\n\n\n• Bring Her Back\n\n\n• The Long Walk\n\n\n• Final Destination (Bloodlines)\n\n\n• Black Mirror S7E2 (Bette Noire)\n\n\n\nand really looking forward to watch Wake Up Dead Man.\n\n\nYours?\n\n\n\n\n\nAlso, I got a question for fellow horror fans who also love walking. Do you think you'll win or make it to Top 3 when you join The Long Walk? ",
        "subreddit": "horror",
        "url": "https://www.reddit.com/r/horror/comments/1opfc6w/just_seen_the_long_walk_2025_i_loved_it/",
        "created_utc": 1762377020.0
    },
    {
        "id": "1onyia8",
        "title": "The Long Walk gets a 3/10",
        "selftext": "I’m sure everyone will be very normal about this…",
        "subreddit": "YMS",
        "url": "https://i.redd.it/clokoz8b76zf1.jpeg",
        "created_utc": 1762231603.0
    },
    {
        "id": "1kny108",
        "title": "S.K Bracket Battle 6: IT vs. The Long Walk",
        "selftext": "Salems lot beats Revival but it was tight. Personally, the long walk is my favorite. Voting closes 7PM est. tonight. So…. IT or the Long Walk? ",
        "subreddit": "stephenking",
        "url": "https://i.redd.it/7v07b7yil41f1.jpeg",
        "created_utc": 1747393338.0
    },
    {
        "id": "1npwhv0",
        "title": "I saw \"The Long Walk\" today and I got a question. Do you think that is physically possible?",
        "selftext": "I saw \" The Long Walk\" today and it should have been called \"The Long Talk\" since that is what mostly happened in the movie. But, do you think its physically possible to do what they did ? They walk about 350 miles or more, and they don't show them getting any sleep. They walk almost continuously for 5 days. How is that humanly possible? And one of them walks barefoot on the pavement for the last couple of days. I think this movie is considered Science Fiction. Cause there is no way they can do that for real. What's your opinion?",
        "subreddit": "AMCsAList",
        "url": "https://www.reddit.com/r/AMCsAList/comments/1npwhv0/i_saw_the_long_walk_today_and_i_got_a_question_do/",
        "created_utc": 1758771314.0
    },
    {
        "id": "1jp229t",
        "title": "Stephen King Movie 'The Long Walk' Sets September 12, 2025 Release",
        "selftext": "",
        "subreddit": "movies",
        "url": "https://deadline.com/2025/04/the-long-walk-stephen-king-movie-release-date-1236355714/",
        "created_utc": 1743530093.0
    },
    {
        "id": "1ni5l0b",
        "title": "Stephen King's The Long Walk Isn't A Big Box Office Hit, But It Didn't Need To Be",
        "selftext": "",
        "subreddit": "boxoffice",
        "url": "https://www.slashfilm.com/1968998/stephen-king-the-long-walk-box-office/",
        "created_utc": 1757989757.0
    },
    {
        "id": "1okepfs",
        "title": "The long walk destroyed me 😭",
        "selftext": "",
        "subreddit": "CuratedTumblr",
        "url": "https://i.redd.it/gcy5uvpqzbyf1.jpeg",
        "created_utc": 1761865850.0
    },
    {
        "id": "1ngivmz",
        "title": "I Never Thought I'd Want To NOT Watch A Film Again Until \"The Long Walk\"",
        "selftext": "If you haven't seen The Long Walk, I recommend you do. Not watch it again, not watch it thrice, not even watch it with a friend if they ask you; let them watch it on their own. By no means do I think the long walk is bad, in fact, the exact message that the film goes for is what I believe to be executed flawlessly. \n\nEvery part of the film makes you feel uneasy, even when there are moments of peace outside of the violence and general atmosphere. Unfortunately, you need to understand that there really can only be one winner, and you need to keep that in mind the entire time. In most horror films (or thrillers however, you want to describe this film), I often see the scenario and think \" yeah I could survive that\" or \" I could do that so much better,\" especially with films in the slasher genre, or to this film's closest similarity the death game genre. The Long Walk is not that. \n\nWhat really hits for me with this movie is that I myself am a younger male adult: the one who is exactly ripe for the picking as such in The Long Walk. Thinking about how myself could be in a situation such as the characters are in  is impossible. Impossible because of how real it would feel to one second be talking to a friend, even one that I just met, and in the next they fall behind and get their head blown clean off. It makes me sympathize even more with veterans, regardless of any branch of war, having to deal with this mentality and having to look around at a world outside of something so terrifying after going through what they did, it's insane.\n\nI can't say I loved The Long Walk, because I feel like a psycho for saying it. I compare it a lot to Schindler's List, in how the message and the story are communicated so well, but the content in it is violent, unfiltered, and raw, yet necessary in storytelling. The key difference here is that this is fiction, but it is so real, especially in times where it feels like something such as this can happen at any moment's notice; that I could be taken from a life that I definitely take for granted, and thrown into my own long walk, by whatever order, and have to remove any semblance of normal human ethics and just Walk.\n\n10/10, what do y'all think?",
        "subreddit": "Cinema",
        "url": "https://i.redd.it/tqoo95zdg2pf1.jpeg",
        "created_utc": 1757827747.0
    },
    {
        "id": "1nh4fjr",
        "title": "The only change in The Long Walk that really bothered me",
        "selftext": "I was not a fan of changing Garraty’s dad from being a miserable drunk who got squaded for mindlessly talking shit into a warm and caring father who introduced Ray to banned art. I think the sad state of Garraty’s dad in the book. It reflects how ground down and miserable everyone living under the fascist regime was. I also liked in the book that the reaction by other walkers that the only people who got squaded deserves it, which is something you frequently hear by citizens complacent in a fascist government. I thought the flashbacks broke the immersion of the walk a bit. All that said, I loved the movie. Just had to vent about that detail. ",
        "subreddit": "stephenking",
        "url": "https://www.reddit.com/r/stephenking/comments/1nh4fjr/the_only_change_in_the_long_walk_that_really/",
        "created_utc": 1757887678.0
    },
    {
        "id": "1naxtdr",
        "title": "The perfect Horror movie for People from Wall E",
        "selftext": "",
        "subreddit": "okbuddycinephile",
        "url": "https://i.redd.it/qsr3xdqgsrnf1.jpeg",
        "created_utc": 1757262785.0
    },
    {
        "id": "1nblvn4",
        "title": "'The Long Walk' Review Thread",
        "selftext": "I will continue to update this post as reviews come in.\n\n[**Rotten Tomatoes:**](https://www.rottentomatoes.com/m/the_long_walk_2025) Certified Fresh\n\n**Critics Consensus:** Adapting Stephen King's dystopian novel with equal parts pitilessness and heart, *The Long Walk* is a brutal slog for its characters but an exhilarating watch for audiences.\n\n|Critics|Score|**Number of Reviews**|Average Rating (Unofficial)|\n|:-|:-|:-|:-|\n|**All Critics**|90%|179|7.90/10|\n|**Top Critics**|83%|29|7.10/10|\n\n[**Metacritic:**](https://www.metacritic.com/movie/the-long-walk-2025/) 71 (31 Reviews)\n\n**Sample Reviews:**\n\nNoah Berlatsky, Chicago Reader - I appreciate the movie’s desire to take a stand and the way in which it shows how difficult it is to find a path to resistance and heroism when our narratives of resistance and heroism are so coopted.\n\nRyan Lattanzio, IndieWire - “The Long Walk” doesn’t tell you or ask you anything new if you’re feeling pent up with rage by American leadership these days, but the film’s grim commitment to the bit is a rarity for a studio movie. **B**\n\nSteve Rose, Guardian - The result comes across like a cross between a buddy movie and a horror movie -- a war movie without the war. Ultimately, it all comes down to the core relationships, so it’s just as well that Hoffman and Jonsson are both terrific. **3/5**\n\nDanny Leigh, Financial Times - We only really get to know a handful of key characters: such is the Darwinism of big-screen storytelling. But a raw candour still comes to define the movie. The bond of friendship that grows between Hoffman, Jonsson and others might sound sentimental. **4/5**\n\nRandy Myers, San Jose Mercury News - Lawrence has a knack for navigating his way through deadly contests, but here he uses bolder directorial brush strokes to stimulate a conversation starter full of layers. **3.5/4**\n\nRichard Whittaker, Austin Chronicle - Unlike Chuck, the protagonists of The Long Walk may not contain multitudes. Yet in becoming part of a multitude they, like the film, become great. **4/5**\n\nJake Wilson, Sydney Morning Herald - Still, for a large-scale Hollywood production The Long Walk is remarkably uncompromised – and whatever may have changed since the 1960s – its allegorical vision of a game set up to be all but unwinnable feels all too likely to resonate with kids today. **3.5/5**\n\nJeannette Catsoulis, New York Times - For a movie about motion, “The Long Walk” feels oddly static, its washed-out images — a dead cow here, some live horses there — leaving the impression of a featureless nowhereland.\n\nMeagan Navarro, Bloody Disgusting - Despite an unwavering eye on the dour and ruthless death march and all its grotesqueries, it’s the pervading camaraderie and heart, as well as a tremendous cast, that solidifies this as one of the best King adaptations yet. **4/5**\n\nClint Worthington, [RogerEbert.com](http://RogerEbert.com) \\- But the spectacle of inevitable violence remains haunting regardless, especially as we watch these kids, resigned to their fate, try to go out with as much of their humanity intact as possible. **3/4**\n\nMichael Ordoña, San Francisco Chronicle - “The Long Walk” is a heartfelt metaphorical drama about people bonding under duress. Instead of focusing on the darker side of human nature one might expect from the average dystopian film, it finds power in small acts of connection. **2.5/4**\n\nDavid Jenkins, Little White Lies - In a crowded field for these types of stories, The Long Walk is happy to keep pace in the middle of the pack before puttering out a little way from the finishing line. **2/5**\n\nAdam Graham, Detroit News - The cast is consistently compelling, especially Jonsson, who, along with Hoffman, lends a human core to this unforgiving exercise. **B**\n\nLinda Marric, HeyUGuys - Bleak, unflinching, and unexpectedly moving, The Long Walk is both a faithful King adaptation and one of the most harrowing cinematic experiences in years. Not for the faint of heart — but easily one of the best films of 2025 so far. **4/5**\n\nJacob Oller, AV Club - As bloody and upsetting as King’s fable can get, at its heart, it’s a 100-minute walk-and-talk between some of the best young actors out there, trying to stay sane while trudging through a trenchant metaphor. **B**\n\nMeredith G. White, Arizona Republic - Lawrence isn't preachy in his attempt to make this film an emotional gut-punch. He lets the dialogue speak for itself and the simplicity of the environment, the camera angles, even the hair, makeup and costumes are there to enhance, not distract. **4.5/5**\n\nFrank Scheck, The Hollywood Reporter - While The Long Walk doesn’t entirely escape its narrative limitations, it features generous amounts of the sort of emotion and heart that have marked the best King adaptations. Of course, that doesn’t make it any less grueling.\n\nJustin Clark, Slant Magazine - This ferocious adaptation of Stephen King’s 1979 novella as a passion play about class solidarity. **3/4**\n\nJamie Graham, Empire Magazine - Screenwriter JT Mollner has made some bold changes to the source material, but neither sanitises or dilutes. **4/5**\n\nPerri Nemiroff, Perri Nemiroff (YouTube) - One of the things I found most remarkable about the movie is how it still manages to be soulful and have its heart firmly in the best possible place while wading into the darkness. **4.5/5**\n\nAlison Willmore, New York Magazine/Vulture - I'd describe it as Lord of the Flies on foot, but it's really more like The Hunger Games for dudes (complimentary).\n\nLiz Shannon Miller, Consequence - The Long Walk offers a gripping premise, a lot of characters who feel more like loose sketches than fully-realized personalities, and a narrative that maybe has some minor pacing problems towards the end, but is pretty impossible to turn away from. **B**\n\n**SYNOPSIS:**\n\nFrom the highly anticipated adaptation of master storyteller Stephen King’s first-written novel, and Francis Lawrence, the visionary director of The Hunger Games franchise films (Catching Fire, Mockingjay – Pts. 1 &amp; 2, and The Ballad of Songbirds &amp; Snakes), comes THE LONG WALK, an intense, chilling, and emotional thriller that challenges audiences to confront a haunting question: how far could you go?\n\n**CAST:**\n\n* Cooper Hoffman as Raymond Garraty\n* David Jonsson as Peter McVries\n* Garrett Wareing as Stebbins\n* Tut Nyuot as Arthur Baker\n* Charlie Plummer as Gary Barkovitch\n* Ben Wang as Hank Olson\n* Roman Griffin Davis as Thomas Curley\n* Jordan Gonzalez as Richard Harkness\n* Joshua Odjick as Collie Parker\n* Josh Hamilton as Mr. Garraty\n* Judy Greer as Mrs. Garraty\n* Mark Hamill as The Major\n\n**DIRECTED BY:** Francis Lawrence\n\n**SCREENPLAY BY:** JT Mollner\n\n**BASED ON THE NOVEL BY:** Stephen King\n\n**PRODUCED BY:** Roy Lee, Steven Schneider, Francis Lawrence, Cameron MacConomy\n\n**EXECUTIVE PRODUCERS:** Andrew Childs, K. Blaine Johnston, Stephen King, Mika Saito, Christopher Woodrow\n\n**DIRECTOR OF PHOTOGRAPHY:** Jo Willems\n\n**PRODUCTION DESIGNER:** Nicolas Lepage\n\n**EDITED BY:** Peggy Eghbalian, Mark Yoshikawa\n\n**COSTUME DESIGNER:** Heather Neale\n\n**MUSIC BY:** Jeremiah Fraites\n\n**CASTING BY:** Rich Delia\n\n**RUNTIME:** 108 Minutes\n\n**RELEASE DATE:** September 12. 2025",
        "subreddit": "boxoffice",
        "url": "https://www.reddit.com/r/boxoffice/comments/1nblvn4/the_long_walk_review_thread/",
        "created_utc": 1757333077.0
    },
    {
        "id": "1nekeg4",
        "title": "Hi /r/movies, I'm Garrett Wareing, actor in Lionsgate's THE LONG WALK from legendary author Stephen King and director Francis Lawrence (CONSTANTINE, THE HUNGER GAMES). It's out in theaters today. Ask me anything!",
        "selftext": "Hi r/movies, I'm Garrett Wareing, actor in Lionsgate's THE LONG WALK from legendary author Stephen King and director Francis Lawrence (CONSTANTINE, THE HUNGER GAMES). It's out in theaters today and also stars Cooper Hoffman, David Jonsson, Charlie Plummer, Ben Wang, Mark Hamill, and Judy Greer.  \n\nYou might also know me from things like Manifest, God Is A Bullet, Ransom Canyon, and Pretty Little Liars: The Perfectionists. Here to answer your questions!\n\nTrailer: \n\n[https://www.youtube.com/watch?v=vAtUHeMQ1F8](https://www.youtube.com/watch?v=vAtUHeMQ1F8)\n\nSynopsis:\n\nFrom the highly anticipated adaptation of master storyteller Stephen King’s first-written novel, and Francis Lawrence, the visionary director of The Hunger Games franchise films (Catching Fire, Mockingjay – Pts. 1 &amp; 2 , and The Ballad of Songbirds &amp; Snakes), comes THE LONG WALK, an intense, chilling, and emotional thriller that challenges audiences to confront a haunting question: how far could you go?\n\nOut in theaters today.\n\nAsk me anything! Back tomorrow Friday 9/12 at 12:00 PM ET to answer your questions.",
        "subreddit": "movies",
        "url": "https://i.redd.it/wyz6nv6bmlof1.png",
        "created_utc": 1757624252.0
    },
    {
        "id": "1kiiib4",
        "title": "The Long Walk",
        "selftext": "Hello fellow snow enthusiasts \n\nA while back I purchased a treadmill for rehabilitation and return to somewhat fitness.\n\nWell recently I thought instead of just watching shows why not do something different.\n\nSo I hatched the idea to walk through all the regions of my favorite survival game and visit some of the scenic locations. \n\nFor the sake of not having to be interrupted by wildlife or struggling with the regular harsh conditions I created a custom setting game save with passive wild life, reduced hunger/thirst/fatigue and set the day cycle to 4x longer.\n\nEssentially turned it into a walking sim but that's the idea \n\nAnd I thought it might be interesting to share \n\nI originally wanted to do it as a whole but seeing that by the end of the first week the video, almost unrecognizable at 60x speed, was already quite large for Reddit \n\nThat being said this is what that week of 20-30 min a day looks like.\n\nMaybe I'll share weekly updates \n\n\n\n",
        "subreddit": "thelongdark",
        "url": "https://v.redd.it/phnr9d6rarze1",
        "created_utc": 1746797344.0
    },
    {
        "id": "1ec67au",
        "title": "'The Long Walk' Movie Adds Judy Greer &amp; Mark Hamill",
        "selftext": "",
        "subreddit": "stephenking",
        "url": "https://deadline.com/2024/07/the-long-walk-movie-adds-judy-greer-mark-hamill-1236022070/",
        "created_utc": 1721942031.0
    },
    {
        "id": "1nhxvhq",
        "title": "The Long Walk confirmed to have Alternate Ending in the home release.",
        "selftext": "Very much hoping there is a way to watch this edited into the movie as an alternate cut (much like I Am Legend). ",
        "subreddit": "stephenking",
        "url": "https://i.redd.it/4zdy1kmf6epf1.jpeg",
        "created_utc": 1757969682.0
    },
    {
        "id": "1kx0m7m",
        "title": "Having not been able to fly home with the rest of the squad Dejan has finally completed the long walk home from Bilbao",
        "selftext": "",
        "subreddit": "coys",
        "url": "https://i.redd.it/j0mwsag3ge3f1.jpeg",
        "created_utc": 1748384275.0
    },
    {
        "id": "1n3a37s",
        "title": "Favorite Films that Discriminate Against Redditors?",
        "selftext": "",
        "subreddit": "okbuddycinephile",
        "url": "https://i.redd.it/jkv34oms5zlf1.jpeg",
        "created_utc": 1756480330.0
    },
    {
        "id": "1myw0pv",
        "title": "Favorite subreddit that caters to visitors of Epstein's island?",
        "selftext": "",
        "subreddit": "okbuddycinephile",
        "url": "https://i.redd.it/i1lrtpbz1zkf1.png",
        "created_utc": 1756043191.0
    },
    {
        "id": "1mekjt8",
        "title": "I hope “The Long Walk” keeps the novel's ending",
        "selftext": "[MAJOR SPOILERS for those who haven’t read “The Long Walk By Stephen King”\n\n\n\n\n&gt;!To those of you who’ve read the novel, Garraty is the last one left. Instead of a triumphant celebration, the ending sees Garraty continuing to walk, despite a broken ankle, declaring \"There's still so far to walk. It seemed to imply that he was detached from reality, and was simply walking because he was traumatized and has lost his sanity.!&lt;\n\nIt was a really dark and bleak ending. One that I really hope stays in the movie adaptation. Hopefully they don’t wuss out and and play it safe by having a more \nupbeat ending.",
        "subreddit": "stephenking",
        "url": "https://www.reddit.com/r/stephenking/comments/1mekjt8/i_hope_the_long_walk_keeps_the_novels_ending/",
        "created_utc": 1754014738.0
    },
    {
        "id": "1n2pc15",
        "title": "I just read the long walk and genuinly f*cking cried",
        "selftext": "The reason all of this is so horrible,” McVries said, “is because it’s just trivial. We’ve sold ourselves and traded our souls on trivialities.” \n\ni can't even begin to explain how f*cking awesome this book is. \n\nfrom the complex fleshed out characters (that i was genuinly attached to), to the real life implications and layered meanings (intentional or not), to how actually terrifying it is. The premise sounds exciting enough, but when you actually get to read it and experience every single detail, it never leaves you. like seriously this book dives into every little thing that could go wrong in a long walk and its just staggaring how accurate and likely to happen it is, from charley horse, pneumonia, to f*cking appendicitis.\n\nI was specifically terrified by the crowd—their cold-blooded hunger for death, the way they thrived on suspense at the cost of human lives. It felt horrifyingly accurate.\n\nThis book made me reflect on life itself: how we are responsible for our own choices, how fragile we are, how insanity creeps in slowly. I grew so attached to the characters that every shot fired left me holding my breath, praying it wasn’t one of the main characters \n\nWhat I didn’t like was the unnecessary sexualization. Garraty’s constant fantasies cheapened the story, reducing humans to instinct when the book’s core is about sheer willpower—the complete opposite. Edit: someone commented that that was somehow relevant to the story, how its just natural for a 16 year old to think like that (read their comment) and i agree tbh so yeah.\n\nThis isn’t ghosts-and-monsters horror; it’s a brutal, relatable kind of horror. The idea that death can come from something as trivial as a cramp or a fever is terrifying. Even the humiliation of basic needs, being vulnerable in front of others, cut deep.\n\nIdk i just loved it. My second favorite king book after the stand, still i have alot to go..\n",
        "subreddit": "stephenking",
        "url": "https://www.reddit.com/r/stephenking/comments/1n2pc15/i_just_read_the_long_walk_and_genuinly_fcking/",
        "created_utc": 1756417688.0
    },
    {
        "id": "ne18jr",
        "title": "The Long Walk by Stephen King",
        "selftext": "I just finished this book. Its the first King novel I've read and I really enjoyed it. The story never got boring to me since King always brought up interesting concepts and unexpected dialogue that got under my skin. The story was told so well my legs started to feel tired even though I was sitting down reading. I think I could have done at least 24 hours of walking, but gosh what a torturous journey. I can't wait to read more from him, I already have several of his books waiting to be read!",
        "subreddit": "books",
        "url": "https://www.reddit.com/r/books/comments/ne18jr/the_long_walk_by_stephen_king/",
        "created_utc": 1621208592.0
    },
    {
        "id": "1ngaf5f",
        "title": "The Long Walk,now in theaters",
        "selftext": "",
        "subreddit": "stephenking",
        "url": "https://i.redd.it/8udfffnhb0pf1.jpeg",
        "created_utc": 1757801892.0
    },
    {
        "id": "1kg5wgh",
        "title": "First Look at Stephen King’s The Long Walk: The Dystopian Coming-of-Age Story He Considered Too “Merciless” to Film",
        "selftext": "",
        "subreddit": "stephenking",
        "url": "https://www.vanityfair.com/hollywood/story/first-look-at-stephen-king-the-long-walk",
        "created_utc": 1746541753.0
    },
    {
        "id": "1nf9t0b",
        "title": "Did anyone else not like the long walk?",
        "selftext": "I feel crazy because it has great reviews but it fell flat for me. Preface: I haven’t read the book (I plan on reading it soon). The main problem I had with the movie is that I didn’t understand why the boys would do this. Obviously it’s in the US where a war has taken place and the country is going through economic hardship. I just wish we would’ve had some more backstory on how dire things have gotten where capable young men are willing to do this. In the hunger games we at least get a little bit of context of the world. From the trailer, I had assumed that maybe the boys didn’t know they would get shot they would just get sent home. But in the movie it’s clear they know what happens if they fail. I also felt the middle got a bit boring as well. I don’t know did I just not get it?",
        "subreddit": "horror",
        "url": "https://www.reddit.com/r/horror/comments/1nf9t0b/did_anyone_else_not_like_the_long_walk/",
        "created_utc": 1757699175.0
    },
    {
        "id": "1kja1b9",
        "title": "The long walk",
        "selftext": "😂😂",
        "subreddit": "stephenking",
        "url": "https://i.redd.it/pkpbyoxpfyze1.jpeg",
        "created_utc": 1746882893.0
    },
    {
        "id": "1onr7l3",
        "title": "Lionsgate’s The Long Walk has ended it’s domestic run with $35,163,573",
        "selftext": "",
        "subreddit": "boxoffice",
        "url": "https://www.the-numbers.com/movie/Long-Walk-The-(2025)#tab=summary",
        "created_utc": 1762211333.0
    },
    {
        "id": "1bv2xfz",
        "title": "He was always the best boy. Enjoy the long walk mate. ",
        "selftext": "",
        "subreddit": "DOG",
        "url": "https://i.redd.it/tfmtoljynbsc1.jpeg",
        "created_utc": 1712175210.0
    }
]