[
    {
        "id": "1p2njr5",
        "title": "Official Discussion - Wicked: For Good [SPOILERS]",
        "selftext": "#Poll\n\n**If you've seen the film, please rate it [at this poll](https://strawpoll.ai/poll/vote/D7gOv7zhZChi)**\n\n**If you haven't seen the film but would like to see the result of the poll [click here](https://strawpoll.ai/poll/results/D7gOv7zhZChi)**\n\n#Rankings\n\n[Click here](https://strawpoll.ai/list/ItnAgr4mX7QR) to see the rankings of 2025 films\n\n[Click here](https://youpoll.me/list/4/) to see the rankings for every poll done\n\n---\n\n**Summary**\nElphaba, now the Wicked Witch of the West, lives in exile in the forest while continuing her fight for the freedom of Oz’s silenced Animals. Glinda, now the symbol of Good and a glamorous icon, is torn between her public persona and her complicated past with Elphaba. As political unrest rises, the two must finally confront each other and their own truths to reshape the future of Oz.\n\n**Director**\nJon M. Chu\n\n**Writers**\nWinnie Holzman, Dana Fox\n\n**Cast**\n\n* Cynthia Erivo as Elphaba\n* Ariana Grande as Glinda\n* Jonathan Bailey as Fiyero\n* Jeff Goldblum as the Wizard of Oz\n* Michelle Yeoh as Madame Morrible\n* Marissa Bode as Nessarose\n* Ethan Slater as Boq\n\n**Rotten Tomatoes:** [69%](https://www.rottentomatoes.com/m/wicked_for_good)\n\n**Metacritic:** [60](https://www.metacritic.com/movie/wicked-for-good/)\n\n**VOD / Release**\nIn theaters November 21, 2025 \n\n**Trailer**\n[Watch here](https://www.youtube.com/watch?v=R2Xubj7lazE)\n\n---",
        "subreddit": "movies",
        "url": "https://www.reddit.com/r/movies/comments/1p2njr5/official_discussion_wicked_for_good_spoilers/",
        "created_utc": 1763694387.0,
        "num_comments": 2671,
        "ups": 399,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1p0h8vy",
        "title": "'Wicked: For Good' - Review Thread",
        "selftext": "*Now demonized as the Wicked Witch of the West, Elphaba lives in exile in the Ozian forest, while Glinda resides at the palace in Emerald City, reveling in the perks of fame and popularity. As an angry mob rises against the Wicked Witch, she'll need to reunite with Glinda to transform herself, and all of Oz, for good.*\n\nDirector: John M. Chu\n\nCast: Cynthia Erivo, Ariana Grande, , Jonathan Bailey, Ethan Slater, Marissa Bode, Jeff Goldblum, Michelle Yeoh, Colman Domingo, Peter Dinklage, Bowen Yang\n\n**Rotten Tomatoes:** [72%](https://www.rottentomatoes.com/m/wicked_for_good)\n\n**Metacritic:** [61 / 100](https://www.metacritic.com/movie/wicked-for-good/)\n\nSome Reviews:\n\n[Next Best Picture - Lauren LaMagna](https://nextbestpicture.com/wicked-for-good/) \\- 7 / 10\n\n&gt;The cast, led by the phenomenal Cynthia Erivo and Ariana Grande, still deliver fantastic work that is supported by excellent crafts from all departments of production. But the source material is inherently weaker than the first, making this a less fulfilling entry as a standalone, even if it compliments Part One as a whole. The additional scenes are not necessary and only exist for the material to be long enough to qualify its own feature film, which also results in pacing issues.\n\n[BBC - Caryn James](https://www.bbc.com/culture/article/20251118-wicked-for-good-review) \\- 4 / 5\n\n&gt;Let's be clear: the Wicked films are the definition of preaching to the choir. They aren't likely to win over anyone sceptical of candy-coloured spectacle and overt sentimentality presented in Broadway show-stopping fashion. Wicked is what it is. But if you're fine with that, this latest instalment is more captivating than the last and enjoyable to watch throughout.\n\n[DEADLINE - Pete Hammond](https://deadline.com/2025/11/wicked-for-good-review-jon-chus-part-2-musical-adaptation-1236620980/)\n\n&gt;What can we say about the performances that hasn’t already been said? Both Erivo and Grande could not be better, and in fact Grande really gets a chance to shine here and runs away with the picture whenever she is on screen. Erivo’s Elphaba remains the juiciest role and she defines it with the mortality only movies can bring. Bailey is terrific again, and Goldblum’s Wizard really comes into deep focus now and he’s got it going on. Marissa Bode’s wheelchair-bound Nessarose is given some key screen time and delivers in a piece of casting that is as inspiring as the character she plays. Nathan Crowley outdoes his Oscar winning production design this time around, as does Paul Tazewell’s Oscared Costumes. The visual effects are first rate. So is this whole splendidly realized and cinematic musical adaptation which if you add up the running times of both films comes in just two minutes shy of 5(!) hours. To be honest I wanted *more.*\n\n[The Telegraph - Robbie Collin](https://www.telegraph.co.uk/films/2025/11/18/wicked-for-good-review-second-part-fails-to-take-flight/) \\- 1 / 5\n\n&gt;Ariana Grande is painfully wooden in Wicked’s irritating sequel. What makes it so frustrating is that director Jon M Chu is an established musicals master; his In the Heights is a modern classic of the form. But the corporate stretch-it-out-and-wring-it-dry approach here has been deadening. Even the staunchest defenders of Wicked, the stage musical about the tragic origins of The Wizard of Oz’s Witch of the West, would have to concede that it peaks just before the interval...\n\n[Slant Magazine - Dan Rubins](https://www.slantmagazine.com/film/wicked-for-good-review-cynthia-erivo-ariana-grande-jonathan-bailey/) \\- 2.5 / 5\n\n&gt;But for as sharp as it may sometimes be, *For Good* is stretched out, breathless, and never really emotionally affecting, even on the level of nostalgia. (However bloated, the first film, to quote one of Glinda’s malapropisms, is thrillifying.) It may transport audiences, especially younger ones, to the colorful Oz for the bulk of an afternoon, but it also serves as a reminder that only in its tauter, wrenching stage form can *Wicked*, like a handprint on your heart, really leave you changed for good.\n\n[Loud and Clear - Joseph Tomastik](https://loudandclearreviews.com/wicked-for-good-film-review/)\n\n&gt;*Wicked: For Good* takes many huge swings but misses in baffling fashion, making for a technically impressive but disappointing conclusion to the *Wicked* story. By all accounts, this is the much more difficult half of the story to pull off, as it’s where the musical in particular gets much denser and incorporates many more direct elements from *The Wizard of Oz*. Unfortunately, that difficulty rears its ugly head in *Wicked: For Good*. As ambitious as this movie is for tackling already-unwieldy source material, those ambitions ultimately don’t pay off.\n\n[RogerEbert - Christy Lemire](https://www.rogerebert.com/reviews/wicked-2-for-good-film-review-2025) \\- 3 / 4\n\n&gt;If it sounds like this second half is darker than the first, it is, but it’s also more effective in its consistency of tone. “Wicked” was all fun and games until it wasn’t, and that sudden shift was jarring. In “For Good,” we know from the start that we’re in more serious territory with the deep strings of John Powell’s score as Ozian workers build the Yellow Brick Road. Erivo and Grande find just the right amount of tenderness and sadness with “For Good,” and that bond between them shines bright once more. Poignant and intimate, it’s a legitimate tearjerker. Bring tissues. \n\n[AwardsWatch - Sophia Ciminello](https://awardswatch.com/wicked-for-good-review-jon-m-chu-fails-to-cast-a-spell-with-bloated-fan-service-filled-finale-c/) \\- 'C-'\n\n&gt;Despite stellar work from Erivo and Grande, *Wicked: For Good* can’t justify its existence as its own separate outing. Even with a pair of new songs and a deeper exploration of some of the musical’s beloved characters, the runtime feels bloated and bogged down by Chu’s constant attempts to make this a movie of the moment and to remind audiences of the connection they had to the first film. Simply put, Chu does not add enough new material to make this film feel like much more than a studio cash grab. There’s certainly still magic to be found in the movie for those who are seeking it, but when the credits finally roll, it’s difficult to say that Chu’s additions to this film have changed the world of *Wicked* for the better.\n\n[The Guardian - Peter Bradshaw](https://www.theguardian.com/film/2025/nov/18/wicked-for-good-review-cynthia-erivo-ariana-grande-jeff-goldblum) \\- 4 / 5\n\n&gt;It’s tangled and a bit bewildering; but then so is the original film, in which we never know whether to believe in the Wizard’s final benediction. But what a performance from Erivo; it is genuinely moving when the Prince has to convince Elphaba what we, the audience, have always known: that she is beautiful.\n\n[FilmHounds - Paul Klein](https://filmhounds.co.uk/2025/11/wicked-for-good-film-review/)\n\n&gt;Erivo, Grande and Bailey are all fantastic once again, and allowed to deepen the characters more and show the complexities of them, while also remaining true to why people love them so much. It's a shame that the rest of the cast are given short shrift. Ethan Slater and Marissa Bode have the rumblings of a more interesting subplot that doesn't really go anywhere as much as it should. Even so, and despite its more frantic nature, *Wicked: For Good* continues to lovingly taking a look at what it means to be a rebel against dictatorships, how people will lie to you to get what they want, and how you must remain true to yourself at all times. It's not so much that the film is disappointing, that would be too harsh a criticism. It's that the film is merely as good as it could be, given what the stage show offers. It wraps things up, but there's no feeling of cohesion – something that was never going to be in Chu's hands, and for what he has, he excels at.\n\n[Independent - Clarisse Loughrey](https://www.the-independent.com/arts-entertainment/films/reviews/wicked-for-good-review-sequel-b2866672.html) \\- 2 / 5\n\n&gt;For Good has little sense of movement, literally or emotionally – no profound revelations, no wonder or spectacle. All that’s to be done now is for each character to process, via standardised ballad, what they’ve learned.",
        "subreddit": "movies",
        "url": "https://www.reddit.com/r/movies/comments/1p0h8vy/wicked_for_good_review_thread/",
        "created_utc": 1763485052.0,
        "num_comments": 685,
        "ups": 1225,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1p1t4cm",
        "title": "Just saw Wicked: For Good…",
        "selftext": "Let’s chat about it:\n\nI loved the new songs. Loved Ethan and Marissa’s scenes. Loved the flashbacks and callbacks. Loved the ending.\n\nHowever… some parts felt rushed. I missed some parts and lines due to this. How many kinds of animals were there?!?\n\nDr. D…. Man I missed him. Jeff Goldblum is goofy as always and Michelle was perfect.\n\nI’m open to chatting more about it! Thanks in advance!",
        "subreddit": "wicked",
        "url": "https://www.reddit.com/r/wicked/comments/1p1t4cm/just_saw_wicked_for_good/",
        "created_utc": 1763610505.0,
        "num_comments": 308,
        "ups": 210,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1ozvd7d",
        "title": "Official Discussion Thread - Wicked: For Good [SPOILERS]",
        "selftext": "Keep all discussion related solely to Wicked: For Good and it's awards chances in this thread. Spoilers below.\n\n**Synopsis:**\n\n&gt;As an angry mob rises against the Wicked Witch, Glinda and Elphaba will need to come together one final time. With their singular friendship now the fulcrum of their futures, they will need to truly see each other, with honesty and empathy, if they are to change themselves, and all of Oz, for good.\n\n**Director:** Jon M. Chu\n\n**Writers:** Winnie Holzman, Dana Fox\n\n**Cast:**\n\n* Cynthia Erivo as Elphaba Thropp\n* Ariana Grande as Glinda Upland\n* Jonathan Bailey as Fiyero Tigelaar\n* Jeff Goldblum as the Wonderful Wizard of Oz\n* Marissa Bode as Nessarose Thropp\n* Ethan Slater as Boq Woodsman\n* Michelle Yeoh as Madame Morrible\n* Peter Dinklage as the voice of Doctor Dillamond\n* Bowen Yang as Pfannee\n* Bronwyn James as ShenShen\n* Sharon D. Clarke as the voice of Dulcibear\n* Colman Domingo as the voice of Brrr the Cowardly Lion\n\n**Rotten Tomatoes:** [71%, 92 reviews](https://www.rottentomatoes.com/m/wicked_for_good)\n\n**Metacritic:** [61, 38 reviews](https://www.metacritic.com/movie/wicked-for-good/)\n\n**Consensus:**\n\n&gt;",
        "subreddit": "oscarrace",
        "url": "https://www.reddit.com/r/oscarrace/comments/1ozvd7d/official_discussion_thread_wicked_for_good/",
        "created_utc": 1763420495.0,
        "num_comments": 479,
        "ups": 74,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1p0nax5",
        "title": "Was Wicked: For Good filmed before Wicked? I have seen comments on how Ariana’s operatic voice isn’t as strong in the second half as compared to the first.",
        "selftext": "This isn’t my opinion as I haven’t seen it yet, but I recall reading that Wicked: For Good was filmed first (the photo in my post is from For Good and it was one of the first photos shared by Ariana in early 2023), and Wicked second. So maybe that explains it? ",
        "subreddit": "wickedmovie",
        "url": "https://i.redd.it/1rmqyb5mu22g1.jpeg",
        "created_utc": 1763498556.0,
        "num_comments": 168,
        "ups": 1305,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1oz7yqn",
        "title": "\"Wicked: For Good\" early reactions don't look good from Critics Choice members.",
        "selftext": "",
        "subreddit": "Oscars",
        "url": "https://www.reddit.com/gallery/1oz7yqn",
        "created_utc": 1763356885.0,
        "num_comments": 335,
        "ups": 228,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1ozznxj",
        "title": "To the people who have already seen the movie… (Don’t read if you don’t want major spoilers)",
        "selftext": "For the people who already watched Wicked: For Good, this is a safe space to spoiler the movie.\n\nI just need to know, please:\n\n1. does it end up the same way as the theatre version or does it change?\n\n2. Is there a bonus scene after the credits?\n\n3. What’s the thing that changed the most compared to the theater version?\n\n4. Jon M Chu said he didn’t want the movie ending up with Glinda and Ariana belting out For Good, so what’s the added finale?\n\n5. How much is Dorothy involved in the story?\n\n6. Lastly, is there anything that could make us think that Glinda knows?\n\n\nFeel free to give any spoiler here, I tagged everything as spoiler. I just want spoilers cause I really don’t care, they don’t ruin the movie for me. If anything, they make me less anxious.",
        "subreddit": "wickedmovie",
        "url": "https://www.reddit.com/r/wickedmovie/comments/1ozznxj/to_the_people_who_have_already_seen_the_movie/",
        "created_utc": 1763431762.0,
        "num_comments": 63,
        "ups": 81,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1p11g5c",
        "title": "I’m probably gonna get downvoted but I did NOT like Wicked : for good",
        "selftext": "I feel like I’m asking to get flagged for this, but I genuinely did not like Wicked Part 2, and it’s not because of the acting, or the singing, or the production.\n\n In fact, let me be very clear:\nEverything technical about the movie is stunning.\nThe cinematography? Beautiful.\nThe music? Gorgeous.\nThe cast? They need Oscars ASAP.\nThe vocals, the staging, the worldbuilding visuals? All top-tier.\n\nAnd I’m saying this as someone who is obsessed with Wicked Part 1, like, Part 1 is my favorite movie ever. It was the first film I watched in theaters, I’ve rewatched it a ridiculous number of times, and it still makes me cry. Part 1 is magical, emotional, tightly written, and incredibly satisfying.\n\nWicked-: For good is the opposite.\nNot because of the performances.\nNot because of the production.\nBut because the story is jus bad. I’m sorry, but it is, and I don’t even think this is a super unpopular opinion, especially among people who are new to Wicked.\n\nThe Wizard of Oz shoehorning is painful,the constant need to align with Wizard of Oz plot points drags the story down. Part 1 stands on its own, it’s fresh, it has a clear emotional arc, and Elphaba’s journey feels powerful. Part 2 suddenly becomes a checklist of references, and it feels forced, messy, and anticlimactic.\n\nEvery character arc feels unsatisfying, \nIn Part 1, you see Elphaba rise, fail, learn, sacrifice, and evolve. You want her to become this powerful leader, maybe a protector of Animals, maybe a revolutionary, the potential is huge.\nIn Part 2, everything collapses into nothing.\n• Elphaba never gets a moment of true strategic power.\n• Fiyero’s fate feels tragic for no meaningful reason.\n• Glinda becomes the “pretty face” leader in a way that makes sense narratively but still feels hollow.\n• The Wizard storyline is just frustrating, not compelling, and his ending is pure shit .\n\nAnd yes, I get the realism: No good deed goes unpunished, but there’s a difference between “realistic tragedy” and “emotionally unsatisfying storytelling,” and Part 2 falls into the latter.\n\nElphaba’s choices make no sense, she has more magical ability than literally anyone in Oz, and this is what she accomplishes? She has no tact, no long game, no attempt at political maneuvering. She keeps sabotaging herself by being emotional in situations where she needed to be strategic.\n\nHonestly, Glinda’s whole “play nice in public, do the real shit behind the scenes” approach would’ve served Elphaba better, but instead, Elphaba jumps straight into maximum-chaos mode and then wonders why it goes badly.\n\nAlso, the magic lore feels contradictory, Elphaba is the only one with “real” magic but Madame Morrible also has magic and Nessa can read the Grimmerie. sometimes the words are sacred only for Elphaba but also not and at the end it's implied thst glinda now can do magic, it’s just confusing. I know this isn’t the film’s fault because it’s adapting the musical, but the inconsistencies feel more obvious in a movie.\n\nI just don’t get it, why does the Wizard get to escape? Madam Morrible was literally his lackey. They were both terrible, sure, but he was the architect of everything: the lies, the frauds, the prejudice, the entire machinery of Anima. He’s the one who set it all in motion. Yet somehow she gets jailed while he just slips away into the shadows? It’s pathetic, honestly. If she deserved punishment, then he deserved it ten times over. He was the main force; she was just the obedient hand carrying out his rot. The ending feels weak because it lets the real villain walk.\n\nBôq’s story was fine, The Tin Man arc was the one part of Part 2 that felt coherent. His motivations made sense. His resentment made sense. It tracks emotionally, even without Wizard of Oz connections.\n\nEverything else? Messy.\n\nPart 1 stands as one of the best musicals/films ever made. It’s tight, emotional, dramatic, meaningful, visually stunning, musically perfect. You could build an entire expanded universe off the tone and direction of Part 1 ( think dune or star wars for the girls and the gays)\n\nPart 2, for all its visual and musical excellence, still has a story that feels weak, rushed, and frustrating. It’s not the movie’s fault; it’s the source material, but it still left me disappointed.\nI wanted to love it.\n\nI love everything else around it.\nBut the story? The story killed it for me.\n  \n\nEdit: the downvotes are pouring in 😅, people who Agree in the comnent should upvote atleast ",
        "subreddit": "wicked",
        "url": "https://www.reddit.com/r/wicked/comments/1p11g5c/im_probably_gonna_get_downvoted_but_i_did_not/",
        "created_utc": 1763538314.0,
        "num_comments": 111,
        "ups": 228,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1ovzjnv",
        "title": "Cynthia Erivo protects Ariana Grande from a ‘Wicked: For Good’ premiere attendee in Singapore (November 13, 2025)",
        "selftext": "",
        "subreddit": "popculturechat",
        "url": "https://v.redd.it/54wi3ehtn01g1",
        "created_utc": 1763036209.0,
        "num_comments": 1238,
        "ups": 21749,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1ow2p8g",
        "title": "Male fan jumps the barricade to run up to Ariana Grande at the “Wicked: For Good” yellow carpet in Singapore",
        "selftext": "",
        "subreddit": "Fauxmoi",
        "url": "https://v.redd.it/1ijixaupc11g1",
        "created_utc": 1763044602.0,
        "num_comments": 1253,
        "ups": 13653,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1p4n3ry",
        "title": "Man Arrested After Grabbing Ariana Grande At Wicked For Good Movie Premiere",
        "selftext": "",
        "subreddit": "okbuddycinephile",
        "url": "https://i.redd.it/pzldvtyvg03g1.png",
        "created_utc": 1763905577.0,
        "num_comments": 689,
        "ups": 20931,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1p2af56",
        "title": "Ariana Grande Tests Positive for Covid After ‘Wicked: For Good’ Press Tour",
        "selftext": "",
        "subreddit": "entertainment",
        "url": "https://variety.com/2025/film/news/ariana-grande-covid-wicked-2-press-tour-1236586932/",
        "created_utc": 1763662379.0,
        "num_comments": 900,
        "ups": 5953,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1p5nezy",
        "title": "\"Wicked: For Good\" (2025) was decent, but I kinda want a movie spinoff from this character's point of view",
        "selftext": "",
        "subreddit": "shittymoviedetails",
        "url": "https://i.redd.it/eeg73g0dq83g1.jpeg",
        "created_utc": 1764005615.0,
        "num_comments": 348,
        "ups": 12871,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1ozx77a",
        "title": "Bob the Drag Queen attends the \"Wicked: For Good!\" New York Premiere",
        "selftext": "",
        "subreddit": "rupaulsdragrace",
        "url": "https://www.reddit.com/gallery/1ozx77a",
        "created_utc": 1763425127.0,
        "num_comments": 536,
        "ups": 5949,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1owxdtz",
        "title": "Ariana Grande fan charged after grabbing actress at Wicked: For Good premiere",
        "selftext": "",
        "subreddit": "Music",
        "url": "https://www.themirror.com/entertainment/celebrity-news/ariana-grande-fan-charged-wicked-1505124",
        "created_utc": 1763129149.0,
        "num_comments": 439,
        "ups": 5216,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1ow0o9r",
        "title": "Cynthia Erivo protects Ariana Grande from a fan running onto the carpet at the wicked for good premier",
        "selftext": "",
        "subreddit": "PublicFreakout",
        "url": "https://v.redd.it/974v80aix01g1",
        "created_utc": 1763039469.0,
        "num_comments": 239,
        "ups": 8505,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1ow6uve",
        "title": "And we thought the wicked for good press tour was going to be less chaotic",
        "selftext": "She PROTECTS",
        "subreddit": "wicked",
        "url": "https://www.reddit.com/gallery/1ow6uve",
        "created_utc": 1763054148.0,
        "num_comments": 251,
        "ups": 4807,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1ownjj0",
        "title": "The same guy that grabbed Ariana Grande at the Wicked: For Good premiere in Singapore today, also ran at The Weeknd during his concert in Australia last October",
        "selftext": "",
        "subreddit": "popculturechat",
        "url": "https://v.redd.it/8i19rh9gm51g1",
        "created_utc": 1763096283.0,
        "num_comments": 428,
        "ups": 2614,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1ozudsp",
        "title": "Cynthia Erivo and Ariana Grande Skipping Interviews at ‘Wicked: For Good’ New York Premiere",
        "selftext": "",
        "subreddit": "popculturechat",
        "url": "https://variety.com/2025/film/news/cynthia-erivo-ariana-grande-skipping-interviews-wicked-for-good-ny-premiere-1236583962/",
        "created_utc": 1763418166.0,
        "num_comments": 236,
        "ups": 4548,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1ow8j6f",
        "title": "Michelle Yeoh wearing Iris Van Harpen Fall Winter 2025 for 'Wicked: For Good' premiere in Singapore",
        "selftext": "",
        "subreddit": "whatthefrockk",
        "url": "https://www.reddit.com/gallery/1ow8j6f",
        "created_utc": 1763057832.0,
        "num_comments": 189,
        "ups": 4551,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1ozl28m",
        "title": "Australian man Johnson Wen jailed after grabbing Ariana Grande at Wicked: For Good premiere",
        "selftext": "",
        "subreddit": "news",
        "url": "https://www.abc.net.au/news/2025-11-18/australian-jailed-for-grabbing-ariana-grande/106020466",
        "created_utc": 1763397470.0,
        "num_comments": 256,
        "ups": 2799,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1ow3w5z",
        "title": "Clearer View: Cynthia, Michelle, and then security swoop in after Ariana is assaulted at the Wicked: For Good Singapore Premiere",
        "selftext": "Insanity. The way Cynthia was in there to win there. It really is a blessing when there are people in your life and in your corner who don’t play about you. And vice versa. \n\nProud of the way this entire case carried on and had a had a good night at the Wicked: For Good Singapore Premiere. ",
        "subreddit": "wicked",
        "url": "https://v.redd.it/4rvcz051l11g1",
        "created_utc": 1763047380.0,
        "num_comments": 221,
        "ups": 3242,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1hftsx6",
        "title": "‘Wicked: Part Two’ Officially Titled ‘Wicked: For Good’",
        "selftext": "",
        "subreddit": "movies",
        "url": "https://variety.com/2024/film/news/wicked-2-title-for-good-1236250920/",
        "created_utc": 1734383792.0,
        "num_comments": 854,
        "ups": 5615,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1p1l8zi",
        "title": "Ariana Grande Asks Photographers To Stop Shouting at ‘Wicked: For Good’ Premiere",
        "selftext": "",
        "subreddit": "DramaLlamaHQ",
        "url": "https://v.redd.it/t302e227da2g1",
        "created_utc": 1763589553.0,
        "num_comments": 419,
        "ups": 1667,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1orr97o",
        "title": "How do I tell life that I don't want to fucking see Wicked: For Good?",
        "selftext": "It's practically every day at this point.\n\nWicked themed perfume.\n\nWicked themed new Sour Wild Berry Skittles (though they were pretty good).\n\nWicked themed fucking Dawn Powerwash.\n\nWicked themed CARS.\n\nI can't take it anymore. Every fucking day I see shit about this stupid ass Wizard of Oz ripoff. I have no plans on begging my mom to go see it because plainly it seems long and boring as fuck.\n\nSorry for the explosive rant, it just seems every day is the exact same because of these fucking ads. The only Wicked product that I willingly(?) consumed were the skittles, and I plan on keeping it that way.\n\nThis movie sure isn't changing me For Good.",
        "subreddit": "CommercialsIHate",
        "url": "https://i.redd.it/967x9l4iq10g1.png",
        "created_utc": 1762613370.0,
        "num_comments": 373,
        "ups": 1839,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1oygaxp",
        "title": "Jeff Goldblum wore Craig Green Spring 2026 at \"Wicked: For Good\" photocall in London and Dior Spring 2026 at \"Wicked: For Good\" premiere in Sydney",
        "selftext": "",
        "subreddit": "whatthefrockk",
        "url": "https://www.reddit.com/gallery/1oygaxp",
        "created_utc": 1763281074.0,
        "num_comments": 168,
        "ups": 3965,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1p166ze",
        "title": "Bowen Yang mentions Fauxmoi on the Wicked for Good red carpet",
        "selftext": "",
        "subreddit": "Fauxmoi",
        "url": "https://v.redd.it/6c10xr0ph72g1",
        "created_utc": 1763554746.0,
        "num_comments": 186,
        "ups": 2567,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1p6wryn",
        "title": "In Wicked For Good, Glinda ends racism",
        "selftext": "",
        "subreddit": "shittymoviedetails",
        "url": "https://i.redd.it/mixd923fpi3g1.jpeg",
        "created_utc": 1764126367.0,
        "num_comments": 132,
        "ups": 3473,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1kmdfav",
        "title": "Official Poster for ‘Wicked: For Good’",
        "selftext": "",
        "subreddit": "movies",
        "url": "https://i.redd.it/6nd2jumumq0f1.jpeg",
        "created_utc": 1747224284.0,
        "num_comments": 403,
        "ups": 2358,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1oodavf",
        "title": "Ariana Grande releases an additional statement asking to not wish danger on her and cast after backlash for not being able to attend Brazil’s Wicked: For Good premiere.",
        "selftext": "",
        "subreddit": "popculturechat",
        "url": "https://www.reddit.com/gallery/1oodavf",
        "created_utc": 1762277048.0,
        "num_comments": 352,
        "ups": 1164,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1o1jrz5",
        "title": "Ariana Grande and Cynthia Erivo have shared photos from the making of ‘Wicked’ and ‘Wicked: For Good’ ahead of the finale’s release next month",
        "selftext": "",
        "subreddit": "popculturechat",
        "url": "https://www.reddit.com/gallery/1o1jrz5",
        "created_utc": 1759950341.0,
        "num_comments": 168,
        "ups": 2465,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1p0lz3m",
        "title": "Michelle Yeoh in Givenchy by Sarah Burton Spring 2026 at ‘Wicked For Good’ premiere in New York",
        "selftext": "With Mikimoto High Jewelry necklace from their 'Les Pétales' collection.",
        "subreddit": "whatthefrockk",
        "url": "https://www.reddit.com/gallery/1p0lz3m",
        "created_utc": 1763495501.0,
        "num_comments": 223,
        "ups": 1373,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1p22gb8",
        "title": "Jonathan Bailey at a gay bar following the ‘WICKED: FOR GOOD’ premiere in New York.",
        "selftext": "",
        "subreddit": "popculturechat",
        "url": "https://i.redd.it/50xr6kd8te2g1.jpeg",
        "created_utc": 1763643373.0,
        "num_comments": 97,
        "ups": 3316,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1otms5a",
        "title": "Ariana Grande wearing Gilbert Adrian (1952) at the ‘Wicked: For Good’ premiere in London (styled by Law Roach)",
        "selftext": "",
        "subreddit": "whatthefrockk",
        "url": "https://www.reddit.com/gallery/1otms5a",
        "created_utc": 1762801614.0,
        "num_comments": 179,
        "ups": 1622,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1oo0gpf",
        "title": "Ariana Grande will not be at the Wicked: For Good press tour in Sãu Paulo",
        "selftext": "",
        "subreddit": "popculturechat",
        "url": "https://i.redd.it/jhwcd6sir6zf1.png",
        "created_utc": 1762238401.0,
        "num_comments": 169,
        "ups": 1762,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1hfthad",
        "title": "Part Two is officially titled “Wicked: For Good”",
        "selftext": "",
        "subreddit": "wicked",
        "url": "https://x.com/wickedmovie/status/1868763128655483269",
        "created_utc": 1734382963.0,
        "num_comments": 322,
        "ups": 3626,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1or7of2",
        "title": "Cynthia Erivo in custom Givenchy by Sarah Burton at the premiere of ‘Wicked: For Good’ in Paris (November 7, 2025)",
        "selftext": "",
        "subreddit": "whatthefrockk",
        "url": "https://www.reddit.com/gallery/1or7of2",
        "created_utc": 1762552876.0,
        "num_comments": 127,
        "ups": 2244,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1l3m7vg",
        "title": "Wicked: For Good - Official Trailer",
        "selftext": "",
        "subreddit": "movies",
        "url": "https://www.youtube.com/watch?v=vt98AlBDI9Y&amp;pp=ygU2V2lja2VkOiBGb3IgR29vZCAtIE9mZmljaWFsIFRyYWlsZXIgdW5pdmVyc2FsIHBpY3R1cmVz",
        "created_utc": 1749084930.0,
        "num_comments": 431,
        "ups": 1411,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1orvykh",
        "title": "Ariana Grande in custom Givenchy by Sarah Burton &amp; Givenchy SS98 Haute Couture by Alexander McQueen promoting ‘Wicked: For Good’ in Paris",
        "selftext": "",
        "subreddit": "whatthefrockk",
        "url": "https://www.reddit.com/gallery/1orvykh",
        "created_utc": 1762624817.0,
        "num_comments": 137,
        "ups": 1843,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1p0goxh",
        "title": "Ariana Grande, Cynthia Erivo and SpongeBob at the premiere of ‘Wicked: For Good’",
        "selftext": "",
        "subreddit": "DramaLlamaHQ",
        "url": "https://www.reddit.com/gallery/1p0goxh",
        "created_utc": 1763483815.0,
        "num_comments": 305,
        "ups": 771,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1oij55x",
        "title": "Ariana Grande in Vivienne Westwood by Andreas Kronthaler Spring-Summer 2025 at 'Wicked For Good' screening in NYC",
        "selftext": "Styled by Law Roach.",
        "subreddit": "whatthefrockk",
        "url": "https://www.reddit.com/gallery/1oij55x",
        "created_utc": 1761680274.0,
        "num_comments": 223,
        "ups": 1066,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1jlyyj4",
        "title": "First look at the first official poster for “Wicked: For Good”",
        "selftext": "",
        "subreddit": "wicked",
        "url": "https://i.redd.it/zcb9juiwhgre1.jpeg",
        "created_utc": 1743178919.0,
        "num_comments": 193,
        "ups": 3002,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1ozude7",
        "title": "Cynthia Erivo and Ariana Grande Skipping Interviews at ‘Wicked: For Good’ New York Premiere",
        "selftext": "",
        "subreddit": "entertainment",
        "url": "https://variety.com/2025/film/news/cynthia-erivo-ariana-grande-skipping-interviews-wicked-for-good-ny-premiere-1236583962/",
        "created_utc": 1763418142.0,
        "num_comments": 219,
        "ups": 941,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1p04qv8",
        "title": "Michelle Yeoh in Givenchy FW25 at the ‘WICKED: FOR GOOD’ premiere in New York [1365 x 2048]",
        "selftext": "",
        "subreddit": "fashionporn",
        "url": "https://i.redd.it/qzvghtgamy1g1.jpeg",
        "created_utc": 1763447331.0,
        "num_comments": 99,
        "ups": 2003,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1owa4f4",
        "title": "Michelle Yeoh wearing Iris Van Harpen Fall Winter 2025 for 'Wicked: For Good' premiere in Singapore [1080 x 1440]",
        "selftext": "",
        "subreddit": "fashionporn",
        "url": "https://i.redd.it/8pojhiulq21g1.jpeg",
        "created_utc": 1763061362.0,
        "num_comments": 77,
        "ups": 2709,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1ocg49v",
        "title": "New ‘Wicked: For Good’ Character Posters",
        "selftext": "",
        "subreddit": "movies",
        "url": "https://i.redd.it/kr5wvedohhwf1.jpeg",
        "created_utc": 1761060720.0,
        "num_comments": 226,
        "ups": 987,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1p3egl4",
        "title": "Are negative reviews for Wicked: For Good reflective of the film's quality or just due to it paling in comparison to Part 1?",
        "selftext": "",
        "subreddit": "Oscars",
        "url": "https://i.redd.it/9mmuhurw7p2g1.png",
        "created_utc": 1763769379.0,
        "num_comments": 434,
        "ups": 488,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1otyflk",
        "title": "Jeff Goldblum ‘Stopped Eating Meat’ After Grappling with Themes of Animal Cruelty in ‘Wicked: For Good’: ‘It’s Changed Me’",
        "selftext": "",
        "subreddit": "popculturechat",
        "url": "https://variety.com/2025/film/news/jeff-goldblum-stopped-eating-meat-wicked-for-good-1236574614/",
        "created_utc": 1762830232.0,
        "num_comments": 153,
        "ups": 1213,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1otn6pf",
        "title": "Ariana Grande, Cynthia Erivo, Michelle Yeoh, Jeff Goldblum and Ethan Slater at the ‘Wicked For Good' premiere in London",
        "selftext": "",
        "subreddit": "Fauxmoi",
        "url": "https://www.reddit.com/gallery/1otn6pf",
        "created_utc": 1762802514.0,
        "num_comments": 219,
        "ups": 869,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1l37udl",
        "title": "New Wicked: For Good postet",
        "selftext": "",
        "subreddit": "wicked",
        "url": "https://i.redd.it/xo1kupkqdx4f1.jpeg",
        "created_utc": 1749049360.0,
        "num_comments": 162,
        "ups": 2352,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1ml74iw",
        "title": "Ariana Grande in Elie Saab SS04 Haute Couture for 'Wicked: For Good' press. Styled by Law Roach.",
        "selftext": "",
        "subreddit": "whatthefrockk",
        "url": "https://www.reddit.com/gallery/1ml74iw",
        "created_utc": 1754687290.0,
        "num_comments": 120,
        "ups": 2428,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1p4pp7a",
        "title": "‘Wicked: For Good’ Opening To $150M Domestic, Adds $76M Overseas For $226M Global Opening; Records Broken For Cynthia Erivo, Ariana Grande, Jon M. Chu, Broadway Musical Feature Take &amp; More – Sunday Update",
        "selftext": "",
        "subreddit": "boxoffice",
        "url": "https://deadline.com/2025/11/box-office-wicked-for-good-1236625569/",
        "created_utc": 1763912282.0,
        "num_comments": 260,
        "ups": 653,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1p0nsqs",
        "title": "Connor and Tanner from “Love on the Spectrum” met Ariana Grande (who is also fan of the show) at the Wicked: For Good premiere in NYC last night.",
        "selftext": "",
        "subreddit": "popculturechat",
        "url": "https://v.redd.it/dwjxlftwx22g1",
        "created_utc": 1763499672.0,
        "num_comments": 68,
        "ups": 2542,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1l3uuud",
        "title": "Wicked: For Good(2025) is releasing exactly one year after it's first movie. This is because the creators actually knows to film planned sequels back-to-back, instead of a 3years minimum gap...",
        "selftext": "",
        "subreddit": "shittymoviedetails",
        "url": "https://i.redd.it/5f7anln8v25f1.jpeg",
        "created_utc": 1749115781.0,
        "num_comments": 125,
        "ups": 2842,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1oosjul",
        "title": "Cynthia Erivo in custom Jean Paul Gaultier for the \"Wicked: For Good\" premiere in São Paulo, Brazil (November 4, 2025)",
        "selftext": "",
        "subreddit": "whatthefrockk",
        "url": "https://www.reddit.com/gallery/1oosjul",
        "created_utc": 1762314063.0,
        "num_comments": 254,
        "ups": 709,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1owary4",
        "title": "Alternative point of view of the “Wicked: For Good” crazy fan",
        "selftext": "",
        "subreddit": "PublicFreakout",
        "url": "https://v.redd.it/1ijixaupc11g1",
        "created_utc": 1763062862.0,
        "num_comments": 122,
        "ups": 1294,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1kqcc9n",
        "title": "I tried creating a poster for wicked for good!",
        "selftext": "I tried to keep the essence of the original poster\nthe leaves on Elphaba's side and the flowers on glinda's side\nI also tried to keep the W that forms with elphaba,\nglinda and kiamo ko!\nalso I made sure that they aren't facing eachother to convey the message of how in the second part, they keep the \"enemies\" propaganda to the public, but yet are still close to eachother.\nhope y'all like it !",
        "subreddit": "wicked",
        "url": "https://i.redd.it/fnyzxvdfvq1f1.jpeg",
        "created_utc": 1747663018.0,
        "num_comments": 144,
        "ups": 2400,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1or3zho",
        "title": "Ariana at the Wicked: For Good Paris Premiere",
        "selftext": "",
        "subreddit": "ariheads",
        "url": "https://www.reddit.com/gallery/1or3zho",
        "created_utc": 1762544185.0,
        "num_comments": 89,
        "ups": 1680,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1ntfof2",
        "title": "The Wicked team organized a private screening of ‘WICKED: For Good’ for Brielle, a sweet angel who is unfortunately battling stage 4 cancer.",
        "selftext": "They worked on an early/work in progress version of the film so Brielle and her family could see the movie before official release.",
        "subreddit": "wicked",
        "url": "https://www.reddit.com/gallery/1ntfof2",
        "created_utc": 1759146008.0,
        "num_comments": 93,
        "ups": 1934,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1p3kdru",
        "title": "'Wicked: For Good' gets an A Cinemascore",
        "selftext": "",
        "subreddit": "boxoffice",
        "url": "https://i.redd.it/wp8tclgymq2g1.png",
        "created_utc": 1763786547.0,
        "num_comments": 213,
        "ups": 642,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1ozwf72",
        "title": "Serena attends the \"Wicked: For Good!\" New York Premiere!",
        "selftext": "Serena attends the \"Wicked: For Good!\" New York Premiere!",
        "subreddit": "LoveIslandUSA",
        "url": "https://www.reddit.com/gallery/1ozwf72",
        "created_utc": 1763423151.0,
        "num_comments": 74,
        "ups": 1843,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1oolrh7",
        "title": "Cynthia Erivo at the premiere of ‘Wicked: For Good’ in São Paulo (November 4, 2025)",
        "selftext": "",
        "subreddit": "popculturechat",
        "url": "https://www.reddit.com/gallery/1oolrh7",
        "created_utc": 1762296020.0,
        "num_comments": 158,
        "ups": 908,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1p0i3hb",
        "title": "\"Wicked: For Good\" debuts with 70% on Rotten Tomatoes and 62 on Metacritic.",
        "selftext": "pretty much out of eace",
        "subreddit": "Oscars",
        "url": "https://www.reddit.com/gallery/1p0i3hb",
        "created_utc": 1763486905.0,
        "num_comments": 309,
        "ups": 447,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1p1d50w",
        "title": "Rachel Zegler in Nensi Dojaka in New York City for the \"Wicked: For Good\" premiere (November 17, 2025)",
        "selftext": "",
        "subreddit": "whatthefrockk",
        "url": "https://www.reddit.com/gallery/1p1d50w",
        "created_utc": 1763571619.0,
        "num_comments": 218,
        "ups": 596,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1o3auhi",
        "title": "Cynthia Erivo will be campaigned in Lead Actress and Ariana Grande will be campaigned in Supporting Actress for Wicked: For Good",
        "selftext": "Not surprising because this is where they were nominated for Part 1 but this is definitely the right choice.",
        "subreddit": "wicked",
        "url": "https://i.redd.it/2r1fixbc8cuf1.jpeg",
        "created_utc": 1760125350.0,
        "num_comments": 104,
        "ups": 1486,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1p31qe4",
        "title": "‘Wicked: For Good’ Overall Previews At $30.8M, Best For Any Movie YTD – Box Office",
        "selftext": "",
        "subreddit": "boxoffice",
        "url": "https://deadline.com/2025/11/box-office-wicked-for-good-1236625569/",
        "created_utc": 1763739305.0,
        "num_comments": 202,
        "ups": 612,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1p0hb5h",
        "title": "'Wicked: For Good' Review Thread",
        "selftext": "I will continue to update this post as reviews come in.\n\n[**Rotten Tomatoes:**](https://www.rottentomatoes.com/m/wicked_for_good) Fresh\n\n**Critics Consensus:** Taking one last lap down the yellow brick road, *Wicked: For Good*'s darker tone and unhurried pacing sometimes get in the way, but this epic conclusion ultimately brings Elphaba and Glinda's story home in rousing fashion.\n\n|Critics|Score|**Number of Reviews**|Average Rating (Unofficial)|\n|:-|:-|:-|:-|\n|**All Critics**|70%|246|6.70/10|\n|**Top Critics**|62%|47|6.30/10|\n\n[**Metacritic:**](https://www.metacritic.com/movie/wicked-for-good/) 58 (57 Reviews)\n\n**Sample Reviews:**\n\nStephanie Zacharek, TIME Magazine - Life is too short for leaden fanfiction liked Wicked: For Good, an extravagant picture that’s not nearly as imaginative as it thinks it is.\n\nMark Kermode, Kermode and Mayo's Take (YouTube) - There are... some neat narratives twists.\n\nPeter Travers, The Travers Take - It's a darker, gloomier, frustratingly less dazzling take on the Wicked IP. Should you still see it? Damn straight since Cynthia Erivo and Ariana Grande are twice as wonderful the second time around. **3/4**\n\nSara Michelle Fetters, [MovieFreak.com](http://MovieFreak.com) \\- Wicked: For Good has precious little in the way of any actual magic. One might even go so far as to call it a bona fide dud. **1.5/4**\n\nNell Minow, Movie Mom - Jonathan Bailey gives Fiyero a quiet smolder as he goes from dancing through life to thinking about choices to following his heart. It is subtle, not a term that comes to mind when considering the joyful maximalism of the \"Wicked\" film. **B+**\n\nKyle Smith, Wall Street Journal - That Wicked: For Good falls short of greatness doesn’t mean it’s bad. There’s plenty of cause to rejoicify, notably the visual splendor, the charming central friendship and some pretty songs, notably “For Good.\"\n\nCaroline Siede, Girl Culture (Substack) - While For Good wants to be a movie that inspires audiences to dig deep into its darker political allegories, ironically, it’s best enjoyed if you’re willing to turn off your brain and just get swept along in its emotions. **B-**\n\nNaveen Kumar, Washington Post - Despite its packed agenda, the film can also feel meandering and directionless. **2/4**\n\nManohla Dargis, New York Times - Even so, from its director to its cast, the movie is a testament to diversity (species included) as a common good as well as to love, friendship and solidarity. It’s on the side of kindness, which is itself, well, a balm.\n\nAisha Harris, NPR - This installment is far from a total misfire -- thank goodness Erivo and Grande are such captivating performers perfectly-suited to these roles -- but the over-padding and stuffing meant to justify this bifurcated packaging soon becomes readily apparent.\n\nWendy Ide, Observer (UK) - There is a crucial ingredient missing: humour. Without it, the spark is extinguished; the astringency that cut through the sentimentality of the first picture is gone.\n\nPeter Howell, Toronto Star - It is darker, denser and in many ways more interesting than its predecessor, though newcomers should beware: entering Oz here without context is like being dropped into a tornado. **3/4**\n\nJohnny Oleksinski, New York Post - Director Jon M. Chu shoots it with tender simplicity and just lets the pair connect and feel. He wisely shows much more restraint in Part Two. **3/4**\n\nWenlei Ma, The Nightly (AU) - Wicked For Good lacks the dynamism and energy of its predecessor. Without the razzle-dazzle seduction and distraction double-punch of the first part’s many, big, all-in numbers, it falls flat much of the time. **2.5/5**\n\nKatie Walsh, Tribune News Service - As it turns out, \"Wicked\" is not too big to fail. In fact, it may be all the excess baggage that weighs down the second installment, making it impossible for the sequel \"Wicked: For Good\" to defy gravity. **2/4**\n\nCarla Meyer, San Francisco Chronicle - It holds too much space for trite dialogue, obvious special effects and pointless skirmishes between green-skinned animal-rights advocate Elphaba and the corrupt Oz administration — and too little for the story’s key relationships. **2/4**\n\nDonald Clarke, Irish Times - If you bought the first film’s brash visual aesthetic – the result of a giant toddler vomiting candyfloss all over Walt Disney World – then you will be relieved to discover it has got no less stomach-unsettling. **2/5**\n\nKristen Lopez, The Film Maven - Wicked: For Good sticks the landing as best as it can. When Erivo and Grande are finally together, it does leave \"a handprint on your heart\" even if everything leading up to it is just drawing that out. **B-**\n\nOdie Henderson, Boston Globe - The follow-up to director Jon M. Chu’s massive 2024 hit is more of the same, only darker. The dark elements are written into the show’s second act, which even fans would agree is not as good as the first. **2/4**\n\nMatt Singer, ScreenCrush - As the lyrics of the title song suggest, a change for good does not necessarily mean a change for the better. **6/10**\n\nAmy Nicholson, Los Angeles Times - The first installment was all tedious set-up. The second has a body count.\n\nJohn Nugent, Empire Magazine - Not quite over the rainbow, then, but just enough of its colours and candour to get by. **3/5**\n\nJake Coyle, Associated Press - I rarely found myself lifted into a movie world, but rather sat watching it -- sometimes with admiration, rarely with delight -- from the mezzanine. The rub of going for maximum effect all the time is that the actors never have a chance to simply be. **2/4**\n\nBrian Truitt, USA Today - Even with an overcomplicated ending and a couple of character development nitpicks, you couldn't ask for a more \"Wicked\" closer. **3.5/4**\n\nCaryn James, [BBC.com](http://BBC.com) \\- This film is as slick and shiny as Glinda's lip gloss, but it may also be just what its many fans want. **4/5**\n\nSandra Hall, Sydney Morning Herald - No doubt the fans will thrill to the music all over again, but the impact is lost when every song seems to be straining to be a showstopper. **3.5/5**\n\nTim Grierson, Screen International - Ultimately director Jon M. Chu’s more-is-more approach has a numbing effect, the endless spectacle leaving little room for nuance, depth or genuine feeling.\n\nIndia Block, London Evening Standard - Everything is stitched together beautifully to create an exhilarating piece of movie musical magic that re-invents the Golden Age. **5/5**\n\nRobbie Collin, Daily Telegraph (UK) - What makes it so frustrating is that director Jon M Chu is an established musicals master; his In the Heights is a modern classic of the form. But the corporate stretch-it-out-and-wring-it-dry approach here has been deadening. **1/5**\n\nClarisse Loughrey, Independent (UK) - For Good has little sense of movement, literally or emotionally – no profound revelations, no wonder or spectacle. All that’s to be done now is for each character to process, via standardised ballad, what they’ve learned. **2/5**\n\nRadheyan Simonpillai, Globe and Mail - Like Fruit Loops that had been left sitting in a bowl of milk for too long – those bright solid colours bleeding out and leaving nothing but a soggy mess.\n\nChristy Lemire, [RogerEbert.com](http://RogerEbert.com) \\- The songs may not be as catchy this time around, but 'Wicked: For Good’ really sings where it counts: with the emotional ache of the fractured friendship at the story’s core. **3/4**\n\nDavid Fear, Rolling Stone - Yet the sensation of a work that, in translation from one medium to another, no longer defies gravity but sort of roughly plummets back down to terra firma can’t easily be shaken off.\n\nAlonso Duralde, The Film Verdict - Wicked fans can delight in one final visit to Oz, while those of us less enamored can hope that the yellow brick road ends here. For good.\n\nRafer Guzman, Newsday - Fans may find the movie serviceable enough, but others may find it underwhelmifying. **2.5/4**\n\nKevin Maher, The Times (UK) - They’ve only gone and done it. The makers of this musical sequel have delivered a film that surpasses last year’s box-office smash in verve, ambition and emotional ache. **4/5**\n\nPeter Bradshaw, Guardian - What a performance from Erivo; it is genuinely moving when the Prince has to convince Elphaba what we, the audience, have always known: that she is beautiful. **4/5**\n\nBillie Melissa, Newsweek - Its sincerity, heart, and belief in a better world are inspiring, and Grande and Erivo deliver the message flawlessly, bringing us into their warm embrace to comfort and inspire.\n\nPeter Debruge, Variety - The film fixes a common complaint of the show, giving the pair more scenes (and songs) together in this final stretch, which now feels like a robust tale unto itself.\n\nBilge Ebiri, New York Magazine/Vulture - It brings the Wicked cycle to a surprisingly satisfying conclusion, at least for now.\n\nWilliam Bibbiani, TheWrap - There hasn’t been a pre-planned 'Part Two' this disappointing since the second half of Andy Muschietti’s 'It.' At least nobody projectile vomits on Jeff Goldblum to the tune of Juice Newton’s 'Angel of the Morning.'\n\nDanny Leigh, Financial Times - It makes a neat takeaway for two bold, impressive movies, whose biggest achievement is to have (mostly) made their own complexity look simple. **3/5**\n\nDavid Rooney, The Hollywood Reporter - Grande floods it with so much feeling that it humanizes and enriches the character and, by extension, the whole movie.\n\nLinda Marric, HeyUGuys - It’s a soaring musical triumph filled with standout performances, extraordinary craft, and an emotional core that is sure to delight fans young and old. **5/5**\n\nKate Erbland, IndieWire - The things that missed the mark the first time, well, they still do. The things that worked in “Wicked”? They still do, but only a clock-tick better. **B-**\n\nLiz Shannon Miller, Consequence - For Good doesn’t sell Elphaba’s decree that \"no good deed will I do again,\" one of the movie’s many muddled moments. It does, however, reflect an age where every message feels muddled, no hero can be trusted. All we know is that something is rotten here. **B-**\n\nDan Rubins, Slant Magazine - The film is stretched out, breathless, and never really emotionally affecting, even on the level of nostalgia. **2.5/4**\n\n**SYNOPSIS:**\n\n*And now whatever way our stories end, I know you have rewritten mine by being my friend…*\n\nLast year’s global cinematic cultural sensation, which became the most successful Broadway film adaptation of all time, now reaches its epic, electrifying, emotional conclusion in Wicked: For Good.\n\nDirected once again by award-winning director Jon M. Chu and starring the spectacular returning cast, led by Academy Award® nominated superstars Cynthia Erivo and Ariana Grande, the final chapter of the untold story of the witches of Oz begins with Elphaba and Glinda estranged and living with the consequences of their choices.\n\nElphaba (Cynthia Erivo), now demonized as The Wicked Witch of the West, lives in exile, hidden within the Ozian forest while continuing her fight for the freedom of Oz’s silenced Animals and desperately trying to expose the truth she knows about The Wizard (Jeff Goldblum).\n\nGlinda, meanwhile, has become the glamorous symbol of Goodness for all of Oz, living at the palace in Emerald City and reveling in the perks of fame and popularity. Under the instruction of Madame Morrible (Oscar® winner Michelle Yeoh), Glinda is deployed to serve as an effervescent comfort to Oz, reassuring the masses that all is well under the rule of The Wizard.\n\nAs Glinda’s stardom expands and she prepares to marry Prince Fiyero (Olivier award winner and Emmy and SAG nominee Jonathan Bailey) in a spectacular Ozian wedding, she is haunted by her separation from Elphaba. She attempts to broker a conciliation between Elphaba and The Wizard, but those efforts will fail, driving Elphaba and Glinda only further apart. The aftershocks will transform Boq (Tony nominee Ethan Slater) and Fiyero forever, and threaten the safety of Elphaba’s sister, Nessarose (Marissa Bode), when a girl from Kansas comes crashing into all their lives.\n\nAs an angry mob rises against the Wicked Witch, Glinda and Elphaba will need to come together one final time. With their singular friendship now the fulcrum of their futures, they will need to truly see each other, with honesty and empathy, if they are to change themselves, and all of Oz, for good.\n\n**CAST:**\n\n* Ariana Grande-Butera as Glinda Upland / Glinda the Good\n* Cynthia Erivo as Elphaba Thropp / The Wicked Witch of the West\n* Jonathan Bailey as Fiyero Tigelaar&gt;! / The Scarecrow !&lt;\n* Ethan Slater as Boq Woodsman&gt;! / The Tin Man!&lt;\n* Bowen Yang as Pfannee\n* Marissa Bode as Nessarose Thropp\n* Colman Domingo as The Cowardly Lion\n* Michelle Yeoh as Madame Morrible\n* Jeff Goldblum as The Wonderful Wizard of Oz\n\n**DIRECTED BY:** Jon M. Chu\n\n**SCREENPLAY BY:** Winnie Holzman, Dana Fox\n\n**BASED ON THE MUSICAL** ***WICKED***: Music and lyrics by Stephen Schwartz; Book by Winnie Holzman; Novel by Gregory Maguire\n\n**PRODUCED BY:** Marc Platt, David Stone\n\n**EXECUTIVE PRODUCERS:** Stephen Schwartz, David Nicksay, Jared LeBoff, Winnie Holzman, Dana Fox\n\n**DIRECTOR OF PHOTOGRAPHY:** Alice Brooks\n\n**PRODUCTION DESIGNER:** Nathan Crowley\n\n**EDITED BY:** Myron Kerstein\n\n**COSTUME DESIGNER:** Paul Tazewell\n\n**MUSIC BY:** John Powell, Stephen Schwartz\n\n**CASTING BY:** Tiffany Little Canfield, Bernard Telsey\n\n**RUNTIME:** 138 Minutes\n\n**RELEASE DATE:** November 21, 2025",
        "subreddit": "boxoffice",
        "url": "https://www.reddit.com/r/boxoffice/comments/1p0hb5h/wicked_for_good_review_thread/",
        "created_utc": 1763485193.0,
        "num_comments": 286,
        "ups": 426,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1p7g1l2",
        "title": "The end credits for Wicked For Good.",
        "selftext": "",
        "subreddit": "marvelmemes",
        "url": "https://i.redd.it/p4oci8g5en3g1.jpeg",
        "created_utc": 1764183114.0,
        "num_comments": 34,
        "ups": 3184,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1oonkyr",
        "title": "Ariana Grande left a message for Wicked fans at the São Paulo ‘Wicked: For Good’ premiere",
        "selftext": "",
        "subreddit": "popculturechat",
        "url": "https://v.redd.it/cw6garn5wbzf1",
        "created_utc": 1762300493.0,
        "num_comments": 177,
        "ups": 654,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1ox2d06",
        "title": "Man who rushed Ariana Grande at \"Wicked: For Good\" premiere faces charges in Singapore",
        "selftext": "",
        "subreddit": "entertainment",
        "url": "https://www.cbsnews.com/news/ariana-grande-man-jumps-barricade-singapore-charged-wicked-for-good-premiere/",
        "created_utc": 1763140305.0,
        "num_comments": 113,
        "ups": 958,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1l3n3o3",
        "title": "Wicked: For Good | Official Trailer",
        "selftext": "",
        "subreddit": "popculturechat",
        "url": "https://v.redd.it/qsl3zti9j05f1",
        "created_utc": 1749087540.0,
        "num_comments": 194,
        "ups": 1134,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1p0smrn",
        "title": "Ariana makes polite request to the photographers at the Wicked: For Good premiere in New York",
        "selftext": "",
        "subreddit": "ariheads",
        "url": "https://v.redd.it/l47cy0mfw32g1",
        "created_utc": 1763511275.0,
        "num_comments": 82,
        "ups": 1212,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1ool72w",
        "title": "Cynthia Erivo's look at the Wicked: For Good premiere in São Paulo",
        "selftext": "",
        "subreddit": "wicked",
        "url": "https://www.reddit.com/gallery/1ool72w",
        "created_utc": 1762294734.0,
        "num_comments": 86,
        "ups": 1238,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1ox7ym4",
        "title": "Wicked: For Good, “No Good Deed” reimagined, featuring icons Cynthia Erivo and Misty Copeland",
        "selftext": "",
        "subreddit": "popculturechat",
        "url": "https://v.redd.it/knhd85jxaa1g1",
        "created_utc": 1763152943.0,
        "num_comments": 53,
        "ups": 1882,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1jms5z9",
        "title": "Better quality look at the poster for 'Wicked: For Good'",
        "selftext": "",
        "subreddit": "wicked",
        "url": "https://i.redd.it/hjnkgo7b4ore1.jpeg",
        "created_utc": 1743271205.0,
        "num_comments": 99,
        "ups": 2599,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1mvjj9c",
        "title": "New look at Cynthia Erivo and Ariana Grande in WICKED: For Good",
        "selftext": "",
        "subreddit": "wicked",
        "url": "https://i.redd.it/ymfxpulca7kf1.jpeg",
        "created_utc": 1755707031.0,
        "num_comments": 73,
        "ups": 1986,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1ooneyp",
        "title": "Ariana sent a video message to the Wicked: For Good Brazil Premiere",
        "selftext": "",
        "subreddit": "ariheads",
        "url": "https://v.redd.it/z5ql5avsubzf1",
        "created_utc": 1762300044.0,
        "num_comments": 121,
        "ups": 818,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1p50upl",
        "title": "Opinions on Marissa Bode’s portrayal of Nessarose in Wicked: For Good?",
        "selftext": "What did you think of Marissa Bode’s Nessarose? I’ve seen really mixed reactions and want to hear more firsthand thoughts.",
        "subreddit": "wickedmovie",
        "url": "https://i.redd.it/70lkvctm833g1.jpeg",
        "created_utc": 1763939118.0,
        "num_comments": 182,
        "ups": 477,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1p0gx3p",
        "title": "'Wicked: For Good' - Review Thread",
        "selftext": "*Now demonized as the Wicked Witch of the West, Elphaba lives in exile in the Ozian forest, while Glinda resides at the palace in Emerald City, reveling in the perks of fame and popularity. As an angry mob rises against the Wicked Witch, she'll need to reunite with Glinda to transform herself, and all of Oz, for good.*\n\n---\n\nRotten Tomatoes: [74%, 92 reviews](https://www.rottentomatoes.com/m/wicked_for_good)\n\nMetacritic: [61, 37 reviews](https://www.metacritic.com/movie/wicked-for-good/)\n\n---\n\n[Lauren LaMagna - NextBestPicture](https://nextbestpicture.com/wicked-for-good/) - 7/10\n\n&gt; \"With Schwartz’s new songs lacking his usual spark and the added dialogue missing the original’s charm, the film can feel somber and padded. But once it leans into being a faithful adaptation of \"Wicked,\" it finds its voice, its strength, and soars\"\n\n[Pete Hammond - Deadline](https://deadline.com/2025/11/wicked-for-good-review-jon-chus-part-2-musical-adaptation-1236620980/)\n\n&gt; \"The visual effects are first rate. So is this whole splendidly realized and cinematic musical adaptation which if you add up the running times of both films comes in just two minutes shy of 5(!) hours. To be honest I wanted more.\"\n\n[John Nugent - Empire](https://www.empireonline.com/movies/reviews/wicked-for-good/) - 3/5\n\n&gt; \"Not quite over the rainbow, then, but just enough of its colours and candour to get by.\"\n\n[Sophia Ciminello - AwardsWatch](https://awardswatch.com/wicked-for-good-review-jon-m-chu-fails-to-cast-a-spell-with-bloated-fan-service-filled-finale-c/) - C-\n\n&gt; \"Despite stellar work from Erivo and Grande, Wicked: For Good can’t justify its existence as its own separate outing.\"\n\n[Christy Lemire - RogerEbert.com](https://www.rogerebert.com/reviews/wicked-2-for-good-film-review-2025) - 3/4\n\n&gt; \"The songs may not be as catchy this time around, but 'Wicked: For Good’ really sings where it counts: with the emotional ache of the fractured friendship at the story’s core.\"\n\n[Kate Erbland - IndieWire](https://www.indiewire.com/criticism/movies/wicked-for-good-review-part-2-1235160567/) - B-\n\n&gt; \"The things that missed the mark the first time, well, they still do. The things that worked in “Wicked”? They still do, but only a clock-tick better.\"\n\n[Robbie Collin - The Telegraph](https://www.telegraph.co.uk/films/2025/11/18/wicked-for-good-review-second-part-fails-to-take-flight/) - 1/5\n\n&gt; \"What makes it so frustrating is that director Jon M Chu is an established musicals master; his In the Heights is a modern classic of the form. But the corporate stretch-it-out-and-wring-it-dry approach here has been deadening.\"\n\n[Peter Debruge - Variety](https://variety.com/2025/film/reviews/wicked-for-good-review-1236581742/)\n\n&gt; \"The film fixes a common complaint of the show, giving the pair more scenes (and songs) together in this final stretch, which now feels like a robust tale unto itself.\"\n\n[David Rooney - The Hollywood Reporter](https://www.hollywoodreporter.com/movies/movie-reviews/wicked-for-good-review-cynthia-erivo-ariana-grande-musical-1236426337/)\n\n&gt; \"Grande floods it with so much feeling that it humanizes and enriches the character and, by extension, the whole movie.\"\n\n[Caryn James - BBC](https://www.bbc.com/culture/article/20251118-wicked-for-good-review) - 4/5\n\n&gt; \"This film is as slick and shiny as Glinda's lip gloss, but it may also be just what its many fans want.\"\n\n[Tim Grierson - Screen International](https://www.screendaily.com/reviews/wicked-for-good-review-cynthia-erivo-sparkles-but-musical-sequel-fails-to-hit-the-high-notes/5210962.article)\n\n&gt; \"Ultimately director Jon M. Chu’s more-is-more approach has a numbing effect, the endless spectacle leaving little room for nuance, depth or genuine feeling.\"",
        "subreddit": "oscarrace",
        "url": "https://www.reddit.com/r/oscarrace/comments/1p0gx3p/wicked_for_good_review_thread/",
        "created_utc": 1763484318.0,
        "num_comments": 577,
        "ups": 134,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1mr3ri4",
        "title": "I'm not remotely prepared for Wicked: For Good",
        "selftext": "@wickedmovie really wanted to torture us all with this post. I'm absolutely devastated for Elphaba and For Good is going to be a tough watch ",
        "subreddit": "wicked",
        "url": "https://i.redd.it/hwcu7f9ys7jf1.jpeg",
        "created_utc": 1755277418.0,
        "num_comments": 59,
        "ups": 2441,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1l37svw",
        "title": "New poster for Wicked: For Good.",
        "selftext": "",
        "subreddit": "movies",
        "url": "https://i.redd.it/5pqi5rmhdx4f1.jpeg",
        "created_utc": 1749049277.0,
        "num_comments": 243,
        "ups": 783,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1oryvja",
        "title": "Michelle Yeoh wearing custom Balenciaga based on the Spring 2026 collection (Look 1) and Maison Margiela Fall 2025 Haute Couture (Look 2) at the “Wicked For Good” premiere in Paris (7 November 2025)",
        "selftext": "",
        "subreddit": "whatthefrockk",
        "url": "https://www.reddit.com/gallery/1oryvja",
        "created_utc": 1762631822.0,
        "num_comments": 70,
        "ups": 1303,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1npaixz",
        "title": "Wicked: For Good | Final Trailer",
        "selftext": "",
        "subreddit": "movies",
        "url": "https://www.youtube.com/watch?v=R2Xubj7lazE",
        "created_utc": 1758716150.0,
        "num_comments": 195,
        "ups": 579,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1otm52v",
        "title": "Ariana Grande and Cynthia Erivo at the Wicked: For Good premiere in London",
        "selftext": "",
        "subreddit": "popculturechat",
        "url": "https://www.reddit.com/gallery/1otm52v",
        "created_utc": 1762800254.0,
        "num_comments": 165,
        "ups": 529,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1p3wzph",
        "title": "Audience breakdown and diversity demos for Wicked: For Good",
        "selftext": "",
        "subreddit": "boxoffice",
        "url": "https://i.redd.it/k19dpbyp1u2g1.png",
        "created_utc": 1763827862.0,
        "num_comments": 211,
        "ups": 369,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1l3m7yk",
        "title": "WICKED: FOR GOOD -  Trailer",
        "selftext": "",
        "subreddit": "boxoffice",
        "url": "https://youtu.be/vt98AlBDI9Y?si=4uOdhTdTotvN0Iie",
        "created_utc": 1749084939.0,
        "num_comments": 278,
        "ups": 658,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1ovieok",
        "title": "Ariana Grande in a vintage 1950s demi-couture gown at \"Wicked: For Good\" after-party in Mayfair, London. Sourced from Amarcord Vintage Fashion. Styled by Law Roach.",
        "selftext": "[Dress description: ](https://www.amarcordvintagefashion.com/products/vintage-1950s-couture-black-pleated-tulle-with-flowers-strapless-gown?variant=43986330222811Jaw-dropping)*Vintage 1950s gown. This breathtaking dress is made to couture standards and the details are absolutely to die for. Tiered, pleated tulle layered over two more layers of tulle, all atop a layered and structured taffeta full skirt. Strapless, ruched tulle bodice layered over taffeta and then lined in silk. Nipped waist makes the bodice fitted and enhances the full skirt silhouette. Zip closure at the backside that is then concealed with a row of buttons. Attached to the bodice is a sheer layer of tulle that is like a reverse cape, which buttons at the back of the neck and is open beyond that. You can leave it hanging or tie it at the back of the waist to allow for arm movement. And if it couldn't get better than that, all of this is adorned with handmade, pale pinkish-white flowers, trimmed and centered in black velvet. Surprisingly, there is no label within, but trust us when we say that this dress is a masterpiece and is made to the levels of all of the greatest 1950s couturiers like Balenciaga, Balmain, Jacques Fath, and more.*",
        "subreddit": "whatthefrockk",
        "url": "https://www.reddit.com/gallery/1ovieok",
        "created_utc": 1762983630.0,
        "num_comments": 113,
        "ups": 741,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1p3zkkx",
        "title": "In \"Wicked: For Good\" (2025) why didn't they just kill Elphaba with a magic surface-to-air missile or some shit",
        "selftext": "",
        "subreddit": "shittymoviedetails",
        "url": "https://i.redd.it/y0lo4km5ku2g1.png",
        "created_utc": 1763834033.0,
        "num_comments": 47,
        "ups": 1640,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1njcvr3",
        "title": "wicked: for good soundtrack tracklist",
        "selftext": "",
        "subreddit": "wicked",
        "url": "https://i.redd.it/ve1oi3jf6qpf1.png",
        "created_utc": 1758114965.0,
        "num_comments": 122,
        "ups": 899,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1nddxdy",
        "title": "New Wicked: For Good images",
        "selftext": "From EW's Entertainment Fall Movie Preview 2025 Exclusive\n\nImages credited to Giles Keyte/ Universal Pictures ",
        "subreddit": "wicked",
        "url": "https://www.reddit.com/gallery/1nddxdy",
        "created_utc": 1757510147.0,
        "num_comments": 73,
        "ups": 1542,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1ozxpb7",
        "title": "Ariana Grande in custom Schiaparelli and Cynthia Erivo in custom Balenciaga by Pier Paolo Piccioli at the premiere of “WICKED: For Good” in New York City",
        "selftext": "",
        "subreddit": "whatthefrockk",
        "url": "https://www.reddit.com/gallery/1ozxpb7",
        "created_utc": 1763426429.0,
        "num_comments": 105,
        "ups": 749,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1otqh9e",
        "title": "Marissa Bode in Bibhu Mohapatra FW25 at the “Wicked for Good” Premiere (November 10, 2025)",
        "selftext": "",
        "subreddit": "whatthefrockk",
        "url": "https://www.reddit.com/gallery/1otqh9e",
        "created_utc": 1762809853.0,
        "num_comments": 57,
        "ups": 1419,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1p4bims",
        "title": "Looks like $43M SAT for #WickedForGood. 2-days cume $112M. Weekend headed for $145M.",
        "selftext": "",
        "subreddit": "boxoffice",
        "url": "https://i.redd.it/4fi0bilw6x2g1.jpeg",
        "created_utc": 1763865896.0,
        "num_comments": 207,
        "ups": 336,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1ohx9vd",
        "title": "‘Wicked: For Good’ First Reactions Thread",
        "selftext": "Please share any reactions you find in the comments below \n\n[Last years reactions to ‘Wicked’](https://www.reddit.com/r/oscarrace/s/SPcdBh6EQj)\n\n[Clayton Davis](https://x.com/byclaytondavis/status/1982990705875399092?s=46) - #WickedForGood flies high. Jon M. Chu helms an emotionally timely piece that deepens every spell cast by the first film. No surprise, Cynthia Erivo &amp; Ariana Grande are SPECTACULAR (again). You're NOT ready for the “For Good” duet. A heartfelt end to Oz’s greatest friendship.\n\n[David Gordon](https://x.com/MrDavidGordon/status/1982984062542508538) - “If Wicked part one was faithful to the blueprint of the stage, Wicked: For Good builds out the world to create a full and different (but the same) and extremely emotional version of act 2. It’s a thrill ride and a heartbreaker and it’s sexy and everything you want it to be.”\n\n[Kobi Kassal](https://x.com/kkassal/status/1982989609765351443?s=46) - Bring your tissues and watch out cause Ariana Grande is gonna win??! that Oscar. \n\n[Jazz Tangcay](https://x.com/jazzt/status/1982990705174659275?s=46) - Get ready because #WickedForGood exceeds all expectations. Jon M. Chu is a genius in the way he brings this to a close. Elphaba and Glinda’s stories are expanded, and leave you with an emotional gut punch at the end. Cynthia Erivo is magnificent, but get ready for Ariana Grande as she takes this performance to the next level and is a tour de force.  And wow, the world building, the costumes, and Alice Brooks’ cinematography deserve your attention. Can not wait to see it again. I sobbed hard. Wicked: For Good is sheer musical greatness.\n\n[Destiny Jackson](https://x.com/destinydreadful/status/1982991403778281526?s=46) - All Good Deeds Go Rewarded in Wicked: For Good. It’s an epic and heartbreakingly tender conclusion to one of the most dynamic friendships in pop culture history. There’s a lot for fans of the Broadway show to love with butterfly kiss sized surprises in store. With some reservations that I carried over from the Act 2 Stage Show to Wicked: For Good, I’m happy to report that… SOMEHOW I’VE FALLEN UNDER Jon M. Chu’s spell. He managed to make Elphaba and Glinda’s friendship more vulnerable and powerful. Ariana Grande’s soaring turn as the girl in the bubble is an emotionally complex tightrope that she balances effortlessly as she tries oscillating between the Good Witch’s need for perfection and the struggle for  Glinda’s agency. Cynthia Erivo continues to imbue her gravity defying powers from Wicked Pt 1 and channel them into a new intensity of care, passion and frustration bringing to life an Elphaba that has had enough of that Emerald City bullshit! Full of love for her friend and for the place she calls her home, Erivo lights Elphaba’s verve on fire expanding more of the character than before. Jonathan Bailey continues as the heartthrob of a lifetime in Wicked: For Good. His performance as the playboy w/ a dislike for all things nerd-ifying is *a real no brainer*. He digs deep to show just how much encountering the witch of his heart’s desire can change a man for good.\n\n[Chris Murphy](https://x.com/christress/status/1982994992261124287) - Saw wicked for good last month and believe me when i say that it expands and deepens the original source material in generally exciting and innovative ways. Cynthia and Ari take their performances to the next level with jaw dropping performances. The film fully sticks the landing",
        "subreddit": "oscarrace",
        "url": "https://www.reddit.com/r/oscarrace/comments/1ohx9vd/wicked_for_good_first_reactions_thread/",
        "created_utc": 1761616498.0,
        "num_comments": 340,
        "ups": 229,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1p6h31c",
        "title": "Wicked For Good SPOILERS",
        "selftext": "",
        "subreddit": "wicked",
        "url": "https://www.reddit.com/gallery/1p6h31c",
        "created_utc": 1764088374.0,
        "num_comments": 48,
        "ups": 1476,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1p5ap8i",
        "title": "If 'Wicked: For Good' is nominated for Best Picture, it will be the lowest-rated film of the last 10 years to do so other than Bohemian Rhapsody and Don't Look Up",
        "selftext": "",
        "subreddit": "Oscars",
        "url": "https://i.redd.it/nj3znhram53g1.jpeg",
        "created_utc": 1763968913.0,
        "num_comments": 183,
        "ups": 379,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1p197ai",
        "title": "‘Wicked: For Good’ Aims for Biggest Opening of 2025 With $150 Million to $180 Million Debut",
        "selftext": "",
        "subreddit": "boxoffice",
        "url": "https://variety.com/2025/film/box-office/wicked-for-good-box-office-opening-weekend-projection-record-1236584693/",
        "created_utc": 1763562710.0,
        "num_comments": 120,
        "ups": 606,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1ornusl",
        "title": "Cynthia Erivo and Ariana Grande in custom Givenchy (both) at the Paris premiere of ‘WICKED: For Good’ [1320 x 1592]",
        "selftext": "",
        "subreddit": "fashionporn",
        "url": "https://i.redd.it/uy386mc1y00g1.jpeg",
        "created_utc": 1762603818.0,
        "num_comments": 70,
        "ups": 1104,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1o9hqkf",
        "title": "Does anyone still wear a hat? Patti LuPone as The Cowardly Lion in WICKED: FOR GOOD",
        "selftext": "",
        "subreddit": "Broadway",
        "url": "https://i.redd.it/uxwsgvx6lrvf1.jpeg",
        "created_utc": 1760747123.0,
        "num_comments": 79,
        "ups": 1075,
        "downs": 0,
        "search_query": "wicked: for good"
    },
    {
        "id": "1l33psf",
        "title": "First Look at Wicked: For Good",
        "selftext": "In the first look at *Wicked: For Good*, director Jon M. Chu teases new songs—written by *Wicked* composer Stephen Schwartz—plus the introduction of Dorothy Gale, Glinda’s wedding, and more. \n\nRead the exclusive interview: [https://www.vanityfair.com/hollywood/story/wicked-for-good-first-look-toto-were-not-in-shiz-anymore](https://www.vanityfair.com/hollywood/story/wicked-for-good-first-look-toto-were-not-in-shiz-anymore)",
        "subreddit": "wicked",
        "url": "https://www.reddit.com/gallery/1l33psf",
        "created_utc": 1749038417.0,
        "num_comments": 77,
        "ups": 1898,
        "downs": 0,
        "search_query": "wicked: for good"
    }
]